ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm

========================================================================

** ELF Header Information

    File Name: stm32g431rbt6_advanced\stm32g431rbt6_advanced.axf

    Machine class: ELFCLASS32 (32-bit)
    Data encoding: ELFDATA2LSB (Little endian)
    Header version: EV_CURRENT (Current version)
    Operating System ABI: none
    ABI Version: 0
    File Type: ET_EXEC (Executable) (2)
    Machine: EM_ARM (ARM)

    Image Entry point: 0x080001d9
    Flags: EF_ARM_HASENTRY + EF_ARM_ABI_FLOAT_HARD (0x05000402)

    ARM ELF revision: 5 (ABI version 2)

    Conforms to Hard float procedure-call standard

    Built with
    Component: ARM Compiler 5.06 update 7 (build 960) Tool: armasm [4d35fa]
    Component: ARM Compiler 5.06 update 7 (build 960) Tool: armlink [4d3601]

    Header size: 52 bytes (0x34)
    Program header entry size: 32 bytes (0x20)
    Section header entry size: 40 bytes (0x28)

    Program header entries: 1
    Section header entries: 16

    Program header offset: 2050964 (0x001f4b94)
    Section header offset: 2050996 (0x001f4bb4)

    Section header string table index: 15

========================================================================

** Program header #0 (PT_LOAD) [PF_X + PF_W + PF_R + PF_ARM_ENTRY]
    Size : 45132 bytes (36736 bytes in file)
    Virtual address: 0x08000000 (Alignment 8)


========================================================================

** Section #1 'ER_IROM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 36476 bytes (alignment 4)
    Address: 0x08000000

    $d.realdata
    RESET
    __Vectors
        0x08000000:    200021d0    .!.     DCD    536879568
        0x08000004:    080002b9    ....    DCD    134218425
        0x08000008:    080040ef    .@..    DCD    134234351
        0x0800000c:    08002291    ."..    DCD    134226577
        0x08000010:    080040ed    .@..    DCD    134234349
        0x08000014:    080005e1    ....    DCD    134219233
        0x08000018:    08006e4b    Kn..    DCD    134245963
        0x0800001c:    00000000    ....    DCD    0
        0x08000020:    00000000    ....    DCD    0
        0x08000024:    00000000    ....    DCD    0
        0x08000028:    00000000    ....    DCD    0
        0x0800002c:    08004c6d    mL..    DCD    134237293
        0x08000030:    08000665    e...    DCD    134219365
        0x08000034:    00000000    ....    DCD    0
        0x08000038:    08004a8b    .J..    DCD    134236811
        0x0800003c:    08005121    !Q..    DCD    134238497
        0x08000040:    080002d3    ....    DCD    134218451
        0x08000044:    080002d3    ....    DCD    134218451
        0x08000048:    080002d3    ....    DCD    134218451
        0x0800004c:    080002d3    ....    DCD    134218451
        0x08000050:    080002d3    ....    DCD    134218451
        0x08000054:    080002d3    ....    DCD    134218451
        0x08000058:    080002d3    ....    DCD    134218451
        0x0800005c:    080002d3    ....    DCD    134218451
        0x08000060:    08000689    ....    DCD    134219401
        0x08000064:    080002d3    ....    DCD    134218451
        0x08000068:    080002d3    ....    DCD    134218451
        0x0800006c:    0800065d    ]...    DCD    134219357
        0x08000070:    0800065f    _...    DCD    134219359
        0x08000074:    080002d3    ....    DCD    134218451
        0x08000078:    080002d3    ....    DCD    134218451
        0x0800007c:    080002d3    ....    DCD    134218451
        0x08000080:    080002d3    ....    DCD    134218451
        0x08000084:    00000000    ....    DCD    0
        0x08000088:    080004af    ....    DCD    134218927
        0x0800008c:    080002d3    ....    DCD    134218451
        0x08000090:    08006dd9    .m..    DCD    134245849
        0x08000094:    080002d3    ....    DCD    134218451
        0x08000098:    080002d3    ....    DCD    134218451
        0x0800009c:    080002d3    ....    DCD    134218451
        0x080000a0:    080002d3    ....    DCD    134218451
        0x080000a4:    080002d3    ....    DCD    134218451
        0x080000a8:    080002d3    ....    DCD    134218451
        0x080000ac:    080002d3    ....    DCD    134218451
        0x080000b0:    080002d3    ....    DCD    134218451
        0x080000b4:    080002d3    ....    DCD    134218451
        0x080000b8:    080002d3    ....    DCD    134218451
        0x080000bc:    080002d3    ....    DCD    134218451
        0x080000c0:    080002d3    ....    DCD    134218451
        0x080000c4:    080002d3    ....    DCD    134218451
        0x080000c8:    080002d3    ....    DCD    134218451
        0x080000cc:    080002d3    ....    DCD    134218451
        0x080000d0:    080002d3    ....    DCD    134218451
        0x080000d4:    080002d3    ....    DCD    134218451
        0x080000d8:    080002d3    ....    DCD    134218451
        0x080000dc:    080002d3    ....    DCD    134218451
        0x080000e0:    080002d3    ....    DCD    134218451
        0x080000e4:    080002d3    ....    DCD    134218451
        0x080000e8:    080002d3    ....    DCD    134218451
        0x080000ec:    080002d3    ....    DCD    134218451
        0x080000f0:    080002d3    ....    DCD    134218451
        0x080000f4:    080002d3    ....    DCD    134218451
        0x080000f8:    080002d3    ....    DCD    134218451
        0x080000fc:    00000000    ....    DCD    0
        0x08000100:    00000000    ....    DCD    0
        0x08000104:    080002d3    ....    DCD    134218451
        0x08000108:    00000000    ....    DCD    0
        0x0800010c:    080002d3    ....    DCD    134218451
        0x08000110:    080002d3    ....    DCD    134218451
        0x08000114:    00000000    ....    DCD    0
        0x08000118:    080002d3    ....    DCD    134218451
        0x0800011c:    080002d3    ....    DCD    134218451
        0x08000120:    08000661    a...    DCD    134219361
        0x08000124:    08000663    c...    DCD    134219363
        0x08000128:    080002d3    ....    DCD    134218451
        0x0800012c:    080002d3    ....    DCD    134218451
        0x08000130:    080002d3    ....    DCD    134218451
        0x08000134:    00000000    ....    DCD    0
        0x08000138:    00000000    ....    DCD    0
        0x0800013c:    080002d3    ....    DCD    134218451
        0x08000140:    080002d3    ....    DCD    134218451
        0x08000144:    080002d3    ....    DCD    134218451
        0x08000148:    00000000    ....    DCD    0
        0x0800014c:    00000000    ....    DCD    0
        0x08000150:    00000000    ....    DCD    0
        0x08000154:    00000000    ....    DCD    0
        0x08000158:    00000000    ....    DCD    0
        0x0800015c:    00000000    ....    DCD    0
        0x08000160:    00000000    ....    DCD    0
        0x08000164:    00000000    ....    DCD    0
        0x08000168:    00000000    ....    DCD    0
        0x0800016c:    080002d3    ....    DCD    134218451
        0x08000170:    080002d3    ....    DCD    134218451
        0x08000174:    00000000    ....    DCD    0
        0x08000178:    00000000    ....    DCD    0
        0x0800017c:    00000000    ....    DCD    0
        0x08000180:    00000000    ....    DCD    0
        0x08000184:    080002d3    ....    DCD    134218451
        0x08000188:    00000000    ....    DCD    0
        0x0800018c:    00000000    ....    DCD    0
        0x08000190:    00000000    ....    DCD    0
        0x08000194:    00000000    ....    DCD    0
        0x08000198:    00000000    ....    DCD    0
        0x0800019c:    00000000    ....    DCD    0
        0x080001a0:    00000000    ....    DCD    0
        0x080001a4:    00000000    ....    DCD    0
        0x080001a8:    080002d3    ....    DCD    134218451
        0x080001ac:    080002d3    ....    DCD    134218451
        0x080001b0:    080002d3    ....    DCD    134218451
        0x080001b4:    080002d3    ....    DCD    134218451
        0x080001b8:    080002d3    ....    DCD    134218451
        0x080001bc:    00000000    ....    DCD    0
        0x080001c0:    00000000    ....    DCD    0
        0x080001c4:    080002d3    ....    DCD    134218451
        0x080001c8:    00000000    ....    DCD    0
        0x080001cc:    00000000    ....    DCD    0
        0x080001d0:    080002d3    ....    DCD    134218451
        0x080001d4:    080002d3    ....    DCD    134218451
    $t
    !!!main
    __Vectors_End
    __main
        0x080001d8:    f000f802    ....    BL       __scatterload ; 0x80001e0
        0x080001dc:    f000f85c    ..\.    BL       __rt_entry ; 0x8000298
    !!!scatter
    __scatterload
    __scatterload_rt2
    __scatterload_rt2_thumb_only
        0x080001e0:    a00a        ..      ADR      r0,{pc}+0x2c ; 0x800020c
        0x080001e2:    e8900c00    ....    LDM      r0,{r10,r11}
        0x080001e6:    4482        .D      ADD      r10,r10,r0
        0x080001e8:    4483        .D      ADD      r11,r11,r0
        0x080001ea:    f1aa0701    ....    SUB      r7,r10,#1
    __scatterload_null
        0x080001ee:    45da        .E      CMP      r10,r11
        0x080001f0:    d101        ..      BNE      0x80001f6 ; __scatterload_null + 8
        0x080001f2:    f000f851    ..Q.    BL       __rt_entry ; 0x8000298
        0x080001f6:    f2af0e09    ....    ADR      lr,{pc}-7 ; 0x80001ef
        0x080001fa:    e8ba000f    ....    LDM      r10!,{r0-r3}
        0x080001fe:    f0130f01    ....    TST      r3,#1
        0x08000202:    bf18        ..      IT       NE
        0x08000204:    1afb        ..      SUBNE    r3,r7,r3
        0x08000206:    f0430301    C...    ORR      r3,r3,#1
        0x0800020a:    4718        .G      BX       r3
    $d
        0x0800020c:    00008c50    P...    DCD    35920
        0x08000210:    00008c70    p...    DCD    35952
    $t
    !!dczerorl2
    __decompress
    __decompress1
        0x08000214:    440a        .D      ADD      r2,r2,r1
        0x08000216:    f04f0c00    O...    MOV      r12,#0
        0x0800021a:    f8103b01    ...;    LDRB     r3,[r0],#1
        0x0800021e:    f0130407    ....    ANDS     r4,r3,#7
        0x08000222:    bf08        ..      IT       EQ
        0x08000224:    f8104b01    ...K    LDRBEQ   r4,[r0],#1
        0x08000228:    111d        ..      ASRS     r5,r3,#4
        0x0800022a:    bf08        ..      IT       EQ
        0x0800022c:    f8105b01    ...[    LDRBEQ   r5,[r0],#1
        0x08000230:    1e64        d.      SUBS     r4,r4,#1
        0x08000232:    d005        ..      BEQ      0x8000240 ; __decompress + 44
        0x08000234:    f8106b01    ...k    LDRB     r6,[r0],#1
        0x08000238:    1e64        d.      SUBS     r4,r4,#1
        0x0800023a:    f8016b01    ...k    STRB     r6,[r1],#1
        0x0800023e:    d1f9        ..      BNE      0x8000234 ; __decompress + 32
        0x08000240:    f0130f08    ....    TST      r3,#8
        0x08000244:    bf1e        ..      ITTT     NE
        0x08000246:    f8104b01    ...K    LDRBNE   r4,[r0],#1
        0x0800024a:    1cad        ..      ADDNE    r5,r5,#2
        0x0800024c:    1b0c        ..      SUBNE    r4,r1,r4
        0x0800024e:    d109        ..      BNE      0x8000264 ; __decompress + 80
        0x08000250:    1e6d        m.      SUBS     r5,r5,#1
        0x08000252:    bf58        X.      IT       PL
        0x08000254:    f801cb01    ....    STRBPL   r12,[r1],#1
        0x08000258:    d5fa        ..      BPL      0x8000250 ; __decompress + 60
        0x0800025a:    e005        ..      B        0x8000268 ; __decompress + 84
        0x0800025c:    f8146b01    ...k    LDRB     r6,[r4],#1
        0x08000260:    f8016b01    ...k    STRB     r6,[r1],#1
        0x08000264:    1e6d        m.      SUBS     r5,r5,#1
        0x08000266:    d5f9        ..      BPL      0x800025c ; __decompress + 72
        0x08000268:    4291        .B      CMP      r1,r2
        0x0800026a:    d3d6        ..      BCC      0x800021a ; __decompress + 6
        0x0800026c:    4770        pG      BX       lr
        0x0800026e:    0000        ..      MOVS     r0,r0
    !!handler_zi
    __scatterload_zeroinit
        0x08000270:    2300        .#      MOVS     r3,#0
        0x08000272:    2400        .$      MOVS     r4,#0
        0x08000274:    2500        .%      MOVS     r5,#0
        0x08000276:    2600        .&      MOVS     r6,#0
        0x08000278:    3a10        .:      SUBS     r2,r2,#0x10
        0x0800027a:    bf28        (.      IT       CS
        0x0800027c:    c178        x.      STMCS    r1!,{r3-r6}
        0x0800027e:    d8fb        ..      BHI      0x8000278 ; __scatterload_zeroinit + 8
        0x08000280:    0752        R.      LSLS     r2,r2,#29
        0x08000282:    bf28        (.      IT       CS
        0x08000284:    c130        0.      STMCS    r1!,{r4,r5}
        0x08000286:    bf48        H.      IT       MI
        0x08000288:    600b        .`      STRMI    r3,[r1,#0]
        0x0800028a:    4770        pG      BX       lr
    .ARM.Collect$$libinit$$00000000
    __rt_lib_init
        0x0800028c:    b51f        ..      PUSH     {r0-r4,lr}
    .ARM.Collect$$libinit$$00000001
    __rt_lib_init_fp_1
        0x0800028e:    f008fb9d    ....    BL       _fp_init ; 0x80089cc
    .ARM.Collect$$libinit$$00000004
    .ARM.Collect$$libinit$$0000000A
    .ARM.Collect$$libinit$$0000000C
    .ARM.Collect$$libinit$$0000000E
    .ARM.Collect$$libinit$$00000011
    .ARM.Collect$$libinit$$00000013
    .ARM.Collect$$libinit$$00000015
    .ARM.Collect$$libinit$$00000017
    .ARM.Collect$$libinit$$00000019
    .ARM.Collect$$libinit$$0000001B
    .ARM.Collect$$libinit$$0000001D
    .ARM.Collect$$libinit$$0000001F
    .ARM.Collect$$libinit$$00000021
    .ARM.Collect$$libinit$$00000023
    .ARM.Collect$$libinit$$00000025
    .ARM.Collect$$libinit$$0000002C
    .ARM.Collect$$libinit$$0000002E
    .ARM.Collect$$libinit$$00000030
    .ARM.Collect$$libinit$$00000032
    .ARM.Collect$$libinit$$00000033
    __rt_lib_init_alloca_1
    __rt_lib_init_argv_1
    __rt_lib_init_atexit_1
    __rt_lib_init_clock_1
    __rt_lib_init_cpp_1
    __rt_lib_init_exceptions_1
    __rt_lib_init_fp_trap_1
    __rt_lib_init_getenv_1
    __rt_lib_init_heap_1
    __rt_lib_init_lc_collate_1
    __rt_lib_init_lc_ctype_1
    __rt_lib_init_lc_monetary_1
    __rt_lib_init_lc_numeric_1
    __rt_lib_init_lc_time_1
    __rt_lib_init_preinit_1
    __rt_lib_init_rand_1
    __rt_lib_init_return
    __rt_lib_init_signal_1
    __rt_lib_init_stdio_1
    __rt_lib_init_user_alloc_1
        0x08000292:    bd1f        ..      POP      {r0-r4,pc}
    .ARM.Collect$$libshutdown$$00000000
    __rt_lib_shutdown
        0x08000294:    b510        ..      PUSH     {r4,lr}
    .ARM.Collect$$libshutdown$$00000002
    .ARM.Collect$$libshutdown$$00000004
    .ARM.Collect$$libshutdown$$00000006
    .ARM.Collect$$libshutdown$$00000009
    .ARM.Collect$$libshutdown$$0000000C
    .ARM.Collect$$libshutdown$$0000000E
    .ARM.Collect$$libshutdown$$00000011
    .ARM.Collect$$libshutdown$$00000012
    __rt_lib_shutdown_cpp_1
    __rt_lib_shutdown_fini_1
    __rt_lib_shutdown_fp_trap_1
    __rt_lib_shutdown_heap_1
    __rt_lib_shutdown_return
    __rt_lib_shutdown_signal_1
    __rt_lib_shutdown_stdio_1
    __rt_lib_shutdown_user_alloc_1
        0x08000296:    bd10        ..      POP      {r4,pc}
    .ARM.Collect$$rtentry$$00000000
    .ARM.Collect$$rtentry$$00000002
    .ARM.Collect$$rtentry$$00000004
    __rt_entry
    __rt_entry_presh_1
    __rt_entry_sh
        0x08000298:    f000f8cf    ....    BL       __user_setup_stackheap ; 0x800043a
        0x0800029c:    4611        .F      MOV      r1,r2
    .ARM.Collect$$rtentry$$00000009
    .ARM.Collect$$rtentry$$0000000A
    __rt_entry_li
    __rt_entry_postsh_1
        0x0800029e:    f7fffff5    ....    BL       __rt_lib_init ; 0x800028c
    .ARM.Collect$$rtentry$$0000000C
    .ARM.Collect$$rtentry$$0000000D
    __rt_entry_main
    __rt_entry_postli_1
        0x080002a2:    f006fe95    ....    BL       main ; 0x8006fd0
        0x080002a6:    f000f8ed    ....    BL       exit ; 0x8000484
    .ARM.Collect$$rtexit$$00000000
    __rt_exit
        0x080002aa:    b403        ..      PUSH     {r0,r1}
    .ARM.Collect$$rtexit$$00000002
    .ARM.Collect$$rtexit$$00000003
    __rt_exit_ls
    __rt_exit_prels_1
        0x080002ac:    f7fffff2    ....    BL       __rt_lib_shutdown ; 0x8000294
    .ARM.Collect$$rtexit$$00000004
    __rt_exit_exit
        0x080002b0:    bc03        ..      POP      {r0,r1}
        0x080002b2:    f000f8f5    ....    BL       _sys_exit ; 0x80004a0
        0x080002b6:    0000        ..      MOVS     r0,r0
    .text
    $v0
    Reset_Handler
        0x080002b8:    4809        .H      LDR      r0,[pc,#36] ; [0x80002e0] = 0x8005231
        0x080002ba:    4780        .G      BLX      r0
        0x080002bc:    4809        .H      LDR      r0,[pc,#36] ; [0x80002e4] = 0x80001d9
        0x080002be:    4700        .G      BX       r0
        0x080002c0:    e7fe        ..      B        0x80002c0 ; Reset_Handler + 8
        0x080002c2:    e7fe        ..      B        0x80002c2 ; Reset_Handler + 10
        0x080002c4:    e7fe        ..      B        0x80002c4 ; Reset_Handler + 12
        0x080002c6:    e7fe        ..      B        0x80002c6 ; Reset_Handler + 14
        0x080002c8:    e7fe        ..      B        0x80002c8 ; Reset_Handler + 16
        0x080002ca:    e7fe        ..      B        0x80002ca ; Reset_Handler + 18
        0x080002cc:    e7fe        ..      B        0x80002cc ; Reset_Handler + 20
        0x080002ce:    e7fe        ..      B        0x80002ce ; Reset_Handler + 22
        0x080002d0:    e7fe        ..      B        0x80002d0 ; Reset_Handler + 24
    COMP1_2_3_IRQHandler
    COMP4_IRQHandler
    CORDIC_IRQHandler
    CRS_IRQHandler
    DMA1_Channel3_IRQHandler
    DMA1_Channel4_IRQHandler
    DMA1_Channel5_IRQHandler
    DMA1_Channel6_IRQHandler
    DMA2_Channel3_IRQHandler
    DMA2_Channel4_IRQHandler
    DMA2_Channel5_IRQHandler
    DMA2_Channel6_IRQHandler
    DMAMUX_OVR_IRQHandler
    EXTI0_IRQHandler
    EXTI15_10_IRQHandler
    EXTI1_IRQHandler
    EXTI3_IRQHandler
    EXTI4_IRQHandler
    EXTI9_5_IRQHandler
    FDCAN1_IT0_IRQHandler
    FDCAN1_IT1_IRQHandler
    FLASH_IRQHandler
    FMAC_IRQHandler
    FPU_IRQHandler
    I2C1_ER_IRQHandler
    I2C1_EV_IRQHandler
    I2C2_ER_IRQHandler
    I2C2_EV_IRQHandler
    I2C3_ER_IRQHandler
    I2C3_EV_IRQHandler
    LPTIM1_IRQHandler
    LPUART1_IRQHandler
    PVD_PVM_IRQHandler
    RCC_IRQHandler
    RNG_IRQHandler
    RTC_Alarm_IRQHandler
    RTC_TAMP_LSECSS_IRQHandler
    RTC_WKUP_IRQHandler
    SAI1_IRQHandler
    SPI1_IRQHandler
    SPI2_IRQHandler
    SPI3_IRQHandler
    TIM1_BRK_TIM15_IRQHandler
    TIM1_CC_IRQHandler
    TIM1_TRG_COM_TIM17_IRQHandler
    TIM1_UP_TIM16_IRQHandler
    TIM2_IRQHandler
    TIM3_IRQHandler
    TIM4_IRQHandler
    TIM6_DAC_IRQHandler
    TIM7_IRQHandler
    TIM8_BRK_IRQHandler
    TIM8_CC_IRQHandler
    TIM8_TRG_COM_IRQHandler
    TIM8_UP_IRQHandler
    UART4_IRQHandler
    UCPD1_IRQHandler
    USART1_IRQHandler
    USART2_IRQHandler
    USART3_IRQHandler
    USBWakeUp_IRQHandler
    USB_HP_IRQHandler
    WWDG_IRQHandler
        0x080002d2:    e7fe        ..      B        COMP1_2_3_IRQHandler ; 0x80002d2
    __user_initial_stackheap
        0x080002d4:    4804        .H      LDR      r0,[pc,#16] ; [0x80002e8] = 0x20001bd0
        0x080002d6:    4905        .I      LDR      r1,[pc,#20] ; [0x80002ec] = 0x200021d0
        0x080002d8:    4a05        .J      LDR      r2,[pc,#20] ; [0x80002f0] = 0x20001dd0
        0x080002da:    4b06        .K      LDR      r3,[pc,#24] ; [0x80002f4] = 0x20001dd0
        0x080002dc:    4770        pG      BX       lr
    $d
        0x080002de:    0000        ..      DCW    0
        0x080002e0:    08005231    1R..    DCD    134238769
        0x080002e4:    080001d9    ....    DCD    134218201
        0x080002e8:    20001bd0    ...     DCD    536878032
        0x080002ec:    200021d0    .!.     DCD    536879568
        0x080002f0:    20001dd0    ...     DCD    536878544
        0x080002f4:    20001dd0    ...     DCD    536878544
    $t
    .text
    __aeabi_uldivmod
    _ll_udiv
        0x080002f8:    ea530c02    S...    ORRS     r12,r3,r2
        0x080002fc:    f0008069    ..i.    BEQ.W    0x80003d2 ; __aeabi_uldivmod + 218
        0x08000300:    e92d4bf0    -..K    PUSH     {r4-r9,r11,lr}
        0x08000304:    f04f0600    O...    MOV      r6,#0
        0x08000308:    2b00        .+      CMP      r3,#0
        0x0800030a:    bf1f        ..      ITTTT    NE
        0x0800030c:    fab3f583    ....    CLZNE    r5,r3
        0x08000310:    fa03f405    ....    LSLNE    r4,r3,r5
        0x08000314:    fa24f605    $...    LSRNE    r6,r4,r5
        0x08000318:    405e        ^@      EORNE    r6,r6,r3
        0x0800031a:    bf12        ..      ITEE     NE
        0x0800031c:    4316        .C      ORRNE    r6,r6,r2
        0x0800031e:    fab2f582    ....    CLZEQ    r5,r2
        0x08000322:    fa02f405    ....    LSLEQ    r4,r2,r5
        0x08000326:    f1c50520    .. .    RSB      r5,r5,#0x20
        0x0800032a:    bf1e        ..      ITTT     NE
        0x0800032c:    fa22fc05    "...    LSRNE    r12,r2,r5
        0x08000330:    ea44040c    D...    ORRNE    r4,r4,r12
        0x08000334:    3520         5      ADDNE    r5,r5,#0x20
        0x08000336:    ea564c04    V..L    ORRS     r12,r6,r4,LSL #16
        0x0800033a:    ea4f4414    O..D    LSR      r4,r4,#16
        0x0800033e:    bf18        ..      IT       NE
        0x08000340:    1c64        d.      ADDNE    r4,r4,#1
        0x08000342:    f04f0800    O...    MOV      r8,#0
        0x08000346:    f04f0900    O...    MOV      r9,#0
        0x0800034a:    4290        .B      CMP      r0,r2
        0x0800034c:    eb710c03    q...    SBCS     r12,r1,r3
        0x08000350:    d339        9.      BCC      0x80003c6 ; __aeabi_uldivmod + 206
        0x08000352:    2900        .)      CMP      r1,#0
        0x08000354:    bf19        ..      ITTEE    NE
        0x08000356:    fab1f781    ....    CLZNE    r7,r1
        0x0800035a:    fa01f607    ....    LSLNE    r6,r1,r7
        0x0800035e:    fab0f780    ....    CLZEQ    r7,r0
        0x08000362:    fa00f607    ....    LSLEQ    r6,r0,r7
        0x08000366:    f1c70720    .. .    RSB      r7,r7,#0x20
        0x0800036a:    bf1e        ..      ITTT     NE
        0x0800036c:    fa20fc07     ...    LSRNE    r12,r0,r7
        0x08000370:    ea46060c    F...    ORRNE    r6,r6,r12
        0x08000374:    3720         7      ADDNE    r7,r7,#0x20
        0x08000376:    fbb6fcf4    ....    UDIV     r12,r6,r4
        0x0800037a:    eba70705    ....    SUB      r7,r7,r5
        0x0800037e:    3f10        .?      SUBS     r7,r7,#0x10
        0x08000380:    f0070b1f    ....    AND      r11,r7,#0x1f
        0x08000384:    f1cb0620    .. .    RSB      r6,r11,#0x20
        0x08000388:    fa0cfb0b    ....    LSL      r11,r12,r11
        0x0800038c:    fa2cf606    ,...    LSR      r6,r12,r6
        0x08000390:    bf44        D.      ITT      MI
        0x08000392:    46b3        .F      MOVMI    r11,r6
        0x08000394:    2600        .&      MOVMI    r6,#0
        0x08000396:    2f20         /      CMP      r7,#0x20
        0x08000398:    bfa4        ..      ITT      GE
        0x0800039a:    465e        ^F      MOVGE    r6,r11
        0x0800039c:    f04f0b00    O...    MOVGE    r11,#0
        0x080003a0:    ea5b0c06    [...    ORRS     r12,r11,r6
        0x080003a4:    bf08        ..      IT       EQ
        0x080003a6:    f04f0b01    O...    MOVEQ    r11,#1
        0x080003aa:    eb19090b    ....    ADDS     r9,r9,r11
        0x080003ae:    fbab7c02    ...|    UMULL    r7,r12,r11,r2
        0x080003b2:    eb480806    H...    ADC      r8,r8,r6
        0x080003b6:    1bc0        ..      SUBS     r0,r0,r7
        0x080003b8:    fb06cc02    ....    MLA      r12,r6,r2,r12
        0x080003bc:    fb0bcc03    ....    MLA      r12,r11,r3,r12
