ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080003c0:    eb71010c    q...    SBCS     r1,r1,r12
        0x080003c4:    e7c1        ..      B        0x800034a ; __aeabi_uldivmod + 82
        0x080003c6:    460b        .F      MOV      r3,r1
        0x080003c8:    4602        .F      MOV      r2,r0
        0x080003ca:    4641        AF      MOV      r1,r8
        0x080003cc:    4648        HF      MOV      r0,r9
        0x080003ce:    e8bd8bf0    ....    POP      {r4-r9,r11,pc}
        0x080003d2:    b513        ..      PUSH     {r0,r1,r4,lr}
        0x080003d4:    f04f0000    O...    MOV      r0,#0
        0x080003d8:    f04f0100    O...    MOV      r1,#0
        0x080003dc:    f3af8000    ....    NOP.W    
        0x080003e0:    e8bd401c    ...@    POP      {r2-r4,lr}
        0x080003e4:    4770        pG      BX       lr
    .text
    __aeabi_memclr4
    __aeabi_memclr8
    __rt_memclr_w
        0x080003e6:    f04f0200    O...    MOV      r2,#0
    _memset_w
        0x080003ea:    b500        ..      PUSH     {lr}
        0x080003ec:    4613        .F      MOV      r3,r2
        0x080003ee:    4694        .F      MOV      r12,r2
        0x080003f0:    4696        .F      MOV      lr,r2
        0x080003f2:    3920         9      SUBS     r1,r1,#0x20
        0x080003f4:    bf22        ".      ITTT     CS
        0x080003f6:    e8a0500c    ...P    STMCS    r0!,{r2,r3,r12,lr}
        0x080003fa:    e8a0500c    ...P    STMCS    r0!,{r2,r3,r12,lr}
        0x080003fe:    f1b10120    .. .    SUBSCS   r1,r1,#0x20
        0x08000402:    f4bfaff7    ....    BCS.W    0x80003f4 ; _memset_w + 10
        0x08000406:    0709        ..      LSLS     r1,r1,#28
        0x08000408:    bf28        (.      IT       CS
        0x0800040a:    e8a0500c    ...P    STMCS    r0!,{r2,r3,r12,lr}
        0x0800040e:    bf48        H.      IT       MI
        0x08000410:    c00c        ..      STMMI    r0!,{r2,r3}
        0x08000412:    f85deb04    ]...    POP      {lr}
        0x08000416:    0089        ..      LSLS     r1,r1,#2
        0x08000418:    bf28        (.      IT       CS
        0x0800041a:    f8402b04    @..+    STRCS    r2,[r0],#4
        0x0800041e:    bf08        ..      IT       EQ
        0x08000420:    4770        pG      BXEQ     lr
        0x08000422:    bf48        H.      IT       MI
        0x08000424:    f8202b02     ..+    STRHMI   r2,[r0],#2
        0x08000428:    f0114f80    ...O    TST      r1,#0x40000000
        0x0800042c:    bf18        ..      IT       NE
        0x0800042e:    f8002b01    ...+    STRBNE   r2,[r0],#1
        0x08000432:    4770        pG      BX       lr
    .text
    __use_two_region_memory
        0x08000434:    4770        pG      BX       lr
    __rt_heap_escrow$2region
        0x08000436:    4770        pG      BX       lr
    __rt_heap_expand$2region
        0x08000438:    4770        pG      BX       lr
    .text
    __user_setup_stackheap
        0x0800043a:    4675        uF      MOV      r5,lr
        0x0800043c:    f000f82c    ..,.    BL       __user_libspace ; 0x8000498
        0x08000440:    46ae        .F      MOV      lr,r5
        0x08000442:    0005        ..      MOVS     r5,r0
        0x08000444:    4669        iF      MOV      r1,sp
        0x08000446:    4653        SF      MOV      r3,r10
        0x08000448:    f0200007     ...    BIC      r0,r0,#7
        0x0800044c:    4685        .F      MOV      sp,r0
        0x0800044e:    b018        ..      ADD      sp,sp,#0x60
        0x08000450:    b520         .      PUSH     {r5,lr}
        0x08000452:    f7ffff3f    ..?.    BL       __user_initial_stackheap ; 0x80002d4
        0x08000456:    e8bd4020    .. @    POP      {r5,lr}
        0x0800045a:    f04f0600    O...    MOV      r6,#0
        0x0800045e:    f04f0700    O...    MOV      r7,#0
        0x08000462:    f04f0800    O...    MOV      r8,#0
        0x08000466:    f04f0b00    O...    MOV      r11,#0
        0x0800046a:    f0210107    !...    BIC      r1,r1,#7
        0x0800046e:    46ac        .F      MOV      r12,r5
        0x08000470:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x08000474:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x08000478:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x0800047c:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x08000480:    468d        .F      MOV      sp,r1
        0x08000482:    4770        pG      BX       lr
    .text
    exit
        0x08000484:    b510        ..      PUSH     {r4,lr}
        0x08000486:    4604        .F      MOV      r4,r0
        0x08000488:    f3af8000    ....    NOP.W    
        0x0800048c:    4620         F      MOV      r0,r4
        0x0800048e:    e8bd4010    ...@    POP      {r4,lr}
        0x08000492:    f7ffbf0a    ....    B.W      __rt_exit ; 0x80002aa
        0x08000496:    0000        ..      MOVS     r0,r0
    .text
    __user_libspace
    __user_perproc_libspace
    __user_perthread_libspace
        0x08000498:    4800        .H      LDR      r0,[pc,#0] ; [0x800049c] = 0x20001b6c
        0x0800049a:    4770        pG      BX       lr
    $d
        0x0800049c:    20001b6c    l..     DCD    536877932
    $t
    .text
    _sys_exit
        0x080004a0:    4901        .I      LDR      r1,[pc,#4] ; [0x80004a8] = 0x20026
        0x080004a2:    2018        .       MOVS     r0,#0x18
        0x080004a4:    beab        ..      BKPT     #0xab
        0x080004a6:    e7fe        ..      B        0x80004a6 ; _sys_exit + 6
    $d
        0x080004a8:    00020026    &...    DCD    131110
    $t
    .text
    __I$use$semihosting
    __use_no_semihosting_swi
        0x080004ac:    4770        pG      BX       lr
    i.ADC1_2_IRQHandler
    .text
    ADC1_2_IRQHandler
    __semihosting_library_function
        0x080004ae:    f04f40a0    O..@    MOV      r0,#0x50000000
        0x080004b2:    6801        .h      LDR      r1,[r0,#0]
        0x080004b4:    f0110f40    ..@.    TST      r1,#0x40
        0x080004b8:    bf1a        ..      ITTE     NE
        0x080004ba:    f8d01100    ....    LDRNE    r1,[r0,#0x100]
        0x080004be:    f0110f40    ..@.    TSTNE    r1,#0x40
        0x080004c2:    4770        pG      BXEQ     lr
        0x080004c4:    2140        @!      MOVS     r1,#0x40
        0x080004c6:    6001        .`      STR      r1,[r0,#0]
        0x080004c8:    f8c01100    ....    STR      r1,[r0,#0x100]
        0x080004cc:    f004bade    ....    B.W      PerformanceCriticalTask ; 0x8004a8c
    i.Abc_AlphaBeta_Trans
    Abc_AlphaBeta_Trans
        0x080004d0:    ed900a00    ....    VLDR     s0,[r0,#0]
        0x080004d4:    ed901a01    ....    VLDR     s2,[r0,#4]
        0x080004d8:    eef01a00    ....    VMOV.F32 s3,#2.00000000
        0x080004dc:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x080004e0:    ee410a21    A.!.    VMLA.F32 s1,s2,s3
        0x080004e4:    ed9f1a02    ....    VLDR     s2,[pc,#8] ; [0x80004f0] = 0x3f13cd3a
        0x080004e8:    ee600a81    `...    VMUL.F32 s1,s1,s2
        0x080004ec:    4770        pG      BX       lr
    $d
        0x080004ee:    0000        ..      DCW    0
        0x080004f0:    3f13cd3a    :..?    DCD    1058262330
    $t
    i.AbsEncoderCalculateRealEleAngle
    AbsEncoderCalculateRealEleAngle
        0x080004f4:    b510        ..      PUSH     {r4,lr}
        0x080004f6:    4604        .F      MOV      r4,r0
        0x080004f8:    f001fef6    ....    BL       Hardware_GetAbsCounter ; 0x80022e8
        0x080004fc:    ee000a10    ....    VMOV     s0,r0
        0x08000500:    eddf0a12    ....    VLDR     s1,[pc,#72] ; [0x800054c] = 0x434d0000
        0x08000504:    4913        .I      LDR      r1,[pc,#76] ; [0x8000554] = 0x40490fdb
        0x08000506:    eeb80a40    ..@.    VCVT.F32.U32 s0,s0
        0x0800050a:    ee300a60    0.`.    VSUB.F32 s0,s0,s1
        0x0800050e:    ee801a20    .. .    VDIV.F32 s2,s0,s1
        0x08000512:    ed9f0a0f    ....    VLDR     s0,[pc,#60] ; [0x8000550] = 0x40490fdb
        0x08000516:    edd40a01    ....    VLDR     s1,[r4,#4]
        0x0800051a:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x0800051e:    ee300a80    0...    VADD.F32 s0,s1,s0
        0x08000522:    ee100a10    ....    VMOV     r0,s0
        0x08000526:    4288        .B      CMP      r0,r1
        0x08000528:    bfc8        ..      IT       GT
        0x0800052a:    eddf0a0b    ....    VLDRGT   s1,[pc,#44] ; [0x8000558] = 0xc0c90fdb
        0x0800052e:    dc07        ..      BGT      0x8000540 ; AbsEncoderCalculateRealEleAngle + 76
        0x08000530:    ee100a10    ....    VMOV     r0,s0
        0x08000534:    4909        .I      LDR      r1,[pc,#36] ; [0x800055c] = 0xc0490fdb
        0x08000536:    4288        .B      CMP      r0,r1
        0x08000538:    bf88        ..      IT       HI
        0x0800053a:    eddf0a09    ....    VLDRHI   s1,[pc,#36] ; [0x8000560] = 0x40c90fdb
        0x0800053e:    d901        ..      BLS      0x8000544 ; AbsEncoderCalculateRealEleAngle + 80
        0x08000540:    ee300a20    0. .    VADD.F32 s0,s0,s1
        0x08000544:    eeb10a40    ..@.    VNEG.F32 s0,s0
        0x08000548:    bd10        ..      POP      {r4,pc}
    $d
        0x0800054a:    0000        ..      DCW    0
        0x0800054c:    434d0000    ..MC    DCD    1129119744
        0x08000550:    40490fdb    ..I@    DCD    1078530011
        0x08000554:    40490fdb    ..I@    DCD    1078530011
        0x08000558:    c0c90fdb    ....    DCD    3234402267
        0x0800055c:    c0490fdb    ..I.    DCD    3226013659
        0x08000560:    40c90fdb    ...@    DCD    1086918619
    $t
    i.AlphaBeta_Dq_Trans
    AlphaBeta_Dq_Trans
        0x08000564:    edd10a01    ....    VLDR     s1,[r1,#4]
        0x08000568:    ed901a00    ....    VLDR     s2,[r0,#0]
        0x0800056c:    ed902a01    ...*    VLDR     s4,[r0,#4]
        0x08000570:    edd11a00    ....    VLDR     s3,[r1,#0]
        0x08000574:    ee200a81     ...    VMUL.F32 s0,s1,s2
        0x08000578:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x0800057c:    ee010a82    ....    VMLA.F32 s0,s3,s4
        0x08000580:    ee410ac1    A...    VMLS.F32 s1,s3,s2
        0x08000584:    4770        pG      BX       lr
    i.BPF_2stOrder_1in_1out_Calculate
    BPF_2stOrder_1in_1out_Calculate
        0x08000586:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x0800058a:    ed900a00    ....    VLDR     s0,[r0,#0]
        0x0800058e:    ed901a04    ....    VLDR     s2,[r0,#0x10]
        0x08000592:    edd01a01    ....    VLDR     s3,[r0,#4]
        0x08000596:    ed902a05    ...*    VLDR     s4,[r0,#0x14]
        0x0800059a:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x0800059e:    ee010a82    ....    VMLA.F32 s0,s3,s4
        0x080005a2:    edd01a02    ....    VLDR     s3,[r0,#8]
        0x080005a6:    ed902a06    ...*    VLDR     s4,[r0,#0x18]
        0x080005aa:    ee010aa0    ....    VMLA.F32 s0,s3,s1
        0x080005ae:    edd01a03    ....    VLDR     s3,[r0,#0xc]
        0x080005b2:    ed801a05    ....    VSTR     s2,[r0,#0x14]
        0x080005b6:    ee010a82    ....    VMLA.F32 s0,s3,s4
        0x080005ba:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x080005be:    edc00a06    ....    VSTR     s1,[r0,#0x18]
        0x080005c2:    4770        pG      BX       lr
    i.BPF_2stOrder_1in_1out_SetPar
    BPF_2stOrder_1in_1out_SetPar
        0x080005c4:    ec800a04    ....    VSTM     r0,{s0-s3}
        0x080005c8:    ed9f0a04    ....    VLDR     s0,[pc,#16] ; [0x80005dc] = 0
        0x080005cc:    ed800a06    ....    VSTR     s0,[r0,#0x18]
        0x080005d0:    ed800a05    ....    VSTR     s0,[r0,#0x14]
        0x080005d4:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x080005d8:    4770        pG      BX       lr
    $d
        0x080005da:    0000        ..      DCW    0
        0x080005dc:    00000000    ....    DCD    0
    $t
    i.BusFault_Handler
    BusFault_Handler
        0x080005e0:    e7fe        ..      B        BusFault_Handler ; 0x80005e0
    i.CDC_Control_FS
    CDC_Control_FS
        0x080005e2:    2000        .       MOVS     r0,#0
        0x080005e4:    4770        pG      BX       lr
    i.CDC_DeInit_FS
    CDC_DeInit_FS
        0x080005e6:    2000        .       MOVS     r0,#0
        0x080005e8:    4770        pG      BX       lr
        0x080005ea:    0000        ..      MOVS     r0,r0
    i.CDC_Init_FS
    CDC_Init_FS
        0x080005ec:    b510        ..      PUSH     {r4,lr}
        0x080005ee:    2200        ."      MOVS     r2,#0
        0x080005f0:    4904        .I      LDR      r1,[pc,#16] ; [0x8000604] = 0x20001784
        0x080005f2:    4805        .H      LDR      r0,[pc,#20] ; [0x8000608] = 0x200012a8
        0x080005f4:    f004ffe5    ....    BL       USBD_CDC_SetTxBuffer ; 0x80055c2
        0x080005f8:    4904        .I      LDR      r1,[pc,#16] ; [0x800060c] = 0x20001778
        0x080005fa:    4803        .H      LDR      r0,[pc,#12] ; [0x8000608] = 0x200012a8
        0x080005fc:    f004ffd8    ....    BL       USBD_CDC_SetRxBuffer ; 0x80055b0
        0x08000600:    2000        .       MOVS     r0,#0
        0x08000602:    bd10        ..      POP      {r4,pc}
    $d
        0x08000604:    20001784    ...     DCD    536876932
        0x08000608:    200012a8    ...     DCD    536875688
        0x0800060c:    20001778    x..     DCD    536876920
    $t
    i.CDC_Receive_FS
    CDC_Receive_FS
        0x08000610:    b510        ..      PUSH     {r4,lr}
        0x08000612:    4601        .F      MOV      r1,r0
        0x08000614:    4803        .H      LDR      r0,[pc,#12] ; [0x8000624] = 0x200012a8
        0x08000616:    f004ffcb    ....    BL       USBD_CDC_SetRxBuffer ; 0x80055b0
        0x0800061a:    4802        .H      LDR      r0,[pc,#8] ; [0x8000624] = 0x200012a8
        0x0800061c:    f004ff66    ..f.    BL       USBD_CDC_ReceivePacket ; 0x80054ec
        0x08000620:    2000        .       MOVS     r0,#0
        0x08000622:    bd10        ..      POP      {r4,pc}
    $d
        0x08000624:    200012a8    ...     DCD    536875688
    $t
    i.CDC_TransmitCplt_FS
    CDC_TransmitCplt_FS
        0x08000628:    2000        .       MOVS     r0,#0
        0x0800062a:    4770        pG      BX       lr
    i.CDC_Transmit_FS
    CDC_Transmit_FS
        0x0800062c:    460a        .F      MOV      r2,r1
        0x0800062e:    4909        .I      LDR      r1,[pc,#36] ; [0x8000654] = 0x200012a8
        0x08000630:    b510        ..      PUSH     {r4,lr}
        0x08000632:    f8d112bc    ....    LDR      r1,[r1,#0x2bc]
        0x08000636:    f8d11214    ....    LDR      r1,[r1,#0x214]
        0x0800063a:    2900        .)      CMP      r1,#0
        0x0800063c:    bf1c        ..      ITT      NE
        0x0800063e:    2001        .       MOVNE    r0,#1
        0x08000640:    bd10        ..      POPNE    {r4,pc}
        0x08000642:    4601        .F      MOV      r1,r0
        0x08000644:    4803        .H      LDR      r0,[pc,#12] ; [0x8000654] = 0x200012a8
        0x08000646:    f004ffbc    ....    BL       USBD_CDC_SetTxBuffer ; 0x80055c2
        0x0800064a:    e8bd4010    ...@    POP      {r4,lr}
        0x0800064e:    4801        .H      LDR      r0,[pc,#4] ; [0x8000654] = 0x200012a8
        0x08000650:    f005b82a    ..*.    B.W      USBD_CDC_TransmitPacket ; 0x80056a8
    $d
        0x08000654:    200012a8    ...     DCD    536875688
    $t
    i.CalculateSinCosValue
    CalculateSinCosValue
        0x08000658:    f001beda    ....    B.W      Hardware_GetSinCosVal ; 0x8002410
    i.DMA1_Channel1_IRQHandler
    DMA1_Channel1_IRQHandler
        0x0800065c:    4770        pG      BX       lr
    i.DMA1_Channel2_IRQHandler
    DMA1_Channel2_IRQHandler
        0x0800065e:    4770        pG      BX       lr
    i.DMA2_Channel1_IRQHandler
    DMA2_Channel1_IRQHandler
        0x08000660:    4770        pG      BX       lr
    i.DMA2_Channel2_IRQHandler
    DMA2_Channel2_IRQHandler
        0x08000662:    4770        pG      BX       lr
    i.DebugMon_Handler
    DebugMon_Handler
        0x08000664:    4770        pG      BX       lr
    i.Dq_AlphaBeta_Trans
    Dq_AlphaBeta_Trans
        0x08000666:    edd11a01    ....    VLDR     s3,[r1,#4]
        0x0800066a:    edd00a00    ....    VLDR     s1,[r0,#0]
        0x0800066e:    ed912a00    ...*    VLDR     s4,[r1,#0]
        0x08000672:    ed901a01    ....    VLDR     s2,[r0,#4]
        0x08000676:    ee210aa0    !...    VMUL.F32 s0,s3,s1
        0x0800067a:    ee620a20    b. .    VMUL.F32 s1,s4,s1
        0x0800067e:    ee020a41    ..A.    VMLS.F32 s0,s4,s2
        0x08000682:    ee410a81    A...    VMLA.F32 s1,s3,s2
        0x08000686:    4770        pG      BX       lr
    i.EXTI2_IRQHandler
    EXTI2_IRQHandler
        0x08000688:    480e        .H      LDR      r0,[pc,#56] ; [0x80006c4] = 0x40010414
        0x0800068a:    6801        .h      LDR      r1,[r0,#0]
        0x0800068c:    f0110f04    ....    TST      r1,#4
        0x08000690:    bf08        ..      IT       EQ
        0x08000692:    4770        pG      BXEQ     lr
        0x08000694:    b510        ..      PUSH     {r4,lr}
        0x08000696:    2104        .!      MOVS     r1,#4
        0x08000698:    6001        .`      STR      r1,[r0,#0]
        0x0800069a:    4c0b        .L      LDR      r4,[pc,#44] ; [0x80006c8] = 0x20000094
        0x0800069c:    6820         h      LDR      r0,[r4,#0]
        0x0800069e:    7801        .x      LDRB     r1,[r0,#0]
        0x080006a0:    2900        .)      CMP      r1,#0
        0x080006a2:    bf08        ..      IT       EQ
        0x080006a4:    bd10        ..      POPEQ    {r4,pc}
        0x080006a6:    7841        Ax      LDRB     r1,[r0,#1]
        0x080006a8:    b121        !.      CBZ      r1,0x80006b4 ; EXTI2_IRQHandler + 44
        0x080006aa:    6940        @i      LDR      r0,[r0,#0x14]
        0x080006ac:    e8bd4010    ...@    POP      {r4,lr}
        0x080006b0:    f001bfce    ....    B.W      Hardware_SetABZCounter ; 0x8002650
        0x080006b4:    2101        .!      MOVS     r1,#1
        0x080006b6:    7041        Ap      STRB     r1,[r0,#1]
        0x080006b8:    f001fe10    ....    BL       Hardware_GetABZCounter ; 0x80022dc
        0x080006bc:    6821        !h      LDR      r1,[r4,#0]
        0x080006be:    6148        Ha      STR      r0,[r1,#0x14]
        0x080006c0:    bd10        ..      POP      {r4,pc}
    $d
        0x080006c2:    0000        ..      DCW    0
        0x080006c4:    40010414    ...@    DCD    1073808404
        0x080006c8:    20000094    ...     DCD    536871060
    $t
    i.Error_Handler
    Error_Handler
        0x080006cc:    b672        r.      CPSID    i
        0x080006ce:    e7fe        ..      B        0x80006ce ; Error_Handler + 2
    i.FOC_Method_HFPI_WithoutNS
    FOC_Method_HFPI_WithoutNS
        0x080006d0:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x080006d4:    4d77        wM      LDR      r5,[pc,#476] ; [0x80008b4] = 0x20000060
        0x080006d6:    f8df81e0    ....    LDR      r8,[pc,#480] ; [0x80008b8] = 0x200000a4
        0x080006da:    4c78        xL      LDR      r4,[pc,#480] ; [0x80008bc] = 0x20000098
        0x080006dc:    4e78        xN      LDR      r6,[pc,#480] ; [0x80008c0] = 0x2000008c
        0x080006de:    f8dfb1e4    ....    LDR      r11,[pc,#484] ; [0x80008c4] = 0x200000ac
        0x080006e2:    4f79        yO      LDR      r7,[pc,#484] ; [0x80008c8] = 0x200000a8
        0x080006e4:    f04f0a00    O...    MOV      r10,#0
        0x080006e8:    ed2d8b02    -...    VPUSH    {d8}
        0x080006ec:    b083        ..      SUB      sp,sp,#0xc
        0x080006ee:    6828        (h      LDR      r0,[r5,#0]
        0x080006f0:    7c41        A|      LDRB     r1,[r0,#0x11]
        0x080006f2:    2900        .)      CMP      r1,#0
        0x080006f4:    d057        W.      BEQ      0x80007a6 ; FOC_Method_HFPI_WithoutNS + 214
        0x080006f6:    2901        .)      CMP      r1,#1
        0x080006f8:    d07d        }.      BEQ      0x80007f6 ; FOC_Method_HFPI_WithoutNS + 294
        0x080006fa:    2902        .)      CMP      r1,#2
        0x080006fc:    bf1e        ..      ITTT     NE
        0x080006fe:    b003        ..      ADDNE    sp,sp,#0xc
        0x08000700:    ecbd8b02    ....    VPOPNE   {d8}
        0x08000704:    e8bd8ff0    ....    POPNE    {r4-r11,pc}
        0x08000708:    f8df91c0    ....    LDR      r9,[pc,#448] ; [0x80008cc] = 0x20000064
        0x0800070c:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000710:    f7fffef0    ....    BL       AbsEncoderCalculateRealEleAngle ; 0x80004f4
        0x08000714:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000718:    f8df91b4    ....    LDR      r9,[pc,#436] ; [0x80008d0] = 0x2000009c
        0x0800071c:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000720:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000724:    ed900a0c    ....    VLDR     s0,[r0,#0x30]
        0x08000728:    f001fe72    ..r.    BL       Hardware_GetSinCosVal ; 0x8002410
        0x0800072c:    6820         h      LDR      r0,[r4,#0]
        0x0800072e:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000732:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000736:    f8d91000    ....    LDR      r1,[r9,#0]
        0x0800073a:    f001fbdb    ....    BL       HFPISensorlessObserver ; 0x8001ef4
        0x0800073e:    6820         h      LDR      r0,[r4,#0]
        0x08000740:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000744:    ed900a11    ....    VLDR     s0,[r0,#0x44]
        0x08000748:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x0800074c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000750:    f002f816    ....    BL       IdCurrentPIController ; 0x8002780
        0x08000754:    6820         h      LDR      r0,[r4,#0]
        0x08000756:    eeb01a40    ..@.    VMOV.F32 s2,s0
        0x0800075a:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x0800075e:    eeb02a41    ..A*    VMOV.F32 s4,s2
        0x08000762:    6838        8h      LDR      r0,[r7,#0]
        0x08000764:    f002f914    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000768:    ee720a21    r.!.    VADD.F32 s1,s4,s3
        0x0800076c:    6830        0h      LDR      r0,[r6,#0]
        0x0800076e:    edc00a02    ....    VSTR     s1,[r0,#8]
        0x08000772:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000776:    6828        (h      LDR      r0,[r5,#0]
        0x08000778:    6841        Ah      LDR      r1,[r0,#4]
        0x0800077a:    1c49        I.      ADDS     r1,r1,#1
        0x0800077c:    6041        A`      STR      r1,[r0,#4]
        0x0800077e:    290a        .)      CMP      r1,#0xa
        0x08000780:    d10c        ..      BNE      0x800079c ; FOC_Method_HFPI_WithoutNS + 204
        0x08000782:    f8c0a004    ....    STR      r10,[r0,#4]
        0x08000786:    f8d90000    ....    LDR      r0,[r9,#0]
        0x0800078a:    ed900a0d    ....    VLDR     s0,[r0,#0x34]
        0x0800078e:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08000792:    f004fc73    ..s.    BL       SpeedPIController ; 0x800507c
        0x08000796:    6838        8h      LDR      r0,[r7,#0]
        0x08000798:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x0800079c:    b003        ..      ADD      sp,sp,#0xc
        0x0800079e:    ecbd8b02    ....    VPOP     {d8}
        0x080007a2:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x080007a6:    6841        Ah      LDR      r1,[r0,#4]
        0x080007a8:    1c4a        J.      ADDS     r2,r1,#1
        0x080007aa:    ed9f8a4a    ..J.    VLDR     s16,[pc,#296] ; [0x80008d4] = 0
        0x080007ae:    6042        B`      STR      r2,[r0,#4]
        0x080007b0:    f5b16ffa    ...o    CMP      r1,#0x7d0
        0x080007b4:    d23b        ;.      BCS      0x800082e ; FOC_Method_HFPI_WithoutNS + 350
        0x080007b6:    4848        HH      LDR      r0,[pc,#288] ; [0x80008d8] = 0x200000b8
        0x080007b8:    6800        .h      LDR      r0,[r0,#0]
