ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080007ba:    ed900a03    ....    VLDR     s0,[r0,#0xc]
        0x080007be:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080007c2:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080007c6:    6838        8h      LDR      r0,[r7,#0]
        0x080007c8:    eeb00a48    ..H.    VMOV.F32 s0,s16
        0x080007cc:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080007d0:    f001fe1e    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x080007d4:    6820         h      LDR      r0,[r4,#0]
        0x080007d6:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x080007da:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x080007de:    303c        <0      ADDS     r0,r0,#0x3c
        0x080007e0:    f7fffe76    ..v.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x080007e4:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x080007e8:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x080007ec:    6820         h      LDR      r0,[r4,#0]
        0x080007ee:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x080007f2:    4668        hF      MOV      r0,sp
        0x080007f4:    e000        ..      B        0x80007f8 ; FOC_Method_HFPI_WithoutNS + 296
        0x080007f6:    e051        Q.      B        0x800089c ; FOC_Method_HFPI_WithoutNS + 460
        0x080007f8:    f7fffeb4    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x080007fc:    6820         h      LDR      r0,[r4,#0]
        0x080007fe:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000802:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000806:    f8d80000    ....    LDR      r0,[r8,#0]
        0x0800080a:    f001ffb9    ....    BL       IdCurrentPIController ; 0x8002780
        0x0800080e:    6820         h      LDR      r0,[r4,#0]
        0x08000810:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000814:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000818:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x0800081c:    6838        8h      LDR      r0,[r7,#0]
        0x0800081e:    f002f8b7    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000822:    6830        0h      LDR      r0,[r6,#0]
        0x08000824:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000828:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x0800082c:    e7b6        ..      B        0x800079c ; FOC_Method_HFPI_WithoutNS + 204
        0x0800082e:    eddf1a2b    ..+.    VLDR     s3,[pc,#172] ; [0x80008dc] = 0x3be5b424
        0x08000832:    ed9f1a2b    ..+.    VLDR     s2,[pc,#172] ; [0x80008e0] = 0x3bf3ba77
        0x08000836:    eddf0a2b    ..+.    VLDR     s1,[pc,#172] ; [0x80008e4] = 0xbf5652bd
        0x0800083a:    ed9f0a2b    ..+.    VLDR     s0,[pc,#172] ; [0x80008e8] = 0x3fe95810
        0x0800083e:    f001fc41    ..A.    BL       HFPI_LPF_2stOrder_1in_1out_SetPar ; 0x80020c4
        0x08000842:    eddf1a2a    ..*.    VLDR     s3,[pc,#168] ; [0x80008ec] = 0xbcfaacda
        0x08000846:    ed9f1a2a    ..*.    VLDR     s2,[pc,#168] ; [0x80008f0] = 0x3cfaacda
        0x0800084a:    eddf0a2a    ..*.    VLDR     s1,[pc,#168] ; [0x80008f4] = 0xbf7816f0
        0x0800084e:    ed9f0a2a    ..*.    VLDR     s0,[pc,#168] ; [0x80008f8] = 0x3ff41893
        0x08000852:    f001fc0f    ....    BL       HFPI_BPF0_2stOrder_1in_1out_SetPar ; 0x8002074
        0x08000856:    eddf1a29    ..).    VLDR     s3,[pc,#164] ; [0x80008fc] = 0xbe5a1cac
        0x0800085a:    ed9f1a29    ..).    VLDR     s2,[pc,#164] ; [0x8000900] = 0x3e5a1cac
        0x0800085e:    eddf0a29    ..).    VLDR     s1,[pc,#164] ; [0x8000904] = 0xbf471de7
        0x08000862:    ed9f0a29    ..).    VLDR     s0,[pc,#164] ; [0x8000908] = 0x3fc78d50
        0x08000866:    f001fc27    ..'.    BL       HFPI_BPF1_2stOrder_1in_1out_SetPar ; 0x80020b8
        0x0800086a:    f8d80000    ....    LDR      r0,[r8,#0]
        0x0800086e:    eeb00a00    ....    VMOV.F32 s0,#2.00000000
        0x08000872:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000876:    6830        0h      LDR      r0,[r6,#0]
        0x08000878:    ed9f0a24    ..$.    VLDR     s0,[pc,#144] ; [0x800090c] = 0x41fb53d2
        0x0800087c:    ed808a03    ....    VSTR     s16,[r0,#0xc]
        0x08000880:    ed808a02    ....    VSTR     s16,[r0,#8]
        0x08000884:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08000888:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x0800088c:    f008f848    ..H.    BL       reset_CurrentPICHandler ; 0x8008920
        0x08000890:    6828        (h      LDR      r0,[r5,#0]
        0x08000892:    2101        .!      MOVS     r1,#1
        0x08000894:    f8c0a004    ....    STR      r10,[r0,#4]
        0x08000898:    7441        At      STRB     r1,[r0,#0x11]
        0x0800089a:    e77f        ..      B        0x800079c ; FOC_Method_HFPI_WithoutNS + 204
        0x0800089c:    6841        Ah      LDR      r1,[r0,#4]
        0x0800089e:    1c4a        J.      ADDS     r2,r1,#1
        0x080008a0:    6042        B`      STR      r2,[r0,#4]
        0x080008a2:    f5b17f7a    ..z.    CMP      r1,#0x3e8
        0x080008a6:    bf84        ..      ITT      HI
        0x080008a8:    f8c0a004    ....    STRHI    r10,[r0,#4]
        0x080008ac:    2102        .!      MOVHI    r1,#2
        0x080008ae:    d8f3        ..      BHI      0x8000898 ; FOC_Method_HFPI_WithoutNS + 456
        0x080008b0:    e774        t.      B        0x800079c ; FOC_Method_HFPI_WithoutNS + 204
    $d
        0x080008b2:    0000        ..      DCW    0
        0x080008b4:    20000060    `..     DCD    536871008
        0x080008b8:    200000a4    ...     DCD    536871076
        0x080008bc:    20000098    ...     DCD    536871064
        0x080008c0:    2000008c    ...     DCD    536871052
        0x080008c4:    200000ac    ...     DCD    536871084
        0x080008c8:    200000a8    ...     DCD    536871080
        0x080008cc:    20000064    d..     DCD    536871012
        0x080008d0:    2000009c    ...     DCD    536871068
        0x080008d4:    00000000    ....    DCD    0
        0x080008d8:    200000b8    ...     DCD    536871096
        0x080008dc:    3be5b424    $..;    DCD    1004909604
        0x080008e0:    3bf3ba77    w..;    DCD    1005828727
        0x080008e4:    bf5652bd    .RV.    DCD    3210105533
        0x080008e8:    3fe95810    .X.?    DCD    1072257040
        0x080008ec:    bcfaacda    ....    DCD    3170544858
        0x080008f0:    3cfaacda    ...<    DCD    1023061210
        0x080008f4:    bf7816f0    ..x.    DCD    3212318448
        0x080008f8:    3ff41893    ...?    DCD    1072961683
        0x080008fc:    be5a1cac    ..Z.    DCD    3193576620
        0x08000900:    3e5a1cac    ..Z>    DCD    1046092972
        0x08000904:    bf471de7    ..G.    DCD    3209108967
        0x08000908:    3fc78d50    P..?    DCD    1070042448
        0x0800090c:    41fb53d2    .S.A    DCD    1106990034
    $t
    i.FOC_Method_HFSI_WithoutNS
    FOC_Method_HFSI_WithoutNS
        0x08000910:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08000914:    4c65        eL      LDR      r4,[pc,#404] ; [0x8000aac] = 0x20000060
        0x08000916:    f8df9198    ....    LDR      r9,[pc,#408] ; [0x8000ab0] = 0x200000a4
        0x0800091a:    f04f0a00    O...    MOV      r10,#0
        0x0800091e:    ed2d8b02    -...    VPUSH    {d8}
        0x08000922:    b083        ..      SUB      sp,sp,#0xc
        0x08000924:    6820         h      LDR      r0,[r4,#0]
        0x08000926:    7c41        A|      LDRB     r1,[r0,#0x11]
        0x08000928:    ed9f8a62    ..b.    VLDR     s16,[pc,#392] ; [0x8000ab4] = 0
        0x0800092c:    4f62        bO      LDR      r7,[pc,#392] ; [0x8000ab8] = 0x20000098
        0x0800092e:    4d63        cM      LDR      r5,[pc,#396] ; [0x8000abc] = 0x2000008c
        0x08000930:    4e63        cN      LDR      r6,[pc,#396] ; [0x8000ac0] = 0x200000a8
        0x08000932:    b189        ..      CBZ      r1,0x8000958 ; FOC_Method_HFSI_WithoutNS + 72
        0x08000934:    2901        .)      CMP      r1,#1
        0x08000936:    d06a        j.      BEQ      0x8000a0e ; FOC_Method_HFSI_WithoutNS + 254
        0x08000938:    2902        .)      CMP      r1,#2
        0x0800093a:    bf1e        ..      ITTT     NE
        0x0800093c:    b003        ..      ADDNE    sp,sp,#0xc
        0x0800093e:    ecbd8b02    ....    VPOPNE   {d8}
        0x08000942:    e8bd8ff0    ....    POPNE    {r4-r11,pc}
        0x08000946:    f8df817c    ..|.    LDR      r8,[pc,#380] ; [0x8000ac4] = 0x20000050
        0x0800094a:    f8dfb17c    ..|.    LDR      r11,[pc,#380] ; [0x8000ac8] = 0x200000a0
        0x0800094e:    f8b80000    ....    LDRH     r0,[r8,#0]
        0x08000952:    2800        .(      CMP      r0,#0
        0x08000954:    d17e        ~.      BNE      0x8000a54 ; FOC_Method_HFSI_WithoutNS + 324
        0x08000956:    e065        e.      B        0x8000a24 ; FOC_Method_HFSI_WithoutNS + 276
        0x08000958:    6841        Ah      LDR      r1,[r0,#4]
        0x0800095a:    1c4a        J.      ADDS     r2,r1,#1
        0x0800095c:    6042        B`      STR      r2,[r0,#4]
        0x0800095e:    4854        TH      LDR      r0,[pc,#336] ; [0x8000ab0] = 0x200000a4
        0x08000960:    f5b16ffa    ...o    CMP      r1,#0x7d0
        0x08000964:    6800        .h      LDR      r0,[r0,#0]
        0x08000966:    d23b        ;.      BCS      0x80009e0 ; FOC_Method_HFSI_WithoutNS + 208
        0x08000968:    4958        XI      LDR      r1,[pc,#352] ; [0x8000acc] = 0x200000b8
        0x0800096a:    6809        .h      LDR      r1,[r1,#0]
        0x0800096c:    ed910a03    ....    VLDR     s0,[r1,#0xc]
        0x08000970:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000974:    6830        0h      LDR      r0,[r6,#0]
        0x08000976:    eeb00a48    ..H.    VMOV.F32 s0,s16
        0x0800097a:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x0800097e:    f001fd47    ..G.    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000982:    6838        8h      LDR      r0,[r7,#0]
        0x08000984:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000988:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x0800098c:    303c        <0      ADDS     r0,r0,#0x3c
        0x0800098e:    f7fffd9f    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000992:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000996:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x0800099a:    6838        8h      LDR      r0,[r7,#0]
        0x0800099c:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x080009a0:    4668        hF      MOV      r0,sp
        0x080009a2:    f7fffddf    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x080009a6:    6838        8h      LDR      r0,[r7,#0]
        0x080009a8:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x080009ac:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x080009b0:    f8d90000    ....    LDR      r0,[r9,#0]
        0x080009b4:    f001fee4    ....    BL       IdCurrentPIController ; 0x8002780
        0x080009b8:    6838        8h      LDR      r0,[r7,#0]
        0x080009ba:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x080009be:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x080009c2:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x080009c6:    6830        0h      LDR      r0,[r6,#0]
        0x080009c8:    f001ffe2    ....    BL       IqCurrentPIController ; 0x8002990
        0x080009cc:    6828        (h      LDR      r0,[r5,#0]
        0x080009ce:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080009d2:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080009d6:    b003        ..      ADD      sp,sp,#0xc
        0x080009d8:    ecbd8b02    ....    VPOP     {d8}
        0x080009dc:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x080009e0:    eeb00a00    ....    VMOV.F32 s0,#2.00000000
        0x080009e4:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080009e8:    6828        (h      LDR      r0,[r5,#0]
        0x080009ea:    ed9f0a39    ..9.    VLDR     s0,[pc,#228] ; [0x8000ad0] = 0x41fb53d2
        0x080009ee:    ed808a03    ....    VSTR     s16,[r0,#0xc]
        0x080009f2:    ed808a02    ....    VSTR     s16,[r0,#8]
        0x080009f6:    4837        7H      LDR      r0,[pc,#220] ; [0x8000ad4] = 0x200000ac
        0x080009f8:    6800        .h      LDR      r0,[r0,#0]
        0x080009fa:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080009fe:    f007ff8f    ....    BL       reset_CurrentPICHandler ; 0x8008920
        0x08000a02:    6820         h      LDR      r0,[r4,#0]
        0x08000a04:    2101        .!      MOVS     r1,#1
        0x08000a06:    f8c0a004    ....    STR      r10,[r0,#4]
        0x08000a0a:    7441        At      STRB     r1,[r0,#0x11]
        0x08000a0c:    e7e3        ..      B        0x80009d6 ; FOC_Method_HFSI_WithoutNS + 198
        0x08000a0e:    6841        Ah      LDR      r1,[r0,#4]
        0x08000a10:    1c4a        J.      ADDS     r2,r1,#1
        0x08000a12:    6042        B`      STR      r2,[r0,#4]
        0x08000a14:    f5b17f7a    ..z.    CMP      r1,#0x3e8
        0x08000a18:    bf84        ..      ITT      HI
        0x08000a1a:    f8c0a004    ....    STRHI    r10,[r0,#4]
        0x08000a1e:    2102        .!      MOVHI    r1,#2
        0x08000a20:    d9d9        ..      BLS      0x80009d6 ; FOC_Method_HFSI_WithoutNS + 198
        0x08000a22:    e7f2        ..      B        0x8000a0a ; FOC_Method_HFSI_WithoutNS + 250
        0x08000a24:    eeb00a48    ..H.    VMOV.F32 s0,s16
        0x08000a28:    f001fcf2    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000a2c:    6838        8h      LDR      r0,[r7,#0]
        0x08000a2e:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000a32:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000a36:    f8db1000    ....    LDR      r1,[r11,#0]
        0x08000a3a:    f001fb65    ..e.    BL       HFSISensorlessObserver ; 0x8002108
        0x08000a3e:    6838        8h      LDR      r0,[r7,#0]
        0x08000a40:    eef01a40    ..@.    VMOV.F32 s3,s0
        0x08000a44:    ed900a11    ....    VLDR     s0,[r0,#0x44]
        0x08000a48:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000a4c:    f001fe98    ....    BL       IdCurrentPIController ; 0x8002780
        0x08000a50:    6838        8h      LDR      r0,[r7,#0]
        0x08000a52:    e000        ..      B        0x8000a56 ; FOC_Method_HFSI_WithoutNS + 326
        0x08000a54:    e009        ..      B        0x8000a6a ; FOC_Method_HFSI_WithoutNS + 346
        0x08000a56:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000a5a:    6830        0h      LDR      r0,[r6,#0]
        0x08000a5c:    f001ff98    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000a60:    6828        (h      LDR      r0,[r5,#0]
        0x08000a62:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000a66:    ed808a03    ....    VSTR     s16,[r0,#0xc]
        0x08000a6a:    f8b80000    ....    LDRH     r0,[r8,#0]
        0x08000a6e:    491a        .I      LDR      r1,[pc,#104] ; [0x8000ad8] = 0xaaaaaaab
        0x08000a70:    1c40        @.      ADDS     r0,r0,#1
        0x08000a72:    fba12100    ...!    UMULL    r2,r1,r1,r0
        0x08000a76:    08c9        ..      LSRS     r1,r1,#3
        0x08000a78:    eba10181    ....    SUB      r1,r1,r1,LSL #2
        0x08000a7c:    eb000081    ....    ADD      r0,r0,r1,LSL #2
        0x08000a80:    f8a80000    ....    STRH     r0,[r8,#0]
        0x08000a84:    6820         h      LDR      r0,[r4,#0]
        0x08000a86:    6841        Ah      LDR      r1,[r0,#4]
        0x08000a88:    1c49        I.      ADDS     r1,r1,#1
        0x08000a8a:    6041        A`      STR      r1,[r0,#4]
        0x08000a8c:    290a        .)      CMP      r1,#0xa
        0x08000a8e:    d1a2        ..      BNE      0x80009d6 ; FOC_Method_HFSI_WithoutNS + 198
        0x08000a90:    f8c0a004    ....    STR      r10,[r0,#4]
        0x08000a94:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08000a98:    ed900a14    ....    VLDR     s0,[r0,#0x50]
        0x08000a9c:    480d        .H      LDR      r0,[pc,#52] ; [0x8000ad4] = 0x200000ac
        0x08000a9e:    6800        .h      LDR      r0,[r0,#0]
        0x08000aa0:    f004faec    ....    BL       SpeedPIController ; 0x800507c
        0x08000aa4:    6830        0h      LDR      r0,[r6,#0]
        0x08000aa6:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000aaa:    e794        ..      B        0x80009d6 ; FOC_Method_HFSI_WithoutNS + 198
    $d
        0x08000aac:    20000060    `..     DCD    536871008
        0x08000ab0:    200000a4    ...     DCD    536871076
        0x08000ab4:    00000000    ....    DCD    0
        0x08000ab8:    20000098    ...     DCD    536871064
        0x08000abc:    2000008c    ...     DCD    536871052
        0x08000ac0:    200000a8    ...     DCD    536871080
        0x08000ac4:    20000050    P..     DCD    536870992
        0x08000ac8:    200000a0    ...     DCD    536871072
        0x08000acc:    200000b8    ...     DCD    536871096
        0x08000ad0:    41fb53d2    .S.A    DCD    1106990034
        0x08000ad4:    200000ac    ...     DCD    536871084
        0x08000ad8:    aaaaaaab    ....    DCD    2863311531
    $t
    i.FOC_Method_IF_Luenberger
    FOC_Method_IF_Luenberger
        0x08000adc:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08000ae0:    4d98        .M      LDR      r5,[pc,#608] ; [0x8000d44] = 0x20000060
        0x08000ae2:    4f9d        .O      LDR      r7,[pc,#628] ; [0x8000d58] = 0x200000b8
        0x08000ae4:    f8df9260    ..`.    LDR      r9,[pc,#608] ; [0x8000d48] = 0x200000a4
        0x08000ae8:    f8df8260    ..`.    LDR      r8,[pc,#608] ; [0x8000d4c] = 0x200000a8
        0x08000aec:    4c98        .L      LDR      r4,[pc,#608] ; [0x8000d50] = 0x20000098
        0x08000aee:    4e99        .N      LDR      r6,[pc,#612] ; [0x8000d54] = 0x2000008c
        0x08000af0:    f04f0a00    O...    MOV      r10,#0
        0x08000af4:    ed2d8b02    -...    VPUSH    {d8}
        0x08000af8:    b083        ..      SUB      sp,sp,#0xc
        0x08000afa:    6828        (h      LDR      r0,[r5,#0]
        0x08000afc:    6839        9h      LDR      r1,[r7,#0]
        0x08000afe:    7c42        B|      LDRB     r2,[r0,#0x11]
        0x08000b00:    b172        r.      CBZ      r2,0x8000b20 ; FOC_Method_IF_Luenberger + 68
        0x08000b02:    2a01        .*      CMP      r2,#1
        0x08000b04:    d05b        [.      BEQ      0x8000bbe ; FOC_Method_IF_Luenberger + 226
        0x08000b06:    f8dfb254    ..T.    LDR      r11,[pc,#596] ; [0x8000d5c] = 0x40490fdb
        0x08000b0a:    ed9f8a95    ....    VLDR     s16,[pc,#596] ; [0x8000d60] = 0x40c90fdb
        0x08000b0e:    2a02        .*      CMP      r2,#2
        0x08000b10:    d066        f.      BEQ      0x8000be0 ; FOC_Method_IF_Luenberger + 260
        0x08000b12:    2a03        .*      CMP      r2,#3
        0x08000b14:    d07e        ~.      BEQ      0x8000c14 ; FOC_Method_IF_Luenberger + 312
        0x08000b16:    b003        ..      ADD      sp,sp,#0xc
        0x08000b18:    ecbd8b02    ....    VPOP     {d8}
        0x08000b1c:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08000b20:    6843        Ch      LDR      r3,[r0,#4]
        0x08000b22:    1c5a        Z.      ADDS     r2,r3,#1
        0x08000b24:    ed9f0a8f    ....    VLDR     s0,[pc,#572] ; [0x8000d64] = 0
        0x08000b28:    6042        B`      STR      r2,[r0,#4]
        0x08000b2a:    4a87        .J      LDR      r2,[pc,#540] ; [0x8000d48] = 0x200000a4
        0x08000b2c:    f5b36ffa    ...o    CMP      r3,#0x7d0
        0x08000b30:    6812        .h      LDR      r2,[r2,#0]
        0x08000b32:    d235        5.      BCS      0x8000ba0 ; FOC_Method_IF_Luenberger + 196
        0x08000b34:    edd10a03    ....    VLDR     s1,[r1,#0xc]
        0x08000b38:    edc20a00    ....    VSTR     s1,[r2,#0]
        0x08000b3c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000b40:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000b44:    f001fc64    ..d.    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000b48:    6820         h      LDR      r0,[r4,#0]
        0x08000b4a:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000b4e:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000b52:    303c        <0      ADDS     r0,r0,#0x3c
        0x08000b54:    f7fffcbc    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000b58:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000b5c:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08000b60:    6820         h      LDR      r0,[r4,#0]
        0x08000b62:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08000b66:    4668        hF      MOV      r0,sp
        0x08000b68:    f7fffcfc    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08000b6c:    6820         h      LDR      r0,[r4,#0]
        0x08000b6e:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000b72:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000b76:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000b7a:    f001fe01    ....    BL       IdCurrentPIController ; 0x8002780
        0x08000b7e:    6820         h      LDR      r0,[r4,#0]
        0x08000b80:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000b84:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000b88:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x08000b8c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000b90:    f001fefe    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000b94:    6830        0h      LDR      r0,[r6,#0]
        0x08000b96:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000b9a:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000b9e:    e7ba        ..      B        0x8000b16 ; FOC_Method_IF_Luenberger + 58
        0x08000ba0:    f8c0a004    ....    STR      r10,[r0,#4]
        0x08000ba4:    ed820a00    ....    VSTR     s0,[r2,#0]
        0x08000ba8:    6830        0h      LDR      r0,[r6,#0]
        0x08000baa:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000bae:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000bb2:    f007feb5    ....    BL       reset_CurrentPICHandler ; 0x8008920
        0x08000bb6:    6829        )h      LDR      r1,[r5,#0]
        0x08000bb8:    2001        .       MOVS     r0,#1
        0x08000bba:    7448        Ht      STRB     r0,[r1,#0x11]
        0x08000bbc:    e7ab        ..      B        0x8000b16 ; FOC_Method_IF_Luenberger + 58
        0x08000bbe:    6842        Bh      LDR      r2,[r0,#4]
        0x08000bc0:    1c53        S.      ADDS     r3,r2,#1
        0x08000bc2:    6043        C`      STR      r3,[r0,#4]
        0x08000bc4:    2a64        d*      CMP      r2,#0x64
        0x08000bc6:    d9a6        ..      BLS      0x8000b16 ; FOC_Method_IF_Luenberger + 58
        0x08000bc8:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000bcc:    ed910a03    ....    VLDR     s0,[r1,#0xc]
        0x08000bd0:    2102        .!      MOVS     r1,#2
        0x08000bd2:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000bd6:    6828        (h      LDR      r0,[r5,#0]
        0x08000bd8:    f8c0a004    ....    STR      r10,[r0,#4]
        0x08000bdc:    7441        At      STRB     r1,[r0,#0x11]
        0x08000bde:    e79a        ..      B        0x8000b16 ; FOC_Method_IF_Luenberger + 58
        0x08000be0:    ed910a02    ....    VLDR     s0,[r1,#8]
        0x08000be4:    f001fc14    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000be8:    6820         h      LDR      r0,[r4,#0]
        0x08000bea:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000bee:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000bf2:    303c        <0      ADDS     r0,r0,#0x3c
