ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08000bf4:    f7fffc6c    ..l.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000bf8:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000bfc:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08000c00:    6820         h      LDR      r0,[r4,#0]
        0x08000c02:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08000c06:    4668        hF      MOV      r0,sp
        0x08000c08:    f7fffcac    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08000c0c:    6820         h      LDR      r0,[r4,#0]
        0x08000c0e:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000c12:    e000        ..      B        0x8000c16 ; FOC_Method_IF_Luenberger + 314
        0x08000c14:    e047        G.      B        0x8000ca6 ; FOC_Method_IF_Luenberger + 458
        0x08000c16:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000c1a:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000c1e:    f001fdaf    ....    BL       IdCurrentPIController ; 0x8002780
        0x08000c22:    6820         h      LDR      r0,[r4,#0]
        0x08000c24:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000c28:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000c2c:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x08000c30:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000c34:    f001feac    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000c38:    6830        0h      LDR      r0,[r6,#0]
        0x08000c3a:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000c3e:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000c42:    6829        )h      LDR      r1,[r5,#0]
        0x08000c44:    684a        Jh      LDR      r2,[r1,#4]
        0x08000c46:    1c50        P.      ADDS     r0,r2,#1
        0x08000c48:    6048        H`      STR      r0,[r1,#4]
        0x08000c4a:    6838        8h      LDR      r0,[r7,#0]
        0x08000c4c:    6903        .i      LDR      r3,[r0,#0x10]
        0x08000c4e:    429a        .B      CMP      r2,r3
        0x08000c50:    d20a        ..      BCS      0x8000c68 ; FOC_Method_IF_Luenberger + 396
        0x08000c52:    ed900a01    ....    VLDR     s0,[r0,#4]
        0x08000c56:    edd10a06    ....    VLDR     s1,[r1,#0x18]
        0x08000c5a:    ed901a00    ....    VLDR     s2,[r0,#0]
        0x08000c5e:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08000c62:    ed800a01    ....    VSTR     s0,[r0,#4]
        0x08000c66:    e003        ..      B        0x8000c70 ; FOC_Method_IF_Luenberger + 404
        0x08000c68:    2203        ."      MOVS     r2,#3
        0x08000c6a:    f8c1a004    ....    STR      r10,[r1,#4]
        0x08000c6e:    744a        Jt      STRB     r2,[r1,#0x11]
        0x08000c70:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08000c74:    edd10a06    ....    VLDR     s1,[r1,#0x18]
        0x08000c78:    ed901a01    ....    VLDR     s2,[r0,#4]
        0x08000c7c:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08000c80:    ee101a10    ....    VMOV     r1,s0
        0x08000c84:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000c88:    4559        YE      CMP      r1,r11
        0x08000c8a:    bfc8        ..      IT       GT
        0x08000c8c:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08000c90:    dc07        ..      BGT      0x8000ca2 ; FOC_Method_IF_Luenberger + 454
        0x08000c92:    ee101a10    ....    VMOV     r1,s0
        0x08000c96:    4a34        4J      LDR      r2,[pc,#208] ; [0x8000d68] = 0xc0490fdb
        0x08000c98:    4291        .B      CMP      r1,r2
        0x08000c9a:    bf88        ..      IT       HI
        0x08000c9c:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x08000ca0:    d901        ..      BLS      0x8000ca6 ; FOC_Method_IF_Luenberger + 458
        0x08000ca2:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000ca6:    6838        8h      LDR      r0,[r7,#0]
        0x08000ca8:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08000cac:    f001fbb0    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000cb0:    6820         h      LDR      r0,[r4,#0]
        0x08000cb2:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000cb6:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000cba:    303c        <0      ADDS     r0,r0,#0x3c
        0x08000cbc:    f7fffc08    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000cc0:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000cc4:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08000cc8:    6820         h      LDR      r0,[r4,#0]
        0x08000cca:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08000cce:    4668        hF      MOV      r0,sp
        0x08000cd0:    f7fffc48    ..H.    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08000cd4:    6820         h      LDR      r0,[r4,#0]
        0x08000cd6:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000cda:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000cde:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000ce2:    f001fd4d    ..M.    BL       IdCurrentPIController ; 0x8002780
        0x08000ce6:    6820         h      LDR      r0,[r4,#0]
        0x08000ce8:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000cec:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000cf0:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x08000cf4:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000cf8:    f001fe4a    ..J.    BL       IqCurrentPIController ; 0x8002990
        0x08000cfc:    6830        0h      LDR      r0,[r6,#0]
        0x08000cfe:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000d02:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000d06:    6838        8h      LDR      r0,[r7,#0]
        0x08000d08:    6829        )h      LDR      r1,[r5,#0]
        0x08000d0a:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08000d0e:    edd10a06    ....    VLDR     s1,[r1,#0x18]
        0x08000d12:    ed901a01    ....    VLDR     s2,[r0,#4]
        0x08000d16:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08000d1a:    ee101a10    ....    VMOV     r1,s0
        0x08000d1e:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000d22:    4559        YE      CMP      r1,r11
        0x08000d24:    bfc8        ..      IT       GT
        0x08000d26:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08000d2a:    dc08        ..      BGT      0x8000d3e ; FOC_Method_IF_Luenberger + 610
        0x08000d2c:    ee101a10    ....    VMOV     r1,s0
        0x08000d30:    4a0d        .J      LDR      r2,[pc,#52] ; [0x8000d68] = 0xc0490fdb
        0x08000d32:    4291        .B      CMP      r1,r2
        0x08000d34:    bf88        ..      IT       HI
        0x08000d36:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x08000d3a:    f67faeec    ....    BLS      0x8000b16 ; FOC_Method_IF_Luenberger + 58
        0x08000d3e:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000d42:    e6e8        ..      B        0x8000b16 ; FOC_Method_IF_Luenberger + 58
    $d
        0x08000d44:    20000060    `..     DCD    536871008
        0x08000d48:    200000a4    ...     DCD    536871076
        0x08000d4c:    200000a8    ...     DCD    536871080
        0x08000d50:    20000098    ...     DCD    536871064
        0x08000d54:    2000008c    ...     DCD    536871052
        0x08000d58:    200000b8    ...     DCD    536871096
        0x08000d5c:    40490fdb    ..I@    DCD    1078530011
        0x08000d60:    40c90fdb    ...@    DCD    1086918619
        0x08000d64:    00000000    ....    DCD    0
        0x08000d68:    c0490fdb    ..I.    DCD    3226013659
    $t
    i.FOC_Method_IF_Luenberger_Debug
    FOC_Method_IF_Luenberger_Debug
        0x08000d6c:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08000d70:    4da2        .M      LDR      r5,[pc,#648] ; [0x8000ffc] = 0x20000060
        0x08000d72:    4fa8        .O      LDR      r7,[pc,#672] ; [0x8001014] = 0x200000b8
        0x08000d74:    f8df9288    ....    LDR      r9,[pc,#648] ; [0x8001000] = 0x20000094
        0x08000d78:    f8dfa288    ....    LDR      r10,[pc,#648] ; [0x8001004] = 0x200000a4
        0x08000d7c:    f8df8288    ....    LDR      r8,[pc,#648] ; [0x8001008] = 0x200000a8
        0x08000d80:    4ca2        .L      LDR      r4,[pc,#648] ; [0x800100c] = 0x20000098
        0x08000d82:    4ea3        .N      LDR      r6,[pc,#652] ; [0x8001010] = 0x2000008c
        0x08000d84:    f04f0b00    O...    MOV      r11,#0
        0x08000d88:    ed2d8b02    -...    VPUSH    {d8}
        0x08000d8c:    b083        ..      SUB      sp,sp,#0xc
        0x08000d8e:    6828        (h      LDR      r0,[r5,#0]
        0x08000d90:    6839        9h      LDR      r1,[r7,#0]
        0x08000d92:    7c42        B|      LDRB     r2,[r0,#0x11]
        0x08000d94:    b162        b.      CBZ      r2,0x8000db0 ; FOC_Method_IF_Luenberger_Debug + 68
        0x08000d96:    2a01        .*      CMP      r2,#1
        0x08000d98:    d063        c.      BEQ      0x8000e62 ; FOC_Method_IF_Luenberger_Debug + 246
        0x08000d9a:    ed9f8a9f    ....    VLDR     s16,[pc,#636] ; [0x8001018] = 0x40c90fdb
        0x08000d9e:    2a02        .*      CMP      r2,#2
        0x08000da0:    d072        r.      BEQ      0x8000e88 ; FOC_Method_IF_Luenberger_Debug + 284
        0x08000da2:    2a03        .*      CMP      r2,#3
        0x08000da4:    d06f        o.      BEQ      0x8000e86 ; FOC_Method_IF_Luenberger_Debug + 282
        0x08000da6:    b003        ..      ADD      sp,sp,#0xc
        0x08000da8:    ecbd8b02    ....    VPOP     {d8}
        0x08000dac:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08000db0:    6843        Ch      LDR      r3,[r0,#4]
        0x08000db2:    1c5a        Z.      ADDS     r2,r3,#1
        0x08000db4:    ed9f0a99    ....    VLDR     s0,[pc,#612] ; [0x800101c] = 0
        0x08000db8:    6042        B`      STR      r2,[r0,#4]
        0x08000dba:    4a92        .J      LDR      r2,[pc,#584] ; [0x8001004] = 0x200000a4
        0x08000dbc:    f5b36ffa    ...o    CMP      r3,#0x7d0
        0x08000dc0:    6812        .h      LDR      r2,[r2,#0]
        0x08000dc2:    d239        9.      BCS      0x8000e38 ; FOC_Method_IF_Luenberger_Debug + 204
        0x08000dc4:    edd10a03    ....    VLDR     s1,[r1,#0xc]
        0x08000dc8:    edc20a00    ....    VSTR     s1,[r2,#0]
        0x08000dcc:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000dd0:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000dd4:    f001fb1c    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000dd8:    6820         h      LDR      r0,[r4,#0]
        0x08000dda:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000dde:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000de2:    303c        <0      ADDS     r0,r0,#0x3c
        0x08000de4:    f7fffb74    ..t.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000de8:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000dec:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08000df0:    6820         h      LDR      r0,[r4,#0]
        0x08000df2:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08000df6:    4668        hF      MOV      r0,sp
        0x08000df8:    f7fffbb4    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08000dfc:    6820         h      LDR      r0,[r4,#0]
        0x08000dfe:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000e02:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000e06:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08000e0a:    f001fcb9    ....    BL       IdCurrentPIController ; 0x8002780
        0x08000e0e:    6820         h      LDR      r0,[r4,#0]
        0x08000e10:    eef01a40    ..@.    VMOV.F32 s3,s0
        0x08000e14:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000e18:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000e1c:    f001fdb8    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000e20:    6830        0h      LDR      r0,[r6,#0]
        0x08000e22:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000e26:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000e2a:    edc00a03    ....    VSTR     s1,[r0,#0xc]
        0x08000e2e:    f24040e2    @..@    MOV      r0,#0x4e2
        0x08000e32:    f001fc0d    ....    BL       Hardware_SetABZCounter ; 0x8002650
        0x08000e36:    e7b6        ..      B        0x8000da6 ; FOC_Method_IF_Luenberger_Debug + 58
        0x08000e38:    f8c0b004    ....    STR      r11,[r0,#4]
        0x08000e3c:    ed820a00    ....    VSTR     s0,[r2,#0]
        0x08000e40:    6830        0h      LDR      r0,[r6,#0]
        0x08000e42:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000e46:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000e4a:    f007fd69    ..i.    BL       reset_CurrentPICHandler ; 0x8008920
        0x08000e4e:    f8d91000    ....    LDR      r1,[r9,#0]
        0x08000e52:    2001        .       MOVS     r0,#1
        0x08000e54:    f24042e2    @..B    MOV      r2,#0x4e2
        0x08000e58:    7008        .p      STRB     r0,[r1,#0]
        0x08000e5a:    618a        .a      STR      r2,[r1,#0x18]
        0x08000e5c:    6829        )h      LDR      r1,[r5,#0]
        0x08000e5e:    7448        Ht      STRB     r0,[r1,#0x11]
        0x08000e60:    e7a1        ..      B        0x8000da6 ; FOC_Method_IF_Luenberger_Debug + 58
        0x08000e62:    6842        Bh      LDR      r2,[r0,#4]
        0x08000e64:    1c53        S.      ADDS     r3,r2,#1
        0x08000e66:    6043        C`      STR      r3,[r0,#4]
        0x08000e68:    2a64        d*      CMP      r2,#0x64
        0x08000e6a:    d99c        ..      BLS      0x8000da6 ; FOC_Method_IF_Luenberger_Debug + 58
        0x08000e6c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000e70:    ed910a03    ....    VLDR     s0,[r1,#0xc]
        0x08000e74:    2102        .!      MOVS     r1,#2
        0x08000e76:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08000e7a:    6828        (h      LDR      r0,[r5,#0]
        0x08000e7c:    f8c0b004    ....    STR      r11,[r0,#4]
        0x08000e80:    7441        At      STRB     r1,[r0,#0x11]
        0x08000e82:    e790        ..      B        0x8000da6 ; FOC_Method_IF_Luenberger_Debug + 58
        0x08000e84:    e000        ..      B        0x8000e88 ; FOC_Method_IF_Luenberger_Debug + 284
        0x08000e86:    e061        a.      B        0x8000f4c ; FOC_Method_IF_Luenberger_Debug + 480
        0x08000e88:    ed910a02    ....    VLDR     s0,[r1,#8]
        0x08000e8c:    f001fac0    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000e90:    6820         h      LDR      r0,[r4,#0]
        0x08000e92:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000e96:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000e9a:    303c        <0      ADDS     r0,r0,#0x3c
        0x08000e9c:    f7fffb18    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000ea0:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000ea4:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08000ea8:    6820         h      LDR      r0,[r4,#0]
        0x08000eaa:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08000eae:    4668        hF      MOV      r0,sp
        0x08000eb0:    f7fffb58    ..X.    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08000eb4:    6820         h      LDR      r0,[r4,#0]
        0x08000eb6:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000eba:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000ebe:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08000ec2:    f001fc5d    ..].    BL       IdCurrentPIController ; 0x8002780
        0x08000ec6:    6820         h      LDR      r0,[r4,#0]
        0x08000ec8:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000ecc:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000ed0:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x08000ed4:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000ed8:    f001fd5a    ..Z.    BL       IqCurrentPIController ; 0x8002990
        0x08000edc:    6830        0h      LDR      r0,[r6,#0]
        0x08000ede:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000ee2:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000ee6:    6829        )h      LDR      r1,[r5,#0]
        0x08000ee8:    684a        Jh      LDR      r2,[r1,#4]
        0x08000eea:    1c50        P.      ADDS     r0,r2,#1
        0x08000eec:    6048        H`      STR      r0,[r1,#4]
        0x08000eee:    6838        8h      LDR      r0,[r7,#0]
        0x08000ef0:    6903        .i      LDR      r3,[r0,#0x10]
        0x08000ef2:    429a        .B      CMP      r2,r3
        0x08000ef4:    d20a        ..      BCS      0x8000f0c ; FOC_Method_IF_Luenberger_Debug + 416
        0x08000ef6:    ed900a01    ....    VLDR     s0,[r0,#4]
        0x08000efa:    edd10a06    ....    VLDR     s1,[r1,#0x18]
        0x08000efe:    ed901a00    ....    VLDR     s2,[r0,#0]
        0x08000f02:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08000f06:    ed800a01    ....    VSTR     s0,[r0,#4]
        0x08000f0a:    e003        ..      B        0x8000f14 ; FOC_Method_IF_Luenberger_Debug + 424
        0x08000f0c:    2203        ."      MOVS     r2,#3
        0x08000f0e:    f8c1b004    ....    STR      r11,[r1,#4]
        0x08000f12:    744a        Jt      STRB     r2,[r1,#0x11]
        0x08000f14:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08000f18:    edd10a06    ....    VLDR     s1,[r1,#0x18]
        0x08000f1c:    ed901a01    ....    VLDR     s2,[r0,#4]
        0x08000f20:    4a3f        ?J      LDR      r2,[pc,#252] ; [0x8001020] = 0x40490fdb
        0x08000f22:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08000f26:    ee101a10    ....    VMOV     r1,s0
        0x08000f2a:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000f2e:    4291        .B      CMP      r1,r2
        0x08000f30:    bfc8        ..      IT       GT
        0x08000f32:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08000f36:    dc07        ..      BGT      0x8000f48 ; FOC_Method_IF_Luenberger_Debug + 476
        0x08000f38:    ee101a10    ....    VMOV     r1,s0
        0x08000f3c:    4a39        9J      LDR      r2,[pc,#228] ; [0x8001024] = 0xc0490fdb
        0x08000f3e:    4291        .B      CMP      r1,r2
        0x08000f40:    bf88        ..      IT       HI
        0x08000f42:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x08000f46:    d901        ..      BLS      0x8000f4c ; FOC_Method_IF_Luenberger_Debug + 480
        0x08000f48:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000f4c:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000f50:    f001fc64    ..d.    BL       IncAbzCalculateRealEleAngle ; 0x800281c
        0x08000f54:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08000f58:    ed800a08    ....    VSTR     s0,[r0,#0x20]
        0x08000f5c:    6838        8h      LDR      r0,[r7,#0]
        0x08000f5e:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08000f62:    f001fa55    ..U.    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08000f66:    6820         h      LDR      r0,[r4,#0]
        0x08000f68:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08000f6c:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08000f70:    303c        <0      ADDS     r0,r0,#0x3c
        0x08000f72:    f7fffaad    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08000f76:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08000f7a:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08000f7e:    6820         h      LDR      r0,[r4,#0]
        0x08000f80:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08000f84:    4668        hF      MOV      r0,sp
        0x08000f86:    f7fffaed    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08000f8a:    6820         h      LDR      r0,[r4,#0]
        0x08000f8c:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08000f90:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08000f94:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08000f98:    f001fbf2    ....    BL       IdCurrentPIController ; 0x8002780
        0x08000f9c:    6820         h      LDR      r0,[r4,#0]
        0x08000f9e:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08000fa2:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08000fa6:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x08000faa:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08000fae:    f001fcef    ....    BL       IqCurrentPIController ; 0x8002990
        0x08000fb2:    6830        0h      LDR      r0,[r6,#0]
        0x08000fb4:    4a1a        .J      LDR      r2,[pc,#104] ; [0x8001020] = 0x40490fdb
        0x08000fb6:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08000fba:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08000fbe:    6838        8h      LDR      r0,[r7,#0]
        0x08000fc0:    6829        )h      LDR      r1,[r5,#0]
        0x08000fc2:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08000fc6:    edd10a06    ....    VLDR     s1,[r1,#0x18]
        0x08000fca:    ed901a01    ....    VLDR     s2,[r0,#4]
        0x08000fce:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08000fd2:    ee101a10    ....    VMOV     r1,s0
        0x08000fd6:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000fda:    4291        .B      CMP      r1,r2
        0x08000fdc:    bfc8        ..      IT       GT
        0x08000fde:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08000fe2:    dc08        ..      BGT      0x8000ff6 ; FOC_Method_IF_Luenberger_Debug + 650
        0x08000fe4:    ee101a10    ....    VMOV     r1,s0
        0x08000fe8:    4a0e        .J      LDR      r2,[pc,#56] ; [0x8001024] = 0xc0490fdb
        0x08000fea:    4291        .B      CMP      r1,r2
        0x08000fec:    bf88        ..      IT       HI
        0x08000fee:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x08000ff2:    f67faed8    ....    BLS      0x8000da6 ; FOC_Method_IF_Luenberger_Debug + 58
        0x08000ff6:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08000ffa:    e6d4        ..      B        0x8000da6 ; FOC_Method_IF_Luenberger_Debug + 58
    $d
        0x08000ffc:    20000060    `..     DCD    536871008
        0x08001000:    20000094    ...     DCD    536871060
        0x08001004:    200000a4    ...     DCD    536871076
        0x08001008:    200000a8    ...     DCD    536871080
        0x0800100c:    20000098    ...     DCD    536871064
        0x08001010:    2000008c    ...     DCD    536871052
        0x08001014:    200000b8    ...     DCD    536871096
        0x08001018:    40c90fdb    ...@    DCD    1086918619
        0x0800101c:    00000000    ....    DCD    0
        0x08001020:    40490fdb    ..I@    DCD    1078530011
        0x08001024:    c0490fdb    ..I.    DCD    3226013659
    $t
    i.FOC_Method_IncABZ
    FOC_Method_IncABZ
        0x08001028:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x0800102c:    4d78        xM      LDR      r5,[pc,#480] ; [0x8001210] = 0x20000060
        0x0800102e:    4e77        wN      LDR      r6,[pc,#476] ; [0x800120c] = 0x20000094
        0x08001030:    f8dfa1e0    ....    LDR      r10,[pc,#480] ; [0x8001214] = 0x200000a4
        0x08001034:    4c78        xL      LDR      r4,[pc,#480] ; [0x8001218] = 0x20000098
        0x08001036:    4f79        yO      LDR      r7,[pc,#484] ; [0x800121c] = 0x2000008c
        0x08001038:    f8dfb1e4    ....    LDR      r11,[pc,#484] ; [0x8001220] = 0x200000ac
        0x0800103c:    f8df81e4    ....    LDR      r8,[pc,#484] ; [0x8001224] = 0x200000a8
        0x08001040:    f04f0900    O...    MOV      r9,#0
        0x08001044:    ed2d8b02    -...    VPUSH    {d8}
