ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08001048:    b083        ..      SUB      sp,sp,#0xc
        0x0800104a:    6829        )h      LDR      r1,[r5,#0]
        0x0800104c:    6830        0h      LDR      r0,[r6,#0]
        0x0800104e:    7c4a        J|      LDRB     r2,[r1,#0x11]
        0x08001050:    ed908a07    ....    VLDR     s16,[r0,#0x1c]
        0x08001054:    2a00        .*      CMP      r2,#0
        0x08001056:    d06a        j.      BEQ      0x800112e ; FOC_Method_IncABZ + 262
        0x08001058:    2a01        .*      CMP      r2,#1
        0x0800105a:    d07d        }.      BEQ      0x8001158 ; FOC_Method_IncABZ + 304
        0x0800105c:    2a02        .*      CMP      r2,#2
        0x0800105e:    bf1e        ..      ITTT     NE
        0x08001060:    b003        ..      ADDNE    sp,sp,#0xc
        0x08001062:    ecbd8b02    ....    VPOPNE   {d8}
        0x08001066:    e8bd8ff0    ....    POPNE    {r4-r11,pc}
        0x0800106a:    f001fbd7    ....    BL       IncAbzCalculateRealEleAngle ; 0x800281c
        0x0800106e:    6830        0h      LDR      r0,[r6,#0]
        0x08001070:    ed800a08    ....    VSTR     s0,[r0,#0x20]
        0x08001074:    f001f9cc    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08001078:    6820         h      LDR      r0,[r4,#0]
        0x0800107a:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x0800107e:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08001082:    303c        <0      ADDS     r0,r0,#0x3c
        0x08001084:    f7fffa24    ..$.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08001088:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x0800108c:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08001090:    6820         h      LDR      r0,[r4,#0]
        0x08001092:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08001096:    4668        hF      MOV      r0,sp
        0x08001098:    f7fffa64    ..d.    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x0800109c:    6820         h      LDR      r0,[r4,#0]
        0x0800109e:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x080010a2:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x080010a6:    f8da0000    ....    LDR      r0,[r10,#0]
        0x080010aa:    f001fb69    ..i.    BL       IdCurrentPIController ; 0x8002780
        0x080010ae:    6820         h      LDR      r0,[r4,#0]
        0x080010b0:    eef01a40    ..@.    VMOV.F32 s3,s0
        0x080010b4:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x080010b8:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080010bc:    f001fc68    ..h.    BL       IqCurrentPIController ; 0x8002990
        0x080010c0:    4859        YH      LDR      r0,[pc,#356] ; [0x8001228] = 0x20000090
        0x080010c2:    6821        !h      LDR      r1,[r4,#0]
        0x080010c4:    6800        .h      LDR      r0,[r0,#0]
        0x080010c6:    edd10a12    ....    VLDR     s1,[r1,#0x48]
        0x080010ca:    ed901a02    ....    VLDR     s2,[r0,#8]
        0x080010ce:    ed902a01    ...*    VLDR     s4,[r0,#4]
        0x080010d2:    ee600a81    `...    VMUL.F32 s1,s1,s2
        0x080010d6:    ed911a11    ....    VLDR     s2,[r1,#0x44]
        0x080010da:    ee401ac8    @...    VMLS.F32 s3,s1,s16
        0x080010de:    edd00a06    ....    VLDR     s1,[r0,#0x18]
        0x080010e2:    6838        8h      LDR      r0,[r7,#0]
        0x080010e4:    ee410a02    A...    VMLA.F32 s1,s2,s4
        0x080010e8:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080010ec:    ee000a88    ....    VMLA.F32 s0,s1,s16
        0x080010f0:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080010f4:    6828        (h      LDR      r0,[r5,#0]
        0x080010f6:    6841        Ah      LDR      r1,[r0,#4]
        0x080010f8:    1c49        I.      ADDS     r1,r1,#1
        0x080010fa:    6041        A`      STR      r1,[r0,#4]
        0x080010fc:    290a        .)      CMP      r1,#0xa
        0x080010fe:    d111        ..      BNE      0x8001124 ; FOC_Method_IncABZ + 252
        0x08001100:    f8c09004    ....    STR      r9,[r0,#4]
        0x08001104:    6830        0h      LDR      r0,[r6,#0]
        0x08001106:    ed900a07    ....    VLDR     s0,[r0,#0x1c]
        0x0800110a:    f001fba1    ....    BL       IncAbzCalculateRealEleSpeed ; 0x8002850
        0x0800110e:    6830        0h      LDR      r0,[r6,#0]
        0x08001110:    ed800a07    ....    VSTR     s0,[r0,#0x1c]
        0x08001114:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08001118:    f003ffb0    ....    BL       SpeedPIController ; 0x800507c
        0x0800111c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08001120:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08001124:    b003        ..      ADD      sp,sp,#0xc
        0x08001126:    ecbd8b02    ....    VPOP     {d8}
        0x0800112a:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x0800112e:    684a        Jh      LDR      r2,[r1,#4]
        0x08001130:    ed9f0a3e    ..>.    VLDR     s0,[pc,#248] ; [0x800122c] = 0
        0x08001134:    1c50        P.      ADDS     r0,r2,#1
        0x08001136:    6048        H`      STR      r0,[r1,#4]
        0x08001138:    4836        6H      LDR      r0,[pc,#216] ; [0x8001214] = 0x200000a4
        0x0800113a:    f5b26ffa    ...o    CMP      r2,#0x7d0
        0x0800113e:    6800        .h      LDR      r0,[r0,#0]
        0x08001140:    d237        7.      BCS      0x80011b2 ; FOC_Method_IncABZ + 394
        0x08001142:    eef10a00    ....    VMOV.F32 s1,#4.00000000
        0x08001146:    edc00a00    ....    VSTR     s1,[r0,#0]
        0x0800114a:    f8d80000    ....    LDR      r0,[r8,#0]
        0x0800114e:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08001152:    f001f95d    ..].    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08001156:    e000        ..      B        0x800115a ; FOC_Method_IncABZ + 306
        0x08001158:    e049        I.      B        0x80011ee ; FOC_Method_IncABZ + 454
        0x0800115a:    6820         h      LDR      r0,[r4,#0]
        0x0800115c:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08001160:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08001164:    303c        <0      ADDS     r0,r0,#0x3c
        0x08001166:    f7fff9b3    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x0800116a:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x0800116e:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08001172:    6820         h      LDR      r0,[r4,#0]
        0x08001174:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08001178:    4668        hF      MOV      r0,sp
        0x0800117a:    f7fff9f3    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x0800117e:    6820         h      LDR      r0,[r4,#0]
        0x08001180:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08001184:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08001188:    f8da0000    ....    LDR      r0,[r10,#0]
        0x0800118c:    f001faf8    ....    BL       IdCurrentPIController ; 0x8002780
        0x08001190:    6820         h      LDR      r0,[r4,#0]
        0x08001192:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08001196:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x0800119a:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x0800119e:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080011a2:    f001fbf5    ....    BL       IqCurrentPIController ; 0x8002990
        0x080011a6:    6838        8h      LDR      r0,[r7,#0]
        0x080011a8:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080011ac:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080011b0:    e7b8        ..      B        0x8001124 ; FOC_Method_IncABZ + 252
        0x080011b2:    f8c19004    ....    STR      r9,[r1,#4]
        0x080011b6:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080011ba:    f8db0000    ....    LDR      r0,[r11,#0]
        0x080011be:    eddf0a1c    ....    VLDR     s1,[pc,#112] ; [0x8001230] = 0x437b53d2
        0x080011c2:    2401        .$      MOVS     r4,#1
        0x080011c4:    edc00a00    ....    VSTR     s1,[r0,#0]
        0x080011c8:    6838        8h      LDR      r0,[r7,#0]
        0x080011ca:    f24041e2    @..A    MOV      r1,#0x4e2
        0x080011ce:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080011d2:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x080011d6:    6830        0h      LDR      r0,[r6,#0]
        0x080011d8:    7004        .p      STRB     r4,[r0,#0]
        0x080011da:    6181        .a      STR      r1,[r0,#0x18]
        0x080011dc:    f007fba0    ....    BL       reset_CurrentPICHandler ; 0x8008920
        0x080011e0:    f24040e2    @..@    MOV      r0,#0x4e2
        0x080011e4:    f001fa34    ..4.    BL       Hardware_SetABZCounter ; 0x8002650
        0x080011e8:    6828        (h      LDR      r0,[r5,#0]
        0x080011ea:    7444        Dt      STRB     r4,[r0,#0x11]
        0x080011ec:    e79a        ..      B        0x8001124 ; FOC_Method_IncABZ + 252
        0x080011ee:    6848        Hh      LDR      r0,[r1,#4]
        0x080011f0:    1c42        B.      ADDS     r2,r0,#1
        0x080011f2:    604a        J`      STR      r2,[r1,#4]
        0x080011f4:    2864        d(      CMP      r0,#0x64
        0x080011f6:    d995        ..      BLS      0x8001124 ; FOC_Method_IncABZ + 252
        0x080011f8:    2000        .       MOVS     r0,#0
        0x080011fa:    f001fa37    ..7.    BL       Hardware_SetPulseCounter ; 0x800266c
        0x080011fe:    6828        (h      LDR      r0,[r5,#0]
        0x08001200:    2102        .!      MOVS     r1,#2
        0x08001202:    f8c09004    ....    STR      r9,[r0,#4]
        0x08001206:    7441        At      STRB     r1,[r0,#0x11]
        0x08001208:    e78c        ..      B        0x8001124 ; FOC_Method_IncABZ + 252
    $d
        0x0800120a:    0000        ..      DCW    0
        0x0800120c:    20000094    ...     DCD    536871060
        0x08001210:    20000060    `..     DCD    536871008
        0x08001214:    200000a4    ...     DCD    536871076
        0x08001218:    20000098    ...     DCD    536871064
        0x0800121c:    2000008c    ...     DCD    536871052
        0x08001220:    200000ac    ...     DCD    536871084
        0x08001224:    200000a8    ...     DCD    536871080
        0x08001228:    20000090    ...     DCD    536871056
        0x0800122c:    00000000    ....    DCD    0
        0x08001230:    437b53d2    .S{C    DCD    1132155858
    $t
    i.FOC_Method_NonlinearFlux
    FOC_Method_NonlinearFlux
        0x08001234:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001238:    4e4d        MN      LDR      r6,[pc,#308] ; [0x8001370] = 0x20000060
        0x0800123a:    4f4e        NO      LDR      r7,[pc,#312] ; [0x8001374] = 0x200000a4
        0x0800123c:    b088        ..      SUB      sp,sp,#0x20
        0x0800123e:    6830        0h      LDR      r0,[r6,#0]
        0x08001240:    7c40        @|      LDRB     r0,[r0,#0x11]
        0x08001242:    2800        .(      CMP      r0,#0
        0x08001244:    d07e        ~.      BEQ      0x8001344 ; FOC_Method_NonlinearFlux + 272
        0x08001246:    2801        .(      CMP      r0,#1
        0x08001248:    bf1c        ..      ITT      NE
        0x0800124a:    b008        ..      ADDNE    sp,sp,#0x20
        0x0800124c:    e8bd81f0    ....    POPNE    {r4-r8,pc}
        0x08001250:    4d49        IM      LDR      r5,[pc,#292] ; [0x8001378] = 0x200000b4
        0x08001252:    6828        (h      LDR      r0,[r5,#0]
        0x08001254:    ed900a0b    ....    VLDR     s0,[r0,#0x2c]
        0x08001258:    f001f8da    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x0800125c:    4c47        GL      LDR      r4,[pc,#284] ; [0x800137c] = 0x20000098
        0x0800125e:    6820         h      LDR      r0,[r4,#0]
        0x08001260:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08001264:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08001268:    303c        <0      ADDS     r0,r0,#0x3c
        0x0800126a:    f7fff931    ..1.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x0800126e:    ed8d0a04    ....    VSTR     s0,[sp,#0x10]
        0x08001272:    edcd0a05    ....    VSTR     s1,[sp,#0x14]
        0x08001276:    6820         h      LDR      r0,[r4,#0]
        0x08001278:    ee102a90    ...*    VMOV     r2,s1
        0x0800127c:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08001280:    ed800a13    ....    VSTR     s0,[r0,#0x4c]
        0x08001284:    6502        .e      STR      r2,[r0,#0x50]
        0x08001286:    a804        ..      ADD      r0,sp,#0x10
        0x08001288:    f7fff96c    ..l.    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x0800128c:    6820         h      LDR      r0,[r4,#0]
        0x0800128e:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08001292:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08001296:    6838        8h      LDR      r0,[r7,#0]
        0x08001298:    f001fa72    ..r.    BL       IdCurrentPIController ; 0x8002780
        0x0800129c:    ed8d0a02    ....    VSTR     s0,[sp,#8]
        0x080012a0:    6820         h      LDR      r0,[r4,#0]
        0x080012a2:    4f37        7O      LDR      r7,[pc,#220] ; [0x8001380] = 0x200000a8
        0x080012a4:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x080012a8:    6838        8h      LDR      r0,[r7,#0]
        0x080012aa:    f001fb71    ..q.    BL       IqCurrentPIController ; 0x8002990
        0x080012ae:    ed8d0a03    ....    VSTR     s0,[sp,#0xc]
        0x080012b2:    6820         h      LDR      r0,[r4,#0]
        0x080012b4:    4c33        3L      LDR      r4,[pc,#204] ; [0x8001384] = 0x20000090
        0x080012b6:    682a        *h      LDR      r2,[r5,#0]
        0x080012b8:    edd00a12    ....    VLDR     s1,[r0,#0x48]
        0x080012bc:    6821        !h      LDR      r1,[r4,#0]
        0x080012be:    ed911a02    ....    VLDR     s2,[r1,#8]
        0x080012c2:    ee601a81    `...    VMUL.F32 s3,s1,s2
        0x080012c6:    ed921a0a    ....    VLDR     s2,[r2,#0x28]
        0x080012ca:    eddd0a02    ....    VLDR     s1,[sp,#8]
        0x080012ce:    ee410ac1    A...    VMLS.F32 s1,s3,s2
        0x080012d2:    edcd0a02    ....    VSTR     s1,[sp,#8]
        0x080012d6:    edd11a06    ....    VLDR     s3,[r1,#0x18]
        0x080012da:    ed902a11    ...*    VLDR     s4,[r0,#0x44]
        0x080012de:    edd12a01    ...*    VLDR     s5,[r1,#4]
        0x080012e2:    4929        )I      LDR      r1,[pc,#164] ; [0x8001388] = 0x2000008c
        0x080012e4:    ee421a22    B.".    VMLA.F32 s3,s4,s5
        0x080012e8:    ee010a81    ....    VMLA.F32 s0,s3,s2
        0x080012ec:    ed8d0a03    ....    VSTR     s0,[sp,#0xc]
        0x080012f0:    6809        .h      LDR      r1,[r1,#0]
        0x080012f2:    edc10a02    ....    VSTR     s1,[r1,#8]
        0x080012f6:    ed9d0a03    ....    VLDR     s0,[sp,#0xc]
        0x080012fa:    ed810a03    ....    VSTR     s0,[r1,#0xc]
        0x080012fe:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08001302:    a802        ..      ADD      r0,sp,#8
        0x08001304:    f7fff9af    ....    BL       Dq_AlphaBeta_Trans ; 0x8000666
        0x08001308:    ed8d0a06    ....    VSTR     s0,[sp,#0x18]
        0x0800130c:    edcd0a07    ....    VSTR     s1,[sp,#0x1c]
        0x08001310:    a804        ..      ADD      r0,sp,#0x10
        0x08001312:    f8df8078    ..x.    LDR      r8,[pc,#120] ; [0x800138c] = 0x200000ac
        0x08001316:    9000        ..      STR      r0,[sp,#0]
        0x08001318:    ab06        ..      ADD      r3,sp,#0x18
        0x0800131a:    f8d82000    ...     LDR      r2,[r8,#0]
        0x0800131e:    6829        )h      LDR      r1,[r5,#0]
        0x08001320:    6820         h      LDR      r0,[r4,#0]
        0x08001322:    f002fee5    ....    BL       NonlinearFluxObsProcess ; 0x80040f0
        0x08001326:    6830        0h      LDR      r0,[r6,#0]
        0x08001328:    6841        Ah      LDR      r1,[r0,#4]
        0x0800132a:    1c49        I.      ADDS     r1,r1,#1
        0x0800132c:    6041        A`      STR      r1,[r0,#4]
        0x0800132e:    290a        .)      CMP      r1,#0xa
        0x08001330:    bf1c        ..      ITT      NE
        0x08001332:    b008        ..      ADDNE    sp,sp,#0x20
        0x08001334:    e8bd81f0    ....    POPNE    {r4-r8,pc}
        0x08001338:    2100        .!      MOVS     r1,#0
        0x0800133a:    6041        A`      STR      r1,[r0,#4]
        0x0800133c:    6828        (h      LDR      r0,[r5,#0]
        0x0800133e:    ed900a0a    ....    VLDR     s0,[r0,#0x28]
        0x08001342:    e000        ..      B        0x8001346 ; FOC_Method_NonlinearFlux + 274
        0x08001344:    e009        ..      B        0x800135a ; FOC_Method_NonlinearFlux + 294
        0x08001346:    f8d80000    ....    LDR      r0,[r8,#0]
        0x0800134a:    f003fe97    ....    BL       SpeedPIController ; 0x800507c
        0x0800134e:    6838        8h      LDR      r0,[r7,#0]
        0x08001350:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08001354:    b008        ..      ADD      sp,sp,#0x20
        0x08001356:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x0800135a:    6838        8h      LDR      r0,[r7,#0]
        0x0800135c:    ed9f0a0c    ....    VLDR     s0,[pc,#48] ; [0x8001390] = 0
        0x08001360:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08001364:    6831        1h      LDR      r1,[r6,#0]
        0x08001366:    2001        .       MOVS     r0,#1
        0x08001368:    7448        Ht      STRB     r0,[r1,#0x11]
        0x0800136a:    b008        ..      ADD      sp,sp,#0x20
        0x0800136c:    e8bd81f0    ....    POP      {r4-r8,pc}
    $d
        0x08001370:    20000060    `..     DCD    536871008
        0x08001374:    200000a4    ...     DCD    536871076
        0x08001378:    200000b4    ...     DCD    536871092
        0x0800137c:    20000098    ...     DCD    536871064
        0x08001380:    200000a8    ...     DCD    536871080
        0x08001384:    20000090    ...     DCD    536871056
        0x08001388:    2000008c    ...     DCD    536871052
        0x0800138c:    200000ac    ...     DCD    536871084
        0x08001390:    00000000    ....    DCD    0
    $t
    i.FOC_Method_NonlinearFlux_Debug
    FOC_Method_NonlinearFlux_Debug
        0x08001394:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08001398:    4d8c        .M      LDR      r5,[pc,#560] ; [0x80015cc] = 0x20000060
        0x0800139a:    f8dfa234    ..4.    LDR      r10,[pc,#564] ; [0x80015d0] = 0x200000a4
        0x0800139e:    4c8d        .L      LDR      r4,[pc,#564] ; [0x80015d4] = 0x20000098
        0x080013a0:    6828        (h      LDR      r0,[r5,#0]
        0x080013a2:    4e8d        .N      LDR      r6,[pc,#564] ; [0x80015d8] = 0x2000008c
        0x080013a4:    f8df8234    ..4.    LDR      r8,[pc,#564] ; [0x80015dc] = 0x20000094
        0x080013a8:    7c41        A|      LDRB     r1,[r0,#0x11]
        0x080013aa:    4f8d        .O      LDR      r7,[pc,#564] ; [0x80015e0] = 0x200000a8
        0x080013ac:    b088        ..      SUB      sp,sp,#0x20
        0x080013ae:    f04f0900    O...    MOV      r9,#0
        0x080013b2:    2900        .)      CMP      r1,#0
        0x080013b4:    d07e        ~.      BEQ      0x80014b4 ; FOC_Method_NonlinearFlux_Debug + 288
        0x080013b6:    2901        .)      CMP      r1,#1
        0x080013b8:    f00080f4    ....    BEQ.W    0x80015a4 ; FOC_Method_NonlinearFlux_Debug + 528
        0x080013bc:    2902        .)      CMP      r1,#2
        0x080013be:    bf1c        ..      ITT      NE
        0x080013c0:    b008        ..      ADDNE    sp,sp,#0x20
        0x080013c2:    e8bd87f0    ....    POPNE    {r4-r10,pc}
        0x080013c6:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080013ca:    f001fa27    ..'.    BL       IncAbzCalculateRealEleAngle ; 0x800281c
        0x080013ce:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080013d2:    f8df8210    ....    LDR      r8,[pc,#528] ; [0x80015e4] = 0x200000b4
        0x080013d6:    ed800a08    ....    VSTR     s0,[r0,#0x20]
        0x080013da:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080013de:    ed900a0b    ....    VLDR     s0,[r0,#0x2c]
        0x080013e2:    f001f815    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x080013e6:    6820         h      LDR      r0,[r4,#0]
        0x080013e8:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x080013ec:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x080013f0:    303c        <0      ADDS     r0,r0,#0x3c
        0x080013f2:    f7fff86d    ..m.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x080013f6:    ed8d0a04    ....    VSTR     s0,[sp,#0x10]
        0x080013fa:    edcd0a05    ....    VSTR     s1,[sp,#0x14]
        0x080013fe:    6820         h      LDR      r0,[r4,#0]
        0x08001400:    ee102a90    ...*    VMOV     r2,s1
        0x08001404:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08001408:    ed800a13    ....    VSTR     s0,[r0,#0x4c]
        0x0800140c:    6502        .e      STR      r2,[r0,#0x50]
        0x0800140e:    a804        ..      ADD      r0,sp,#0x10
        0x08001410:    f7fff8a8    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08001414:    6820         h      LDR      r0,[r4,#0]
        0x08001416:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x0800141a:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x0800141e:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08001422:    f001f9ad    ....    BL       IdCurrentPIController ; 0x8002780
        0x08001426:    ed8d0a02    ....    VSTR     s0,[sp,#8]
        0x0800142a:    6820         h      LDR      r0,[r4,#0]
        0x0800142c:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x08001430:    6838        8h      LDR      r0,[r7,#0]
        0x08001432:    f001faad    ....    BL       IqCurrentPIController ; 0x8002990
        0x08001436:    ed8d0a03    ....    VSTR     s0,[sp,#0xc]
        0x0800143a:    6820         h      LDR      r0,[r4,#0]
        0x0800143c:    4c6a        jL      LDR      r4,[pc,#424] ; [0x80015e8] = 0x20000090
        0x0800143e:    f8d82000    ...     LDR      r2,[r8,#0]
        0x08001442:    edd00a12    ....    VLDR     s1,[r0,#0x48]
        0x08001446:    6821        !h      LDR      r1,[r4,#0]
        0x08001448:    ed911a02    ....    VLDR     s2,[r1,#8]
        0x0800144c:    ee601a81    `...    VMUL.F32 s3,s1,s2
        0x08001450:    ed921a0a    ....    VLDR     s2,[r2,#0x28]
        0x08001454:    eddd0a02    ....    VLDR     s1,[sp,#8]
        0x08001458:    ee410ac1    A...    VMLS.F32 s1,s3,s2
        0x0800145c:    edcd0a02    ....    VSTR     s1,[sp,#8]
        0x08001460:    edd11a06    ....    VLDR     s3,[r1,#0x18]
        0x08001464:    ed902a11    ...*    VLDR     s4,[r0,#0x44]
        0x08001468:    edd12a01    ...*    VLDR     s5,[r1,#4]
        0x0800146c:    ee421a22    B.".    VMLA.F32 s3,s4,s5
        0x08001470:    ee010a81    ....    VMLA.F32 s0,s3,s2
        0x08001474:    ed8d0a03    ....    VSTR     s0,[sp,#0xc]
        0x08001478:    6831        1h      LDR      r1,[r6,#0]
        0x0800147a:    edc10a02    ....    VSTR     s1,[r1,#8]
        0x0800147e:    ed9d0a03    ....    VLDR     s0,[sp,#0xc]
        0x08001482:    ed810a03    ....    VSTR     s0,[r1,#0xc]
        0x08001486:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x0800148a:    a802        ..      ADD      r0,sp,#8
        0x0800148c:    f7fff8eb    ....    BL       Dq_AlphaBeta_Trans ; 0x8000666
        0x08001490:    ed8d0a06    ....    VSTR     s0,[sp,#0x18]
        0x08001494:    edcd0a07    ....    VSTR     s1,[sp,#0x1c]
        0x08001498:    a804        ..      ADD      r0,sp,#0x10
        0x0800149a:    4e54        TN      LDR      r6,[pc,#336] ; [0x80015ec] = 0x200000ac
