ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800149c:    9000        ..      STR      r0,[sp,#0]
        0x0800149e:    ab06        ..      ADD      r3,sp,#0x18
        0x080014a0:    6832        2h      LDR      r2,[r6,#0]
        0x080014a2:    f8d81000    ....    LDR      r1,[r8,#0]
        0x080014a6:    6820         h      LDR      r0,[r4,#0]
        0x080014a8:    f002fe22    ..".    BL       NonlinearFluxObsProcess ; 0x80040f0
        0x080014ac:    6828        (h      LDR      r0,[r5,#0]
        0x080014ae:    6841        Ah      LDR      r1,[r0,#4]
        0x080014b0:    1c49        I.      ADDS     r1,r1,#1
        0x080014b2:    e000        ..      B        0x80014b6 ; FOC_Method_NonlinearFlux_Debug + 290
        0x080014b4:    e014        ..      B        0x80014e0 ; FOC_Method_NonlinearFlux_Debug + 332
        0x080014b6:    6041        A`      STR      r1,[r0,#4]
        0x080014b8:    290a        .)      CMP      r1,#0xa
        0x080014ba:    bf1c        ..      ITT      NE
        0x080014bc:    b008        ..      ADDNE    sp,sp,#0x20
        0x080014be:    e8bd87f0    ....    POPNE    {r4-r10,pc}
        0x080014c2:    f8c09004    ....    STR      r9,[r0,#4]
        0x080014c6:    f8d80000    ....    LDR      r0,[r8,#0]
        0x080014ca:    ed900a0a    ....    VLDR     s0,[r0,#0x28]
        0x080014ce:    6830        0h      LDR      r0,[r6,#0]
        0x080014d0:    f003fdd4    ....    BL       SpeedPIController ; 0x800507c
        0x080014d4:    6838        8h      LDR      r0,[r7,#0]
        0x080014d6:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080014da:    b008        ..      ADD      sp,sp,#0x20
        0x080014dc:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x080014e0:    6842        Bh      LDR      r2,[r0,#4]
        0x080014e2:    f6446320    D. c    MOV      r3,#0x4e20
        0x080014e6:    1c51        Q.      ADDS     r1,r2,#1
        0x080014e8:    ed9f0a41    ..A.    VLDR     s0,[pc,#260] ; [0x80015f0] = 0
        0x080014ec:    6041        A`      STR      r1,[r0,#4]
        0x080014ee:    4938        8I      LDR      r1,[pc,#224] ; [0x80015d0] = 0x200000a4
        0x080014f0:    429a        .B      CMP      r2,r3
        0x080014f2:    6809        .h      LDR      r1,[r1,#0]
        0x080014f4:    d23b        ;.      BCS      0x800156e ; FOC_Method_NonlinearFlux_Debug + 474
        0x080014f6:    483f        ?H      LDR      r0,[pc,#252] ; [0x80015f4] = 0x200000b8
        0x080014f8:    6800        .h      LDR      r0,[r0,#0]
        0x080014fa:    edd00a03    ....    VLDR     s1,[r0,#0xc]
        0x080014fe:    edc10a00    ....    VSTR     s1,[r1,#0]
        0x08001502:    6838        8h      LDR      r0,[r7,#0]
        0x08001504:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08001508:    f000ff82    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x0800150c:    6820         h      LDR      r0,[r4,#0]
        0x0800150e:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08001512:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08001516:    303c        <0      ADDS     r0,r0,#0x3c
        0x08001518:    f7feffda    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x0800151c:    ed8d0a04    ....    VSTR     s0,[sp,#0x10]
        0x08001520:    edcd0a05    ....    VSTR     s1,[sp,#0x14]
        0x08001524:    6820         h      LDR      r0,[r4,#0]
        0x08001526:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x0800152a:    a804        ..      ADD      r0,sp,#0x10
        0x0800152c:    f7fff81a    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08001530:    6820         h      LDR      r0,[r4,#0]
        0x08001532:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x08001536:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x0800153a:    f8da0000    ....    LDR      r0,[r10,#0]
        0x0800153e:    f001f91f    ....    BL       IdCurrentPIController ; 0x8002780
        0x08001542:    ed8d0a02    ....    VSTR     s0,[sp,#8]
        0x08001546:    6820         h      LDR      r0,[r4,#0]
        0x08001548:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x0800154c:    6838        8h      LDR      r0,[r7,#0]
        0x0800154e:    f001fa1f    ....    BL       IqCurrentPIController ; 0x8002990
        0x08001552:    ed8d0a03    ....    VSTR     s0,[sp,#0xc]
        0x08001556:    6830        0h      LDR      r0,[r6,#0]
        0x08001558:    ed9d0a02    ....    VLDR     s0,[sp,#8]
        0x0800155c:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08001560:    ed9d0a03    ....    VLDR     s0,[sp,#0xc]
        0x08001564:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08001568:    b008        ..      ADD      sp,sp,#0x20
        0x0800156a:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x0800156e:    f8c09004    ....    STR      r9,[r0,#4]
        0x08001572:    ed810a00    ....    VSTR     s0,[r1,#0]
        0x08001576:    6830        0h      LDR      r0,[r6,#0]
        0x08001578:    2401        .$      MOVS     r4,#1
        0x0800157a:    f24041e2    @..A    MOV      r1,#0x4e2
        0x0800157e:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08001582:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08001586:    f8d80000    ....    LDR      r0,[r8,#0]
        0x0800158a:    7004        .p      STRB     r4,[r0,#0]
        0x0800158c:    6181        .a      STR      r1,[r0,#0x18]
        0x0800158e:    f007f9c7    ....    BL       reset_CurrentPICHandler ; 0x8008920
        0x08001592:    f24040e2    @..@    MOV      r0,#0x4e2
        0x08001596:    f001f85b    ..[.    BL       Hardware_SetABZCounter ; 0x8002650
        0x0800159a:    6828        (h      LDR      r0,[r5,#0]
        0x0800159c:    7444        Dt      STRB     r4,[r0,#0x11]
        0x0800159e:    b008        ..      ADD      sp,sp,#0x20
        0x080015a0:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x080015a4:    6841        Ah      LDR      r1,[r0,#4]
        0x080015a6:    1c4a        J.      ADDS     r2,r1,#1
        0x080015a8:    6042        B`      STR      r2,[r0,#4]
        0x080015aa:    2964        d)      CMP      r1,#0x64
        0x080015ac:    bf9c        ..      ITT      LS
        0x080015ae:    b008        ..      ADDLS    sp,sp,#0x20
        0x080015b0:    e8bd87f0    ....    POPLS    {r4-r10,pc}
        0x080015b4:    2000        .       MOVS     r0,#0
        0x080015b6:    f001f859    ..Y.    BL       Hardware_SetPulseCounter ; 0x800266c
        0x080015ba:    6828        (h      LDR      r0,[r5,#0]
        0x080015bc:    2102        .!      MOVS     r1,#2
        0x080015be:    f8c09004    ....    STR      r9,[r0,#4]
        0x080015c2:    7441        At      STRB     r1,[r0,#0x11]
        0x080015c4:    b008        ..      ADD      sp,sp,#0x20
        0x080015c6:    e8bd87f0    ....    POP      {r4-r10,pc}
    $d
        0x080015ca:    0000        ..      DCW    0
        0x080015cc:    20000060    `..     DCD    536871008
        0x080015d0:    200000a4    ...     DCD    536871076
        0x080015d4:    20000098    ...     DCD    536871064
        0x080015d8:    2000008c    ...     DCD    536871052
        0x080015dc:    20000094    ...     DCD    536871060
        0x080015e0:    200000a8    ...     DCD    536871080
        0x080015e4:    200000b4    ...     DCD    536871092
        0x080015e8:    20000090    ...     DCD    536871056
        0x080015ec:    200000ac    ...     DCD    536871084
        0x080015f0:    00000000    ....    DCD    0
        0x080015f4:    200000b8    ...     DCD    536871096
    $t
    i.FOC_Method_ParIdentify
    FOC_Method_ParIdentify
        0x080015f8:    b5f0        ..      PUSH     {r4-r7,lr}
        0x080015fa:    4d4e        NM      LDR      r5,[pc,#312] ; [0x8001734] = 0x20000060
        0x080015fc:    4e4e        NN      LDR      r6,[pc,#312] ; [0x8001738] = 0x2000008c
        0x080015fe:    4c4f        OL      LDR      r4,[pc,#316] ; [0x800173c] = 0x20000098
        0x08001600:    6828        (h      LDR      r0,[r5,#0]
        0x08001602:    b083        ..      SUB      sp,sp,#0xc
        0x08001604:    2700        .'      MOVS     r7,#0
        0x08001606:    7c41        A|      LDRB     r1,[r0,#0x11]
        0x08001608:    b1f1        ..      CBZ      r1,0x8001648 ; FOC_Method_ParIdentify + 80
        0x0800160a:    2901        .)      CMP      r1,#1
        0x0800160c:    d068        h.      BEQ      0x80016e0 ; FOC_Method_ParIdentify + 232
        0x0800160e:    2902        .)      CMP      r1,#2
        0x08001610:    bf1c        ..      ITT      NE
        0x08001612:    b003        ..      ADDNE    sp,sp,#0xc
        0x08001614:    bdf0        ..      POPNE    {r4-r7,pc}
        0x08001616:    6820         h      LDR      r0,[r4,#0]
        0x08001618:    303c        <0      ADDS     r0,r0,#0x3c
        0x0800161a:    f7feff59    ..Y.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x0800161e:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08001622:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08001626:    6820         h      LDR      r0,[r4,#0]
        0x08001628:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x0800162c:    4668        hF      MOV      r0,sp
        0x0800162e:    f7feff99    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08001632:    6822        "h      LDR      r2,[r4,#0]
        0x08001634:    4942        BI      LDR      r1,[pc,#264] ; [0x8001740] = 0x20000050
        0x08001636:    ed820a11    ....    VSTR     s0,[r2,#0x44]
        0x0800163a:    edc20a12    ....    VSTR     s1,[r2,#0x48]
        0x0800163e:    6828        (h      LDR      r0,[r5,#0]
        0x08001640:    6843        Ch      LDR      r3,[r0,#4]
        0x08001642:    2b19        .+      CMP      r3,#0x19
        0x08001644:    d15d        ].      BNE      0x8001702 ; FOC_Method_ParIdentify + 266
        0x08001646:    e055        U.      B        0x80016f4 ; FOC_Method_ParIdentify + 252
        0x08001648:    6841        Ah      LDR      r1,[r0,#4]
        0x0800164a:    ed9f0a3e    ..>.    VLDR     s0,[pc,#248] ; [0x8001744] = 0
        0x0800164e:    1c4a        J.      ADDS     r2,r1,#1
        0x08001650:    6042        B`      STR      r2,[r0,#4]
        0x08001652:    f5b16ffa    ...o    CMP      r1,#0x7d0
        0x08001656:    d236        6.      BCS      0x80016c6 ; FOC_Method_ParIdentify + 206
        0x08001658:    4d3b        ;M      LDR      r5,[pc,#236] ; [0x8001748] = 0x200000a4
        0x0800165a:    4f3c        <O      LDR      r7,[pc,#240] ; [0x800174c] = 0x200000a8
        0x0800165c:    eef10a00    ....    VMOV.F32 s1,#4.00000000
        0x08001660:    6828        (h      LDR      r0,[r5,#0]
        0x08001662:    edc00a00    ....    VSTR     s1,[r0,#0]
        0x08001666:    6838        8h      LDR      r0,[r7,#0]
        0x08001668:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x0800166c:    f000fed0    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08001670:    6820         h      LDR      r0,[r4,#0]
        0x08001672:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08001676:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x0800167a:    303c        <0      ADDS     r0,r0,#0x3c
        0x0800167c:    f7feff28    ..(.    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08001680:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08001684:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08001688:    6820         h      LDR      r0,[r4,#0]
        0x0800168a:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x0800168e:    4668        hF      MOV      r0,sp
        0x08001690:    f7feff68    ..h.    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08001694:    6820         h      LDR      r0,[r4,#0]
        0x08001696:    ed800a11    ....    VSTR     s0,[r0,#0x44]
        0x0800169a:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x0800169e:    6828        (h      LDR      r0,[r5,#0]
        0x080016a0:    f001f86e    ..n.    BL       IdCurrentPIController ; 0x8002780
        0x080016a4:    6820         h      LDR      r0,[r4,#0]
        0x080016a6:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x080016aa:    ed900a12    ....    VLDR     s0,[r0,#0x48]
        0x080016ae:    eef01a60    ..`.    VMOV.F32 s3,s1
        0x080016b2:    6838        8h      LDR      r0,[r7,#0]
        0x080016b4:    f001f96c    ..l.    BL       IqCurrentPIController ; 0x8002990
        0x080016b8:    6830        0h      LDR      r0,[r6,#0]
        0x080016ba:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080016be:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080016c2:    b003        ..      ADD      sp,sp,#0xc
        0x080016c4:    bdf0        ..      POP      {r4-r7,pc}
        0x080016c6:    6830        0h      LDR      r0,[r6,#0]
        0x080016c8:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x080016cc:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080016d0:    f007f926    ..&.    BL       reset_CurrentPICHandler ; 0x8008920
        0x080016d4:    6828        (h      LDR      r0,[r5,#0]
        0x080016d6:    2101        .!      MOVS     r1,#1
        0x080016d8:    6047        G`      STR      r7,[r0,#4]
        0x080016da:    7441        At      STRB     r1,[r0,#0x11]
        0x080016dc:    b003        ..      ADD      sp,sp,#0xc
        0x080016de:    bdf0        ..      POP      {r4-r7,pc}
        0x080016e0:    6841        Ah      LDR      r1,[r0,#4]
        0x080016e2:    1c4a        J.      ADDS     r2,r1,#1
        0x080016e4:    6042        B`      STR      r2,[r0,#4]
        0x080016e6:    2964        d)      CMP      r1,#0x64
        0x080016e8:    bf87        ..      ITTEE    HI
        0x080016ea:    6047        G`      STRHI    r7,[r0,#4]
        0x080016ec:    2102        .!      MOVHI    r1,#2
        0x080016ee:    b003        ..      ADDLS    sp,sp,#0xc
        0x080016f0:    bdf0        ..      POPLS    {r4-r7,pc}
        0x080016f2:    e7f2        ..      B        0x80016da ; FOC_Method_ParIdentify + 226
        0x080016f4:    6047        G`      STR      r7,[r0,#4]
        0x080016f6:    ed910a01    ....    VLDR     s0,[r1,#4]
        0x080016fa:    eeb10a40    ..@.    VNEG.F32 s0,s0
        0x080016fe:    ed810a01    ....    VSTR     s0,[r1,#4]
        0x08001702:    6843        Ch      LDR      r3,[r0,#4]
        0x08001704:    1c5b        [.      ADDS     r3,r3,#1
        0x08001706:    6043        C`      STR      r3,[r0,#4]
        0x08001708:    4811        .H      LDR      r0,[pc,#68] ; [0x8001750] = 0x200000b0
        0x0800170a:    2b01        .+      CMP      r3,#1
        0x0800170c:    d10b        ..      BNE      0x8001726 ; FOC_Method_ParIdentify + 302
        0x0800170e:    6803        .h      LDR      r3,[r0,#0]
        0x08001710:    ed911a01    ....    VLDR     s2,[r1,#4]
        0x08001714:    ed9f0a0f    ....    VLDR     s0,[pc,#60] ; [0x8001754] = 0x3e4ccccd
        0x08001718:    edd30a01    ....    VLDR     s1,[r3,#4]
        0x0800171c:    6831        1h      LDR      r1,[r6,#0]
        0x0800171e:    ee000ac1    ....    VMLS.F32 s0,s1,s2
        0x08001722:    ed810a02    ....    VSTR     s0,[r1,#8]
        0x08001726:    ed920a11    ....    VLDR     s0,[r2,#0x44]
        0x0800172a:    6800        .h      LDR      r0,[r0,#0]
        0x0800172c:    f002f866    ..f.    BL       MCParIdentify_Rs_Ls ; 0x80037fc
        0x08001730:    b003        ..      ADD      sp,sp,#0xc
        0x08001732:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x08001734:    20000060    `..     DCD    536871008
        0x08001738:    2000008c    ...     DCD    536871052
        0x0800173c:    20000098    ...     DCD    536871064
        0x08001740:    20000050    P..     DCD    536870992
        0x08001744:    00000000    ....    DCD    0
        0x08001748:    200000a4    ...     DCD    536871076
        0x0800174c:    200000a8    ...     DCD    536871080
        0x08001750:    200000b0    ...     DCD    536871088
        0x08001754:    3e4ccccd    ..L>    DCD    1045220557
    $t
    i.FastReciprocalSquareRoot
    FastReciprocalSquareRoot
        0x08001758:    f000bd9c    ....    B.W      Hardware_FastReciprocalSquareRoot ; 0x8002294
    i.FastSquareRoot
    FastSquareRoot
        0x0800175c:    f000bdb0    ....    B.W      Hardware_FastSquareRoot ; 0x80022c0
    i.HAL_IncTick
    HAL_IncTick
        0x08001760:    4802        .H      LDR      r0,[pc,#8] ; [0x800176c] = 0x200000e0
        0x08001762:    6881        .h      LDR      r1,[r0,#8]
        0x08001764:    6842        Bh      LDR      r2,[r0,#4]
        0x08001766:    4411        .D      ADD      r1,r1,r2
        0x08001768:    6081        .`      STR      r1,[r0,#8]
        0x0800176a:    4770        pG      BX       lr
    $d
        0x0800176c:    200000e0    ...     DCD    536871136
    $t
    i.HAL_Init
    HAL_Init
        0x08001770:    b510        ..      PUSH     {r4,lr}
        0x08001772:    2400        .$      MOVS     r4,#0
        0x08001774:    2003        .       MOVS     r0,#3
        0x08001776:    f000f88d    ....    BL       HAL_NVIC_SetPriorityGrouping ; 0x8001894
        0x0800177a:    2006        .       MOVS     r0,#6
        0x0800177c:    f000f808    ....    BL       HAL_InitTick ; 0x8001790
        0x08001780:    2800        .(      CMP      r0,#0
        0x08001782:    bf14        ..      ITE      NE
        0x08001784:    2401        .$      MOVNE    r4,#1
        0x08001786:    f000f825    ..%.    BLEQ     HAL_MspInit ; 0x80017d4
        0x0800178a:    4620         F      MOV      r0,r4
        0x0800178c:    bd10        ..      POP      {r4,pc}
        0x0800178e:    0000        ..      MOVS     r0,r0
    i.HAL_InitTick
    HAL_InitTick
        0x08001790:    b570        p.      PUSH     {r4-r6,lr}
        0x08001792:    4e0e        .N      LDR      r6,[pc,#56] ; [0x80017cc] = 0x200000e0
        0x08001794:    4605        .F      MOV      r5,r0
        0x08001796:    2400        .$      MOVS     r4,#0
        0x08001798:    6870        ph      LDR      r0,[r6,#4]
        0x0800179a:    b198        ..      CBZ      r0,0x80017c4 ; HAL_InitTick + 52
        0x0800179c:    f44f717a    O.zq    MOV      r1,#0x3e8
        0x080017a0:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x080017a4:    490a        .I      LDR      r1,[pc,#40] ; [0x80017d0] = 0x20000004
        0x080017a6:    6809        .h      LDR      r1,[r1,#0]
        0x080017a8:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x080017ac:    f000fb8c    ....    BL       HAL_SYSTICK_Config ; 0x8001ec8
        0x080017b0:    b940        @.      CBNZ     r0,0x80017c4 ; HAL_InitTick + 52
        0x080017b2:    2d10        .-      CMP      r5,#0x10
        0x080017b4:    d206        ..      BCS      0x80017c4 ; HAL_InitTick + 52
        0x080017b6:    2200        ."      MOVS     r2,#0
        0x080017b8:    4629        )F      MOV      r1,r5
        0x080017ba:    1e50        P.      SUBS     r0,r2,#1
        0x080017bc:    f000f838    ..8.    BL       HAL_NVIC_SetPriority ; 0x8001830
        0x080017c0:    6035        5`      STR      r5,[r6,#0]
        0x080017c2:    e000        ..      B        0x80017c6 ; HAL_InitTick + 54
        0x080017c4:    2401        .$      MOVS     r4,#1
        0x080017c6:    4620         F      MOV      r0,r4
        0x080017c8:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x080017ca:    0000        ..      DCW    0
        0x080017cc:    200000e0    ...     DCD    536871136
        0x080017d0:    20000004    ...     DCD    536870916
    $t
    i.HAL_MspInit
    HAL_MspInit
        0x080017d4:    480d        .H      LDR      r0,[pc,#52] ; [0x800180c] = 0x40021000
        0x080017d6:    b508        ..      PUSH     {r3,lr}
        0x080017d8:    6e01        .n      LDR      r1,[r0,#0x60]
        0x080017da:    f0410101    A...    ORR      r1,r1,#1
        0x080017de:    6601        .f      STR      r1,[r0,#0x60]
        0x080017e0:    6e01        .n      LDR      r1,[r0,#0x60]
        0x080017e2:    f0010101    ....    AND      r1,r1,#1
        0x080017e6:    9100        ..      STR      r1,[sp,#0]
        0x080017e8:    6d81        .m      LDR      r1,[r0,#0x58]
        0x080017ea:    f0415180    A..Q    ORR      r1,r1,#0x10000000
        0x080017ee:    6581        .e      STR      r1,[r0,#0x58]
        0x080017f0:    6d80        .m      LDR      r0,[r0,#0x58]
        0x080017f2:    f0005080    ...P    AND      r0,r0,#0x10000000
        0x080017f6:    9000        ..      STR      r0,[sp,#0]
        0x080017f8:    f000fb54    ..T.    BL       HAL_SYSCFG_DisableVREFBUF ; 0x8001ea4
        0x080017fc:    2002        .       MOVS     r0,#2
        0x080017fe:    f000fb59    ..Y.    BL       HAL_SYSCFG_VREFBUF_HighImpedanceConfig ; 0x8001eb4
        0x08001802:    e8bd4008    ...@    POP      {r3,lr}
        0x08001806:    f000bb45    ..E.    B.W      HAL_PWREx_DisableUCPDDeadBattery ; 0x8001e94
    $d
        0x0800180a:    0000        ..      DCW    0
        0x0800180c:    40021000    ...@    DCD    1073876992
    $t
    i.HAL_NVIC_EnableIRQ
    HAL_NVIC_EnableIRQ
        0x08001810:    2800        .(      CMP      r0,#0
        0x08001812:    bfb8        ..      IT       LT
        0x08001814:    4770        pG      BXLT     lr
        0x08001816:    f000011f    ....    AND      r1,r0,#0x1f
        0x0800181a:    2201        ."      MOVS     r2,#1
        0x0800181c:    fa02f101    ....    LSL      r1,r2,r1
        0x08001820:    0940        @.      LSRS     r0,r0,#5
        0x08001822:    0080        ..      LSLS     r0,r0,#2
        0x08001824:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x08001828:    f8c01100    ....    STR      r1,[r0,#0x100]
        0x0800182c:    4770        pG      BX       lr
        0x0800182e:    0000        ..      MOVS     r0,r0
    i.HAL_NVIC_SetPriority
    HAL_NVIC_SetPriority
        0x08001830:    4b17        .K      LDR      r3,[pc,#92] ; [0x8001890] = 0xe000ed0c
        0x08001832:    b410        ..      PUSH     {r4}
        0x08001834:    681b        .h      LDR      r3,[r3,#0]
        0x08001836:    f3c32302    ...#    UBFX     r3,r3,#8,#3
        0x0800183a:    f1c30c07    ....    RSB      r12,r3,#7
        0x0800183e:    f1bc0f04    ....    CMP      r12,#4
        0x08001842:    bf88        ..      IT       HI
        0x08001844:    f04f0c04    O...    MOVHI    r12,#4
        0x08001848:    1d1c        ..      ADDS     r4,r3,#4
        0x0800184a:    2c07        .,      CMP      r4,#7
        0x0800184c:    bf34        4.      ITE      CC
        0x0800184e:    2300        .#      MOVCC    r3,#0
        0x08001850:    1edb        ..      SUBCS    r3,r3,#3
        0x08001852:    2401        .$      MOVS     r4,#1
        0x08001854:    fa04fc0c    ....    LSL      r12,r4,r12
        0x08001858:    f1ac0c01    ....    SUB      r12,r12,#1
        0x0800185c:    ea0c0101    ....    AND      r1,r12,r1
        0x08001860:    4099        .@      LSLS     r1,r1,r3
        0x08001862:    fa04f303    ....    LSL      r3,r4,r3
        0x08001866:    1e5b        [.      SUBS     r3,r3,#1
        0x08001868:    401a        .@      ANDS     r2,r2,r3
        0x0800186a:    4311        .C      ORRS     r1,r1,r2
        0x0800186c:    2800        .(      CMP      r0,#0
        0x0800186e:    ea4f1101    O...    LSL      r1,r1,#4
        0x08001872:    bfa1        ..      ITTTT    GE
        0x08001874:    f10020e0    ...     ADDGE    r0,r0,#0xe000e000
        0x08001878:    f8801400    ....    STRBGE   r1,[r0,#0x400]
        0x0800187c:    bc10        ..      POPGE    {r4}
        0x0800187e:    4770        pG      BXGE     lr
        0x08001880:    f000000f    ....    AND      r0,r0,#0xf
        0x08001884:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x08001888:    f8801d14    ....    STRB     r1,[r0,#0xd14]
        0x0800188c:    bc10        ..      POP      {r4}
