ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800188e:    4770        pG      BX       lr
    $d
        0x08001890:    e000ed0c    ....    DCD    3758157068
    $t
    i.HAL_NVIC_SetPriorityGrouping
    HAL_NVIC_SetPriorityGrouping
        0x08001894:    4907        .I      LDR      r1,[pc,#28] ; [0x80018b4] = 0xe000ed0c
        0x08001896:    f0000007    ....    AND      r0,r0,#7
        0x0800189a:    680a        .h      LDR      r2,[r1,#0]
        0x0800189c:    f64f03ff    O...    MOV      r3,#0xf8ff
        0x080018a0:    401a        .@      ANDS     r2,r2,r3
        0x080018a2:    ea422000    B..     ORR      r0,r2,r0,LSL #8
        0x080018a6:    f04070fd    @..p    ORR      r0,r0,#0x1fa0000
        0x080018aa:    f0406080    @..`    ORR      r0,r0,#0x4000000
        0x080018ae:    6008        .`      STR      r0,[r1,#0]
        0x080018b0:    4770        pG      BX       lr
    $d
        0x080018b2:    0000        ..      DCW    0
        0x080018b4:    e000ed0c    ....    DCD    3758157068
    $t
    i.HAL_PCDEx_ActivateLPM
    HAL_PCDEx_ActivateLPM
        0x080018b8:    2201        ."      MOVS     r2,#1
        0x080018ba:    6801        .h      LDR      r1,[r0,#0]
        0x080018bc:    f8c022d0    ..."    STR      r2,[r0,#0x2d0]
        0x080018c0:    2200        ."      MOVS     r2,#0
        0x080018c2:    f88022c8    ..."    STRB     r2,[r0,#0x2c8]
        0x080018c6:    f8b10054    ..T.    LDRH     r0,[r1,#0x54]
        0x080018ca:    f0400001    @...    ORR      r0,r0,#1
        0x080018ce:    f8a10054    ..T.    STRH     r0,[r1,#0x54]
        0x080018d2:    f8b10054    ..T.    LDRH     r0,[r1,#0x54]
        0x080018d6:    f0400002    @...    ORR      r0,r0,#2
        0x080018da:    f8a10054    ..T.    STRH     r0,[r1,#0x54]
        0x080018de:    4610        .F      MOV      r0,r2
        0x080018e0:    4770        pG      BX       lr
        0x080018e2:    0000        ..      MOVS     r0,r0
    i.HAL_PCDEx_LPM_Callback
    HAL_PCDEx_LPM_Callback
        0x080018e4:    b570        p.      PUSH     {r4-r6,lr}
        0x080018e6:    4d10        .M      LDR      r5,[pc,#64] ; [0x8001928] = 0xe000ed10
        0x080018e8:    4604        .F      MOV      r4,r0
        0x080018ea:    b179        y.      CBZ      r1,0x800190c ; HAL_PCDEx_LPM_Callback + 40
        0x080018ec:    2901        .)      CMP      r1,#1
        0x080018ee:    bf18        ..      IT       NE
        0x080018f0:    bd70        p.      POPNE    {r4-r6,pc}
        0x080018f2:    f8d402d8    ....    LDR      r0,[r4,#0x2d8]
        0x080018f6:    f004f982    ....    BL       USBD_LL_Suspend ; 0x8005bfe
        0x080018fa:    7a60        `z      LDRB     r0,[r4,#9]
        0x080018fc:    2800        .(      CMP      r0,#0
        0x080018fe:    bf08        ..      IT       EQ
        0x08001900:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08001902:    6828        (h      LDR      r0,[r5,#0]
        0x08001904:    f0400006    @...    ORR      r0,r0,#6
        0x08001908:    6028        (`      STR      r0,[r5,#0]
        0x0800190a:    bd70        p.      POP      {r4-r6,pc}
        0x0800190c:    7a60        `z      LDRB     r0,[r4,#9]
        0x0800190e:    b128        (.      CBZ      r0,0x800191c ; HAL_PCDEx_LPM_Callback + 56
        0x08001910:    f003fc0e    ....    BL       SystemClock_Config ; 0x8005130
        0x08001914:    6828        (h      LDR      r0,[r5,#0]
        0x08001916:    f0200006     ...    BIC      r0,r0,#6
        0x0800191a:    6028        (`      STR      r0,[r5,#0]
        0x0800191c:    f8d402d8    ....    LDR      r0,[r4,#0x2d8]
        0x08001920:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08001924:    f004b8e5    ....    B.W      USBD_LL_Resume ; 0x8005af2
    $d
        0x08001928:    e000ed10    ....    DCD    3758157072
    $t
    i.HAL_PCDEx_PMAConfig
    HAL_PCDEx_PMAConfig
        0x0800192c:    f0110f80    ....    TST      r1,#0x80
        0x08001930:    bf18        ..      IT       NE
        0x08001932:    f0010107    ....    ANDNE    r1,r1,#7
        0x08001936:    eb010181    ....    ADD      r1,r1,r1,LSL #2
        0x0800193a:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x0800193e:    bf14        ..      ITE      NE
        0x08001940:    3010        .0      ADDNE    r0,r0,#0x10
        0x08001942:    f50070a8    ...p    ADDEQ    r0,r0,#0x150
        0x08001946:    b299        ..      UXTH     r1,r3
        0x08001948:    b132        2.      CBZ      r2,0x8001958 ; HAL_PCDEx_PMAConfig + 44
        0x0800194a:    2201        ."      MOVS     r2,#1
        0x0800194c:    7302        .s      STRB     r2,[r0,#0xc]
        0x0800194e:    8101        ..      STRH     r1,[r0,#8]
        0x08001950:    0c19        ..      LSRS     r1,r3,#16
        0x08001952:    8141        A.      STRH     r1,[r0,#0xa]
        0x08001954:    2000        .       MOVS     r0,#0
        0x08001956:    4770        pG      BX       lr
        0x08001958:    2200        ."      MOVS     r2,#0
        0x0800195a:    7302        .s      STRB     r2,[r0,#0xc]
        0x0800195c:    80c1        ..      STRH     r1,[r0,#6]
        0x0800195e:    e7f9        ..      B        0x8001954 ; HAL_PCDEx_PMAConfig + 40
    i.HAL_PCD_DataInStageCallback
    HAL_PCD_DataInStageCallback
        0x08001960:    eb010281    ....    ADD      r2,r1,r1,LSL #2
        0x08001964:    eb0002c2    ....    ADD      r2,r0,r2,LSL #3
        0x08001968:    f8d002d8    ....    LDR      r0,[r0,#0x2d8]
        0x0800196c:    6a52        Rj      LDR      r2,[r2,#0x24]
        0x0800196e:    f003bf7a    ..z.    B.W      USBD_LL_DataInStage ; 0x8005866
    i.HAL_PCD_DataOutStageCallback
    HAL_PCD_DataOutStageCallback
        0x08001972:    eb010281    ....    ADD      r2,r1,r1,LSL #2
        0x08001976:    eb0002c2    ....    ADD      r2,r0,r2,LSL #3
        0x0800197a:    f8d002d8    ....    LDR      r0,[r0,#0x2d8]
        0x0800197e:    f8d22164    ..d!    LDR      r2,[r2,#0x164]
        0x08001982:    f003bfcc    ....    B.W      USBD_LL_DataOutStage ; 0x800591e
    i.HAL_PCD_EP_Close
    HAL_PCD_EP_Close
        0x08001986:    b570        p.      PUSH     {r4-r6,lr}
        0x08001988:    4604        .F      MOV      r4,r0
        0x0800198a:    f0010207    ....    AND      r2,r1,#7
        0x0800198e:    eb020082    ....    ADD      r0,r2,r2,LSL #2
        0x08001992:    f0110f80    ....    TST      r1,#0x80
        0x08001996:    eb0400c0    ....    ADD      r0,r4,r0,LSL #3
        0x0800199a:    f04f0301    O...    MOV      r3,#1
        0x0800199e:    f04f0500    O...    MOV      r5,#0
        0x080019a2:    bf19        ..      ITTEE    NE
        0x080019a4:    f1000110    ....    ADDNE    r1,r0,#0x10
        0x080019a8:    7443        Ct      STRBNE   r3,[r0,#0x11]
        0x080019aa:    f50071a8    ...q    ADDEQ    r1,r0,#0x150
        0x080019ae:    f8805151    ..QQ    STRBEQ   r5,[r0,#0x151]
        0x080019b2:    700a        .p      STRB     r2,[r1,#0]
        0x080019b4:    f8940290    ....    LDRB     r0,[r4,#0x290]
        0x080019b8:    2801        .(      CMP      r0,#1
        0x080019ba:    bf04        ..      ITT      EQ
        0x080019bc:    2002        .       MOVEQ    r0,#2
        0x080019be:    bd70        p.      POPEQ    {r4-r6,pc}
        0x080019c0:    f8843290    ...2    STRB     r3,[r4,#0x290]
        0x080019c4:    6820         h      LDR      r0,[r4,#0]
        0x080019c6:    f004fd4b    ..K.    BL       USB_DeactivateEndpoint ; 0x8006460
        0x080019ca:    f8845290    ...R    STRB     r5,[r4,#0x290]
        0x080019ce:    2000        .       MOVS     r0,#0
        0x080019d0:    bd70        p.      POP      {r4-r6,pc}
    i.HAL_PCD_EP_ClrStall
    HAL_PCD_EP_ClrStall
        0x080019d2:    b570        p.      PUSH     {r4-r6,lr}
        0x080019d4:    4604        .F      MOV      r4,r0
        0x080019d6:    f001000f    ....    AND      r0,r1,#0xf
        0x080019da:    7922        "y      LDRB     r2,[r4,#4]
        0x080019dc:    4290        .B      CMP      r0,r2
        0x080019de:    bf84        ..      ITT      HI
        0x080019e0:    2001        .       MOVHI    r0,#1
        0x080019e2:    bd70        p.      POPHI    {r4-r6,pc}
        0x080019e4:    f0110f80    ....    TST      r1,#0x80
        0x080019e8:    f0010207    ....    AND      r2,r1,#7
        0x080019ec:    eb020082    ....    ADD      r0,r2,r2,LSL #2
        0x080019f0:    eb0400c0    ....    ADD      r0,r4,r0,LSL #3
        0x080019f4:    f04f0301    O...    MOV      r3,#1
        0x080019f8:    f04f0500    O...    MOV      r5,#0
        0x080019fc:    bf19        ..      ITTEE    NE
        0x080019fe:    f1000110    ....    ADDNE    r1,r0,#0x10
        0x08001a02:    7443        Ct      STRBNE   r3,[r0,#0x11]
        0x08001a04:    f50071a8    ...q    ADDEQ    r1,r0,#0x150
        0x08001a08:    f8805151    ..QQ    STRBEQ   r5,[r0,#0x151]
        0x08001a0c:    708d        .p      STRB     r5,[r1,#2]
        0x08001a0e:    700a        .p      STRB     r2,[r1,#0]
        0x08001a10:    f8940290    ....    LDRB     r0,[r4,#0x290]
        0x08001a14:    2801        .(      CMP      r0,#1
        0x08001a16:    bf04        ..      ITT      EQ
        0x08001a18:    2002        .       MOVEQ    r0,#2
        0x08001a1a:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08001a1c:    f8843290    ...2    STRB     r3,[r4,#0x290]
        0x08001a20:    6820         h      LDR      r0,[r4,#0]
        0x08001a22:    f004fdf0    ....    BL       USB_EPClearStall ; 0x8006606
        0x08001a26:    f8845290    ...R    STRB     r5,[r4,#0x290]
        0x08001a2a:    2000        .       MOVS     r0,#0
        0x08001a2c:    bd70        p.      POP      {r4-r6,pc}
    i.HAL_PCD_EP_GetRxCount
    HAL_PCD_EP_GetRxCount
        0x08001a2e:    f0010107    ....    AND      r1,r1,#7
        0x08001a32:    eb010181    ....    ADD      r1,r1,r1,LSL #2
        0x08001a36:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08001a3a:    f8d0016c    ..l.    LDR      r0,[r0,#0x16c]
        0x08001a3e:    4770        pG      BX       lr
    i.HAL_PCD_EP_Open
    HAL_PCD_EP_Open
        0x08001a40:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001a44:    4604        .F      MOV      r4,r0
        0x08001a46:    f0010c07    ....    AND      r12,r1,#7
        0x08001a4a:    eb0c008c    ....    ADD      r0,r12,r12,LSL #2
        0x08001a4e:    f0110f80    ....    TST      r1,#0x80
        0x08001a52:    eb0400c0    ....    ADD      r0,r4,r0,LSL #3
        0x08001a56:    f04f0601    O...    MOV      r6,#1
        0x08001a5a:    f04f0500    O...    MOV      r5,#0
        0x08001a5e:    bf19        ..      ITTEE    NE
        0x08001a60:    f1000110    ....    ADDNE    r1,r0,#0x10
        0x08001a64:    7446        Ft      STRBNE   r6,[r0,#0x11]
        0x08001a66:    f50071a8    ...q    ADDEQ    r1,r0,#0x150
        0x08001a6a:    f8805151    ..QQ    STRBEQ   r5,[r0,#0x151]
        0x08001a6e:    f881c000    ....    STRB     r12,[r1,#0]
        0x08001a72:    610a        .a      STR      r2,[r1,#0x10]
        0x08001a74:    70cb        .p      STRB     r3,[r1,#3]
        0x08001a76:    2b02        .+      CMP      r3,#2
        0x08001a78:    bf08        ..      IT       EQ
        0x08001a7a:    710d        .q      STRBEQ   r5,[r1,#4]
        0x08001a7c:    f8940290    ....    LDRB     r0,[r4,#0x290]
        0x08001a80:    2801        .(      CMP      r0,#1
        0x08001a82:    bf04        ..      ITT      EQ
        0x08001a84:    2002        .       MOVEQ    r0,#2
        0x08001a86:    e8bd81f0    ....    POPEQ    {r4-r8,pc}
        0x08001a8a:    f8846290    ...b    STRB     r6,[r4,#0x290]
        0x08001a8e:    6820         h      LDR      r0,[r4,#0]
        0x08001a90:    f004fb6a    ..j.    BL       USB_ActivateEndpoint ; 0x8006168
        0x08001a94:    4628        (F      MOV      r0,r5
        0x08001a96:    f8845290    ...R    STRB     r5,[r4,#0x290]
        0x08001a9a:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.HAL_PCD_EP_Receive
    HAL_PCD_EP_Receive
        0x08001a9e:    f0010c07    ....    AND      r12,r1,#7
        0x08001aa2:    eb0c018c    ....    ADD      r1,r12,r12,LSL #2
        0x08001aa6:    b510        ..      PUSH     {r4,lr}
        0x08001aa8:    eb0001c1    ....    ADD      r1,r0,r1,LSL #3
        0x08001aac:    e9c12359    ..Y#    STRD     r2,r3,[r1,#0x164]
        0x08001ab0:    2200        ."      MOVS     r2,#0
        0x08001ab2:    f8c1216c    ..l!    STR      r2,[r1,#0x16c]
        0x08001ab6:    f8812151    ..Q!    STRB     r2,[r1,#0x151]
        0x08001aba:    f881c150    ..P.    STRB     r12,[r1,#0x150]
        0x08001abe:    6800        .h      LDR      r0,[r0,#0]
        0x08001ac0:    f50171a8    ...q    ADD      r1,r1,#0x150
        0x08001ac4:    f004fe02    ....    BL       USB_EPStartXfer ; 0x80066cc
        0x08001ac8:    2000        .       MOVS     r0,#0
        0x08001aca:    bd10        ..      POP      {r4,pc}
    i.HAL_PCD_EP_SetStall
    HAL_PCD_EP_SetStall
        0x08001acc:    b570        p.      PUSH     {r4-r6,lr}
        0x08001ace:    4604        .F      MOV      r4,r0
        0x08001ad0:    7900        .y      LDRB     r0,[r0,#4]
        0x08001ad2:    f0010207    ....    AND      r2,r1,#7
        0x08001ad6:    4282        .B      CMP      r2,r0
        0x08001ad8:    bf84        ..      ITT      HI
        0x08001ada:    2001        .       MOVHI    r0,#1
        0x08001adc:    bd70        p.      POPHI    {r4-r6,pc}
        0x08001ade:    f0110f80    ....    TST      r1,#0x80
        0x08001ae2:    f04f0500    O...    MOV      r5,#0
        0x08001ae6:    f04f0001    O...    MOV      r0,#1
        0x08001aea:    bf14        ..      ITE      NE
        0x08001aec:    eb020182    ....    ADDNE    r1,r2,r2,LSL #2
        0x08001af0:    eb010181    ....    ADDEQ    r1,r1,r1,LSL #2
        0x08001af4:    eb0401c1    ....    ADD      r1,r4,r1,LSL #3
        0x08001af8:    bf19        ..      ITTEE    NE
        0x08001afa:    7448        Ht      STRBNE   r0,[r1,#0x11]
        0x08001afc:    3110        .1      ADDNE    r1,r1,#0x10
        0x08001afe:    f8815151    ..QQ    STRBEQ   r5,[r1,#0x151]
        0x08001b02:    f50171a8    ...q    ADDEQ    r1,r1,#0x150
        0x08001b06:    7088        .p      STRB     r0,[r1,#2]
        0x08001b08:    700a        .p      STRB     r2,[r1,#0]
        0x08001b0a:    f8942290    ..."    LDRB     r2,[r4,#0x290]
        0x08001b0e:    2a01        .*      CMP      r2,#1
        0x08001b10:    bf04        ..      ITT      EQ
        0x08001b12:    2002        .       MOVEQ    r0,#2
        0x08001b14:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08001b16:    f8840290    ....    STRB     r0,[r4,#0x290]
        0x08001b1a:    6820         h      LDR      r0,[r4,#0]
        0x08001b1c:    f004fdbb    ....    BL       USB_EPSetStall ; 0x8006696
        0x08001b20:    f8845290    ...R    STRB     r5,[r4,#0x290]
        0x08001b24:    2000        .       MOVS     r0,#0
        0x08001b26:    bd70        p.      POP      {r4-r6,pc}
    i.HAL_PCD_EP_Transmit
    HAL_PCD_EP_Transmit
        0x08001b28:    f0010c07    ....    AND      r12,r1,#7
        0x08001b2c:    eb0c018c    ....    ADD      r1,r12,r12,LSL #2
        0x08001b30:    b510        ..      PUSH     {r4,lr}
        0x08001b32:    eb0001c1    ....    ADD      r1,r0,r1,LSL #3
        0x08001b36:    e9c12309    ...#    STRD     r2,r3,[r1,#0x24]
        0x08001b3a:    2201        ."      MOVS     r2,#1
        0x08001b3c:    f8812034    ..4     STRB     r2,[r1,#0x34]
        0x08001b40:    630b        .c      STR      r3,[r1,#0x30]
        0x08001b42:    2300        .#      MOVS     r3,#0
        0x08001b44:    62cb        .b      STR      r3,[r1,#0x2c]
        0x08001b46:    744a        Jt      STRB     r2,[r1,#0x11]
        0x08001b48:    f801cf10    ....    STRB     r12,[r1,#0x10]!
        0x08001b4c:    6800        .h      LDR      r0,[r0,#0]
        0x08001b4e:    f004fdbd    ....    BL       USB_EPStartXfer ; 0x80066cc
        0x08001b52:    2000        .       MOVS     r0,#0
        0x08001b54:    bd10        ..      POP      {r4,pc}
    i.HAL_PCD_IRQHandler
    HAL_PCD_IRQHandler
        0x08001b56:    b570        p.      PUSH     {r4-r6,lr}
        0x08001b58:    4604        .F      MOV      r4,r0
        0x08001b5a:    6800        .h      LDR      r0,[r0,#0]
        0x08001b5c:    f005f942    ..B.    BL       USB_ReadInterrupts ; 0x8006de4
        0x08001b60:    f4104f00    ...O    TST      r0,#0x8000
        0x08001b64:    d004        ..      BEQ      0x8001b70 ; HAL_PCD_IRQHandler + 26
        0x08001b66:    4620         F      MOV      r0,r4
        0x08001b68:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08001b6c:    f002bb5c    ..\.    B.W      PCD_EP_ISR_Handler ; 0x8004228
        0x08001b70:    f4106f80    ...o    TST      r0,#0x400
        0x08001b74:    f04f0500    O...    MOV      r5,#0
        0x08001b78:    f04f0601    O...    MOV      r6,#1
        0x08001b7c:    d018        ..      BEQ      0x8001bb0 ; HAL_PCD_IRQHandler + 90
        0x08001b7e:    6820         h      LDR      r0,[r4,#0]
        0x08001b80:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001b84:    f4216180    !..a    BIC      r1,r1,#0x400
        0x08001b88:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x08001b8c:    4620         F      MOV      r0,r4
        0x08001b8e:    f000f913    ....    BL       HAL_PCD_ResetCallback ; 0x8001db8
        0x08001b92:    f8940290    ....    LDRB     r0,[r4,#0x290]
        0x08001b96:    2100        .!      MOVS     r1,#0
        0x08001b98:    2801        .(      CMP      r0,#1
        0x08001b9a:    bf08        ..      IT       EQ
        0x08001b9c:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08001b9e:    f8846290    ...b    STRB     r6,[r4,#0x290]
        0x08001ba2:    7321        !s      STRB     r1,[r4,#0xc]
        0x08001ba4:    6820         h      LDR      r0,[r4,#0]
        0x08001ba6:    f005f936    ..6.    BL       USB_SetDevAddress ; 0x8006e16
        0x08001baa:    f8845290    ...R    STRB     r5,[r4,#0x290]
        0x08001bae:    bd70        p.      POP      {r4-r6,pc}
        0x08001bb0:    f4104f80    ...O    TST      r0,#0x4000
        0x08001bb4:    d005        ..      BEQ      0x8001bc2 ; HAL_PCD_IRQHandler + 108
        0x08001bb6:    6820         h      LDR      r0,[r4,#0]
        0x08001bb8:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001bbc:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x08001bc0:    e007        ..      B        0x8001bd2 ; HAL_PCD_IRQHandler + 124
        0x08001bc2:    f4105f00    ..._    TST      r0,#0x2000
        0x08001bc6:    d007        ..      BEQ      0x8001bd8 ; HAL_PCD_IRQHandler + 130
        0x08001bc8:    6820         h      LDR      r0,[r4,#0]
        0x08001bca:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001bce:    f4215100    !..Q    BIC      r1,r1,#0x2000
        0x08001bd2:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x08001bd6:    bd70        p.      POP      {r4-r6,pc}
        0x08001bd8:    f4105f80    ..._    TST      r0,#0x1000
        0x08001bdc:    d020         .      BEQ      0x8001c20 ; HAL_PCD_IRQHandler + 202
        0x08001bde:    6820         h      LDR      r0,[r4,#0]
        0x08001be0:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08001be4:    f0210104    !...    BIC      r1,r1,#4
        0x08001be8:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08001bec:    6820         h      LDR      r0,[r4,#0]
        0x08001bee:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08001bf2:    f0210108    !...    BIC      r1,r1,#8
        0x08001bf6:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08001bfa:    f89402c8    ....    LDRB     r0,[r4,#0x2c8]
        0x08001bfe:    2801        .(      CMP      r0,#1
        0x08001c00:    d105        ..      BNE      0x8001c0e ; HAL_PCD_IRQHandler + 184
        0x08001c02:    f88452c8    ...R    STRB     r5,[r4,#0x2c8]
        0x08001c06:    2100        .!      MOVS     r1,#0
        0x08001c08:    4620         F      MOV      r0,r4
        0x08001c0a:    f7fffe6b    ..k.    BL       HAL_PCDEx_LPM_Callback ; 0x80018e4
        0x08001c0e:    4620         F      MOV      r0,r4
        0x08001c10:    f000f8e6    ....    BL       HAL_PCD_ResumeCallback ; 0x8001de0
        0x08001c14:    6820         h      LDR      r0,[r4,#0]
        0x08001c16:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001c1a:    f4215180    !..Q    BIC      r1,r1,#0x1000
        0x08001c1e:    e7d8        ..      B        0x8001bd2 ; HAL_PCD_IRQHandler + 124
        0x08001c20:    f4106f00    ...o    TST      r0,#0x800
        0x08001c24:    d018        ..      BEQ      0x8001c58 ; HAL_PCD_IRQHandler + 258
        0x08001c26:    6820         h      LDR      r0,[r4,#0]
        0x08001c28:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08001c2c:    f0410108    A...    ORR      r1,r1,#8
        0x08001c30:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08001c34:    6820         h      LDR      r0,[r4,#0]
        0x08001c36:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001c3a:    f4216100    !..a    BIC      r1,r1,#0x800
        0x08001c3e:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x08001c42:    6820         h      LDR      r0,[r4,#0]
        0x08001c44:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08001c48:    f0410104    A...    ORR      r1,r1,#4
        0x08001c4c:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08001c50:    4620         F      MOV      r0,r4
        0x08001c52:    f000f90d    ....    BL       HAL_PCD_SuspendCallback ; 0x8001e70
        0x08001c56:    bd70        p.      POP      {r4-r6,pc}
        0x08001c58:    f0100f80    ....    TST      r0,#0x80
        0x08001c5c:    d02b        +.      BEQ      0x8001cb6 ; HAL_PCD_IRQHandler + 352
        0x08001c5e:    6820         h      LDR      r0,[r4,#0]
        0x08001c60:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001c64:    f0210180    !...    BIC      r1,r1,#0x80
        0x08001c68:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x08001c6c:    f89402c8    ....    LDRB     r0,[r4,#0x2c8]
        0x08001c70:    b118        ..      CBZ      r0,0x8001c7a ; HAL_PCD_IRQHandler + 292
        0x08001c72:    4620         F      MOV      r0,r4
        0x08001c74:    f000f8fc    ....    BL       HAL_PCD_SuspendCallback ; 0x8001e70
        0x08001c78:    bd70        p.      POP      {r4-r6,pc}
        0x08001c7a:    6820         h      LDR      r0,[r4,#0]
        0x08001c7c:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08001c80:    f0410104    A...    ORR      r1,r1,#4
        0x08001c84:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08001c88:    6820         h      LDR      r0,[r4,#0]
        0x08001c8a:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08001c8e:    f0410108    A...    ORR      r1,r1,#8
        0x08001c92:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08001c96:    f88462c8    ...b    STRB     r6,[r4,#0x2c8]
        0x08001c9a:    6820         h      LDR      r0,[r4,#0]
        0x08001c9c:    f8b00054    ..T.    LDRH     r0,[r0,#0x54]
        0x08001ca0:    213c        <!      MOVS     r1,#0x3c
        0x08001ca2:    ea010090    ....    AND      r0,r1,r0,LSR #2
        0x08001ca6:    f8c402cc    ....    STR      r0,[r4,#0x2cc]
        0x08001caa:    4620         F      MOV      r0,r4
        0x08001cac:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08001cb0:    2101        .!      MOVS     r1,#1
        0x08001cb2:    f7ffbe17    ....    B.W      HAL_PCDEx_LPM_Callback ; 0x80018e4
        0x08001cb6:    f4107f00    ....    TST      r0,#0x200
        0x08001cba:    d00a        ..      BEQ      0x8001cd2 ; HAL_PCD_IRQHandler + 380
