ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08001cbc:    6820         h      LDR      r0,[r4,#0]
        0x08001cbe:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001cc2:    f4217100    !..q    BIC      r1,r1,#0x200
        0x08001cc6:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x08001cca:    4620         F      MOV      r0,r4
        0x08001ccc:    f000f89c    ....    BL       HAL_PCD_SOFCallback ; 0x8001e08
        0x08001cd0:    bd70        p.      POP      {r4-r6,pc}
        0x08001cd2:    f4107f80    ....    TST      r0,#0x100
        0x08001cd6:    bf08        ..      IT       EQ
        0x08001cd8:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08001cda:    6820         h      LDR      r0,[r4,#0]
        0x08001cdc:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x08001ce0:    f4217180    !..q    BIC      r1,r1,#0x100
        0x08001ce4:    e775        u.      B        0x8001bd2 ; HAL_PCD_IRQHandler + 124
    i.HAL_PCD_Init
    HAL_PCD_Init
        0x08001ce6:    b570        p.      PUSH     {r4-r6,lr}
        0x08001ce8:    0005        ..      MOVS     r5,r0
        0x08001cea:    bf04        ..      ITT      EQ
        0x08001cec:    2001        .       MOVEQ    r0,#1
        0x08001cee:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08001cf0:    f8950291    ....    LDRB     r0,[r5,#0x291]
        0x08001cf4:    2400        .$      MOVS     r4,#0
        0x08001cf6:    b920         .      CBNZ     r0,0x8001d02 ; HAL_PCD_Init + 28
        0x08001cf8:    f8854290    ...B    STRB     r4,[r5,#0x290]
        0x08001cfc:    4628        (F      MOV      r0,r5
        0x08001cfe:    f000f837    ..7.    BL       HAL_PCD_MspInit ; 0x8001d70
        0x08001d02:    2003        .       MOVS     r0,#3
        0x08001d04:    f8850291    ....    STRB     r0,[r5,#0x291]
        0x08001d08:    6828        (h      LDR      r0,[r5,#0]
        0x08001d0a:    f004fc72    ..r.    BL       USB_DisableGlobalInt ; 0x80065f2
        0x08001d0e:    792a        *y      LDRB     r2,[r5,#4]
        0x08001d10:    2601        .&      MOVS     r6,#1
        0x08001d12:    2a00        .*      CMP      r2,#0
        0x08001d14:    bf18        ..      IT       NE
        0x08001d16:    2000        .       MOVNE    r0,#0
        0x08001d18:    d01a        ..      BEQ      0x8001d50 ; HAL_PCD_Init + 106
        0x08001d1a:    eb000180    ....    ADD      r1,r0,r0,LSL #2
        0x08001d1e:    eb0501c1    ....    ADD      r1,r5,r1,LSL #3
        0x08001d22:    744e        Nt      STRB     r6,[r1,#0x11]
        0x08001d24:    7408        .t      STRB     r0,[r1,#0x10]
        0x08001d26:    74cc        .t      STRB     r4,[r1,#0x13]
        0x08001d28:    620c        .b      STR      r4,[r1,#0x20]
        0x08001d2a:    624c        Lb      STR      r4,[r1,#0x24]
        0x08001d2c:    628c        .b      STR      r4,[r1,#0x28]
        0x08001d2e:    f8814151    ..QA    STRB     r4,[r1,#0x151]
        0x08001d32:    f8810150    ..P.    STRB     r0,[r1,#0x150]
        0x08001d36:    f8814153    ..SA    STRB     r4,[r1,#0x153]
        0x08001d3a:    f8c14160    ..`A    STR      r4,[r1,#0x160]
        0x08001d3e:    f8c14164    ..dA    STR      r4,[r1,#0x164]
        0x08001d42:    f8c14168    ..hA    STR      r4,[r1,#0x168]
        0x08001d46:    1e51        Q.      SUBS     r1,r2,#1
        0x08001d48:    1c40        @.      ADDS     r0,r0,#1
        0x08001d4a:    f01102ff    ....    ANDS     r2,r1,#0xff
        0x08001d4e:    d1e4        ..      BNE      0x8001d1a ; HAL_PCD_Init + 52
        0x08001d50:    e9d50100    ....    LDRD     r0,r1,[r5,#0]
        0x08001d54:    68aa        .h      LDR      r2,[r5,#8]
        0x08001d56:    f004fc40    ..@.    BL       USB_DevInit ; 0x80065da
        0x08001d5a:    732c        ,s      STRB     r4,[r5,#0xc]
        0x08001d5c:    f8856291    ...b    STRB     r6,[r5,#0x291]
        0x08001d60:    7aa8        .z      LDRB     r0,[r5,#0xa]
        0x08001d62:    2801        .(      CMP      r0,#1
        0x08001d64:    bf04        ..      ITT      EQ
        0x08001d66:    4628        (F      MOVEQ    r0,r5
        0x08001d68:    f7fffda6    ....    BLEQ     HAL_PCDEx_ActivateLPM ; 0x80018b8
        0x08001d6c:    2000        .       MOVS     r0,#0
        0x08001d6e:    bd70        p.      POP      {r4-r6,pc}
    i.HAL_PCD_MspInit
    HAL_PCD_MspInit
        0x08001d70:    b508        ..      PUSH     {r3,lr}
        0x08001d72:    6800        .h      LDR      r0,[r0,#0]
        0x08001d74:    f1a04180    ...A    SUB      r1,r0,#0x40000000
        0x08001d78:    f5b141b8    ...A    SUBS     r1,r1,#0x5c00
        0x08001d7c:    bf18        ..      IT       NE
        0x08001d7e:    bd08        ..      POPNE    {r3,pc}
        0x08001d80:    480c        .H      LDR      r0,[pc,#48] ; [0x8001db4] = 0x40021000
        0x08001d82:    f8501f88    P...    LDR      r1,[r0,#0x88]!
        0x08001d86:    f0216140    !.@a    BIC      r1,r1,#0xc000000
        0x08001d8a:    f8401930    @.0.    STR      r1,[r0],#-0x30
        0x08001d8e:    6801        .h      LDR      r1,[r0,#0]
        0x08001d90:    f4410100    A...    ORR      r1,r1,#0x800000
        0x08001d94:    6001        .`      STR      r1,[r0,#0]
        0x08001d96:    6800        .h      LDR      r0,[r0,#0]
        0x08001d98:    2200        ."      MOVS     r2,#0
        0x08001d9a:    f4000000    ....    AND      r0,r0,#0x800000
        0x08001d9e:    9000        ..      STR      r0,[sp,#0]
        0x08001da0:    4611        .F      MOV      r1,r2
        0x08001da2:    2014        .       MOVS     r0,#0x14
        0x08001da4:    f7fffd44    ..D.    BL       HAL_NVIC_SetPriority ; 0x8001830
        0x08001da8:    e8bd4008    ...@    POP      {r3,lr}
        0x08001dac:    2014        .       MOVS     r0,#0x14
        0x08001dae:    f7ffbd2f    ../.    B.W      HAL_NVIC_EnableIRQ ; 0x8001810
    $d
        0x08001db2:    0000        ..      DCW    0
        0x08001db4:    40021000    ...@    DCD    1073876992
    $t
    i.HAL_PCD_ResetCallback
    HAL_PCD_ResetCallback
        0x08001db8:    b570        p.      PUSH     {r4-r6,lr}
        0x08001dba:    4604        .F      MOV      r4,r0
        0x08001dbc:    7940        @y      LDRB     r0,[r0,#5]
        0x08001dbe:    2501        .%      MOVS     r5,#1
        0x08001dc0:    2802        .(      CMP      r0,#2
        0x08001dc2:    bf18        ..      IT       NE
        0x08001dc4:    f7fefc82    ....    BLNE     Error_Handler ; 0x80006cc
        0x08001dc8:    4629        )F      MOV      r1,r5
        0x08001dca:    f8d402d8    ....    LDR      r0,[r4,#0x2d8]
        0x08001dce:    f003feab    ....    BL       USBD_LL_SetSpeed ; 0x8005b28
        0x08001dd2:    f8d402d8    ....    LDR      r0,[r4,#0x2d8]
        0x08001dd6:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08001dda:    f003be59    ..Y.    B.W      USBD_LL_Reset ; 0x8005a90
        0x08001dde:    0000        ..      MOVS     r0,r0
    i.HAL_PCD_ResumeCallback
    HAL_PCD_ResumeCallback
        0x08001de0:    b510        ..      PUSH     {r4,lr}
        0x08001de2:    4604        .F      MOV      r4,r0
        0x08001de4:    7a40        @z      LDRB     r0,[r0,#9]
        0x08001de6:    b130        0.      CBZ      r0,0x8001df6 ; HAL_PCD_ResumeCallback + 22
        0x08001de8:    4806        .H      LDR      r0,[pc,#24] ; [0x8001e04] = 0xe000ed10
        0x08001dea:    6801        .h      LDR      r1,[r0,#0]
        0x08001dec:    f0210106    !...    BIC      r1,r1,#6
        0x08001df0:    6001        .`      STR      r1,[r0,#0]
        0x08001df2:    f003f99d    ....    BL       SystemClock_Config ; 0x8005130
        0x08001df6:    f8d402d8    ....    LDR      r0,[r4,#0x2d8]
        0x08001dfa:    e8bd4010    ...@    POP      {r4,lr}
        0x08001dfe:    f003be78    ..x.    B.W      USBD_LL_Resume ; 0x8005af2
    $d
        0x08001e02:    0000        ..      DCW    0
        0x08001e04:    e000ed10    ....    DCD    3758157072
    $t
    i.HAL_PCD_SOFCallback
    HAL_PCD_SOFCallback
        0x08001e08:    f8d002d8    ....    LDR      r0,[r0,#0x2d8]
        0x08001e0c:    f003be7b    ..{.    B.W      USBD_LL_SOF ; 0x8005b06
    i.HAL_PCD_SetAddress
    HAL_PCD_SetAddress
        0x08001e10:    b510        ..      PUSH     {r4,lr}
        0x08001e12:    4604        .F      MOV      r4,r0
        0x08001e14:    f8900290    ....    LDRB     r0,[r0,#0x290]
        0x08001e18:    2801        .(      CMP      r0,#1
        0x08001e1a:    bf04        ..      ITT      EQ
        0x08001e1c:    2002        .       MOVEQ    r0,#2
        0x08001e1e:    bd10        ..      POPEQ    {r4,pc}
        0x08001e20:    2001        .       MOVS     r0,#1
        0x08001e22:    f8840290    ....    STRB     r0,[r4,#0x290]
        0x08001e26:    7321        !s      STRB     r1,[r4,#0xc]
        0x08001e28:    6820         h      LDR      r0,[r4,#0]
        0x08001e2a:    f004fff4    ....    BL       USB_SetDevAddress ; 0x8006e16
        0x08001e2e:    2000        .       MOVS     r0,#0
        0x08001e30:    f8840290    ....    STRB     r0,[r4,#0x290]
        0x08001e34:    bd10        ..      POP      {r4,pc}
    i.HAL_PCD_SetupStageCallback
    HAL_PCD_SetupStageCallback
        0x08001e36:    f8d022d8    ..."    LDR      r2,[r0,#0x2d8]
        0x08001e3a:    f5007126    ..&q    ADD      r1,r0,#0x298
        0x08001e3e:    4610        .F      MOV      r0,r2
        0x08001e40:    f003be87    ....    B.W      USBD_LL_SetupStage ; 0x8005b52
    i.HAL_PCD_Start
    HAL_PCD_Start
        0x08001e44:    b510        ..      PUSH     {r4,lr}
        0x08001e46:    4604        .F      MOV      r4,r0
        0x08001e48:    f8900290    ....    LDRB     r0,[r0,#0x290]
        0x08001e4c:    2801        .(      CMP      r0,#1
        0x08001e4e:    bf04        ..      ITT      EQ
        0x08001e50:    2002        .       MOVEQ    r0,#2
        0x08001e52:    bd10        ..      POPEQ    {r4,pc}
        0x08001e54:    2001        .       MOVS     r0,#1
        0x08001e56:    f8840290    ....    STRB     r0,[r4,#0x290]
        0x08001e5a:    6820         h      LDR      r0,[r4,#0]
        0x08001e5c:    f004ffb3    ....    BL       USB_EnableGlobalInt ; 0x8006dc6
        0x08001e60:    6820         h      LDR      r0,[r4,#0]
        0x08001e62:    f004fbb2    ....    BL       USB_DevConnect ; 0x80065ca
        0x08001e66:    2000        .       MOVS     r0,#0
        0x08001e68:    f8840290    ....    STRB     r0,[r4,#0x290]
        0x08001e6c:    bd10        ..      POP      {r4,pc}
        0x08001e6e:    0000        ..      MOVS     r0,r0
    i.HAL_PCD_SuspendCallback
    HAL_PCD_SuspendCallback
        0x08001e70:    b510        ..      PUSH     {r4,lr}
        0x08001e72:    4604        .F      MOV      r4,r0
        0x08001e74:    f8d002d8    ....    LDR      r0,[r0,#0x2d8]
        0x08001e78:    f003fec1    ....    BL       USBD_LL_Suspend ; 0x8005bfe
        0x08001e7c:    7a60        `z      LDRB     r0,[r4,#9]
        0x08001e7e:    2800        .(      CMP      r0,#0
        0x08001e80:    bf08        ..      IT       EQ
        0x08001e82:    bd10        ..      POPEQ    {r4,pc}
        0x08001e84:    4802        .H      LDR      r0,[pc,#8] ; [0x8001e90] = 0xe000ed10
        0x08001e86:    6801        .h      LDR      r1,[r0,#0]
        0x08001e88:    f0410106    A...    ORR      r1,r1,#6
        0x08001e8c:    6001        .`      STR      r1,[r0,#0]
        0x08001e8e:    bd10        ..      POP      {r4,pc}
    $d
        0x08001e90:    e000ed10    ....    DCD    3758157072
    $t
    i.HAL_PWREx_DisableUCPDDeadBattery
    HAL_PWREx_DisableUCPDDeadBattery
        0x08001e94:    4802        .H      LDR      r0,[pc,#8] ; [0x8001ea0] = 0x40007000
        0x08001e96:    6881        .h      LDR      r1,[r0,#8]
        0x08001e98:    f4414180    A..A    ORR      r1,r1,#0x4000
        0x08001e9c:    6081        .`      STR      r1,[r0,#8]
        0x08001e9e:    4770        pG      BX       lr
    $d
        0x08001ea0:    40007000    .p.@    DCD    1073770496
    $t
    i.HAL_SYSCFG_DisableVREFBUF
    HAL_SYSCFG_DisableVREFBUF
        0x08001ea4:    4802        .H      LDR      r0,[pc,#8] ; [0x8001eb0] = 0x40010000
        0x08001ea6:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08001ea8:    f0210101    !...    BIC      r1,r1,#1
        0x08001eac:    6301        .c      STR      r1,[r0,#0x30]
        0x08001eae:    4770        pG      BX       lr
    $d
        0x08001eb0:    40010000    ...@    DCD    1073807360
    $t
    i.HAL_SYSCFG_VREFBUF_HighImpedanceConfig
    HAL_SYSCFG_VREFBUF_HighImpedanceConfig
        0x08001eb4:    4903        .I      LDR      r1,[pc,#12] ; [0x8001ec4] = 0x40010000
        0x08001eb6:    6b0a        .k      LDR      r2,[r1,#0x30]
        0x08001eb8:    f0220202    "...    BIC      r2,r2,#2
        0x08001ebc:    4310        .C      ORRS     r0,r0,r2
        0x08001ebe:    6308        .c      STR      r0,[r1,#0x30]
        0x08001ec0:    4770        pG      BX       lr
    $d
        0x08001ec2:    0000        ..      DCW    0
        0x08001ec4:    40010000    ...@    DCD    1073807360
    $t
    i.HAL_SYSTICK_Config
    HAL_SYSTICK_Config
        0x08001ec8:    1e41        A.      SUBS     r1,r0,#1
        0x08001eca:    f1b17f80    ....    CMP      r1,#0x1000000
        0x08001ece:    bf24        $.      ITT      CS
        0x08001ed0:    2001        .       MOVCS    r0,#1
        0x08001ed2:    4770        pG      BXCS     lr
        0x08001ed4:    f04f20e0    O..     MOV      r0,#0xe000e000
        0x08001ed8:    6141        Aa      STR      r1,[r0,#0x14]
        0x08001eda:    4a05        .J      LDR      r2,[pc,#20] ; [0x8001ef0] = 0xe000e00f
        0x08001edc:    21f0        .!      MOVS     r1,#0xf0
        0x08001ede:    f8821d14    ....    STRB     r1,[r2,#0xd14]
        0x08001ee2:    2100        .!      MOVS     r1,#0
        0x08001ee4:    6181        .a      STR      r1,[r0,#0x18]
        0x08001ee6:    2107        .!      MOVS     r1,#7
        0x08001ee8:    6101        .a      STR      r1,[r0,#0x10]
        0x08001eea:    2000        .       MOVS     r0,#0
        0x08001eec:    4770        pG      BX       lr
    $d
        0x08001eee:    0000        ..      DCW    0
        0x08001ef0:    e000e00f    ....    DCD    3758153743
    $t
    i.HFPISensorlessObserver
    HFPISensorlessObserver
        0x08001ef4:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001ef8:    4605        .F      MOV      r5,r0
        0x08001efa:    4854        TH      LDR      r0,[pc,#336] ; [0x800204c] = 0x20000060
        0x08001efc:    460c        .F      MOV      r4,r1
        0x08001efe:    ed2d8b04    -...    VPUSH    {d8-d9}
        0x08001f02:    6800        .h      LDR      r0,[r0,#0]
        0x08001f04:    ed910a0b    ....    VLDR     s0,[r1,#0x2c]
        0x08001f08:    edd08a06    ....    VLDR     s17,[r0,#0x18]
        0x08001f0c:    f000fa80    ....    BL       Hardware_GetSinCosVal ; 0x8002410
        0x08001f10:    ed840a01    ....    VSTR     s0,[r4,#4]
        0x08001f14:    edc40a02    ....    VSTR     s1,[r4,#8]
        0x08001f18:    ed940a0b    ....    VLDR     s0,[r4,#0x2c]
        0x08001f1c:    edd40a12    ....    VLDR     s1,[r4,#0x48]
        0x08001f20:    ed9f8a4b    ..K.    VLDR     s16,[pc,#300] ; [0x8002050] = 0x40c90fdb
        0x08001f24:    4e4b        KN      LDR      r6,[pc,#300] ; [0x8002054] = 0x40490fdb
        0x08001f26:    4f4c        LO      LDR      r7,[pc,#304] ; [0x8002058] = 0xc0490fdb
        0x08001f28:    ee600a88    `...    VMUL.F32 s1,s1,s16
        0x08001f2c:    ee000aa8    ....    VMLA.F32 s0,s1,s17
        0x08001f30:    ee100a10    ....    VMOV     r0,s0
        0x08001f34:    ed840a0b    ....    VSTR     s0,[r4,#0x2c]
        0x08001f38:    42b0        .B      CMP      r0,r6
        0x08001f3a:    bfc8        ..      IT       GT
        0x08001f3c:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08001f40:    dc06        ..      BGT      0x8001f50 ; HFPISensorlessObserver + 92
        0x08001f42:    ee100a10    ....    VMOV     r0,s0
        0x08001f46:    42b8        .B      CMP      r0,r7
        0x08001f48:    bf88        ..      IT       HI
        0x08001f4a:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x08001f4e:    d901        ..      BLS      0x8001f54 ; HFPISensorlessObserver + 96
        0x08001f50:    ed840a0b    ....    VSTR     s0,[r4,#0x2c]
        0x08001f54:    f105003c    ..<.    ADD      r0,r5,#0x3c
        0x08001f58:    f7fefaba    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08001f5c:    ed840a03    ....    VSTR     s0,[r4,#0xc]
        0x08001f60:    edc40a04    ....    VSTR     s1,[r4,#0x10]
        0x08001f64:    f1050124    ..$.    ADD      r1,r5,#0x24
        0x08001f68:    f104000c    ....    ADD      r0,r4,#0xc
        0x08001f6c:    f7fefafa    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08001f70:    ed840a05    ....    VSTR     s0,[r4,#0x14]
        0x08001f74:    edc40a06    ....    VSTR     s1,[r4,#0x18]
        0x08001f78:    4838        8H      LDR      r0,[pc,#224] ; [0x800205c] = 0x200002a0
        0x08001f7a:    f7fefb04    ....    BL       BPF_2stOrder_1in_1out_Calculate ; 0x8000586
        0x08001f7e:    ed840a07    ....    VSTR     s0,[r4,#0x1c]
        0x08001f82:    ed940a06    ....    VLDR     s0,[r4,#0x18]
        0x08001f86:    4836        6H      LDR      r0,[pc,#216] ; [0x8002060] = 0x200002bc
        0x08001f88:    f7fefafd    ....    BL       BPF_2stOrder_1in_1out_Calculate ; 0x8000586
        0x08001f8c:    ed840a08    ....    VSTR     s0,[r4,#0x20]
        0x08001f90:    ed940a05    ....    VLDR     s0,[r4,#0x14]
        0x08001f94:    edd40a07    ....    VLDR     s1,[r4,#0x1c]
        0x08001f98:    4832        2H      LDR      r0,[pc,#200] ; [0x8002064] = 0x20000268
        0x08001f9a:    ee300a60    0.`.    VSUB.F32 s0,s0,s1
        0x08001f9e:    f001fbff    ....    BL       LPF_2stOrder_1in_1out_Calculate ; 0x80037a0
        0x08001fa2:    ed850a11    ....    VSTR     s0,[r5,#0x44]
        0x08001fa6:    ed940a06    ....    VLDR     s0,[r4,#0x18]
        0x08001faa:    edd40a08    ....    VLDR     s1,[r4,#0x20]
        0x08001fae:    482e        .H      LDR      r0,[pc,#184] ; [0x8002068] = 0x20000284
        0x08001fb0:    ee300a60    0.`.    VSUB.F32 s0,s0,s1
        0x08001fb4:    f001fbf4    ....    BL       LPF_2stOrder_1in_1out_Calculate ; 0x80037a0
        0x08001fb8:    ed850a12    ....    VSTR     s0,[r5,#0x48]
        0x08001fbc:    ed940a08    ....    VLDR     s0,[r4,#0x20]
        0x08001fc0:    edd40a02    ....    VLDR     s1,[r4,#8]
        0x08001fc4:    4829        )H      LDR      r0,[pc,#164] ; [0x800206c] = 0x200002d8
        0x08001fc6:    ee209a20     . .    VMUL.F32 s18,s0,s1
        0x08001fca:    eeb00a49    ..I.    VMOV.F32 s0,s18
        0x08001fce:    f7fefada    ....    BL       BPF_2stOrder_1in_1out_Calculate ; 0x8000586
        0x08001fd2:    ee390a40    9.@.    VSUB.F32 s0,s18,s0
        0x08001fd6:    edd40a0f    ....    VLDR     s1,[r4,#0x3c]
        0x08001fda:    ee200a80     ...    VMUL.F32 s0,s1,s0
        0x08001fde:    ed840a0e    ....    VSTR     s0,[r4,#0x38]
        0x08001fe2:    edd40a10    ....    VLDR     s1,[r4,#0x40]
        0x08001fe6:    ee400a28    @.(.    VMLA.F32 s1,s0,s17
        0x08001fea:    edc40a10    ....    VSTR     s1,[r4,#0x40]
        0x08001fee:    ed941a14    ....    VLDR     s2,[r4,#0x50]
        0x08001ff2:    ee600a81    `...    VMUL.F32 s1,s1,s2
        0x08001ff6:    ed941a13    ....    VLDR     s2,[r4,#0x4c]
        0x08001ffa:    ee400a01    @...    VMLA.F32 s1,s0,s2
        0x08001ffe:    edc40a0d    ....    VSTR     s1,[r4,#0x34]
        0x08002002:    ed940a11    ....    VLDR     s0,[r4,#0x44]
        0x08002006:    ee000aa8    ....    VMLA.F32 s0,s1,s17
        0x0800200a:    ee100a10    ....    VMOV     r0,s0
        0x0800200e:    ed840a11    ....    VSTR     s0,[r4,#0x44]
        0x08002012:    42b0        .B      CMP      r0,r6
        0x08002014:    bfc4        ..      ITT      GT
        0x08002016:    eddf0a16    ....    VLDRGT   s1,[pc,#88] ; [0x8002070] = 0xc0c90fdb
        0x0800201a:    ee300a20    0. .    VADDGT.F32 s0,s0,s1
        0x0800201e:    dc06        ..      BGT      0x800202e ; HFPISensorlessObserver + 314
        0x08002020:    ee100a10    ....    VMOV     r0,s0
        0x08002024:    42b8        .B      CMP      r0,r7
        0x08002026:    bf88        ..      IT       HI
        0x08002028:    ee380a40    8.@.    VSUBHI.F32 s0,s16,s0
        0x0800202c:    d901        ..      BLS      0x8002032 ; HFPISensorlessObserver + 318
        0x0800202e:    ed840a11    ....    VSTR     s0,[r4,#0x44]
        0x08002032:    ed840a0c    ....    VSTR     s0,[r4,#0x30]
        0x08002036:    ed940a02    ....    VLDR     s0,[r4,#8]
        0x0800203a:    edd40a00    ....    VLDR     s1,[r4,#0]
        0x0800203e:    ecbd8b04    ....    VPOP     {d8-d9}
        0x08002042:    ee200a20     . .    VMUL.F32 s0,s0,s1
        0x08002046:    e8bd81f0    ....    POP      {r4-r8,pc}
    $d
        0x0800204a:    0000        ..      DCW    0
        0x0800204c:    20000060    `..     DCD    536871008
        0x08002050:    40c90fdb    ...@    DCD    1086918619
        0x08002054:    40490fdb    ..I@    DCD    1078530011
        0x08002058:    c0490fdb    ..I.    DCD    3226013659
        0x0800205c:    200002a0    ...     DCD    536871584
        0x08002060:    200002bc    ...     DCD    536871612
        0x08002064:    20000268    h..     DCD    536871528
        0x08002068:    20000284    ...     DCD    536871556
        0x0800206c:    200002d8    ...     DCD    536871640
        0x08002070:    c0c90fdb    ....    DCD    3234402267
    $t
    i.HFPI_BPF0_2stOrder_1in_1out_SetPar
    HFPI_BPF0_2stOrder_1in_1out_SetPar
        0x08002074:    b510        ..      PUSH     {r4,lr}
        0x08002076:    480e        .H      LDR      r0,[pc,#56] ; [0x80020b0] = 0x200002a0
        0x08002078:    ed2d8b04    -...    VPUSH    {d8-d9}
        0x0800207c:    eeb08a61    ..a.    VMOV.F32 s16,s3
        0x08002080:    eef08a41    ..A.    VMOV.F32 s17,s2
        0x08002084:    eeb09a60    ..`.    VMOV.F32 s18,s1
        0x08002088:    eef09a40    ..@.    VMOV.F32 s19,s0
        0x0800208c:    f7fefa9a    ....    BL       BPF_2stOrder_1in_1out_SetPar ; 0x80005c4
        0x08002090:    eef01a48    ..H.    VMOV.F32 s3,s16
        0x08002094:    eeb01a68    ..h.    VMOV.F32 s2,s17
        0x08002098:    eef00a49    ..I.    VMOV.F32 s1,s18
        0x0800209c:    eeb00a69    ..i.    VMOV.F32 s0,s19
        0x080020a0:    ecbd8b04    ....    VPOP     {d8-d9}
        0x080020a4:    e8bd4010    ...@    POP      {r4,lr}
        0x080020a8:    4802        .H      LDR      r0,[pc,#8] ; [0x80020b4] = 0x200002bc
        0x080020aa:    f7feba8b    ....    B        BPF_2stOrder_1in_1out_SetPar ; 0x80005c4
    $d
        0x080020ae:    0000        ..      DCW    0
        0x080020b0:    200002a0    ...     DCD    536871584
        0x080020b4:    200002bc    ...     DCD    536871612
    $t
    i.HFPI_BPF1_2stOrder_1in_1out_SetPar
    HFPI_BPF1_2stOrder_1in_1out_SetPar
        0x080020b8:    4801        .H      LDR      r0,[pc,#4] ; [0x80020c0] = 0x200002d8
        0x080020ba:    f7feba83    ....    B        BPF_2stOrder_1in_1out_SetPar ; 0x80005c4
    $d
        0x080020be:    0000        ..      DCW    0
        0x080020c0:    200002d8    ...     DCD    536871640
    $t
    i.HFPI_LPF_2stOrder_1in_1out_SetPar
    HFPI_LPF_2stOrder_1in_1out_SetPar
        0x080020c4:    b510        ..      PUSH     {r4,lr}
        0x080020c6:    480e        .H      LDR      r0,[pc,#56] ; [0x8002100] = 0x20000268
        0x080020c8:    ed2d8b04    -...    VPUSH    {d8-d9}
        0x080020cc:    eeb08a61    ..a.    VMOV.F32 s16,s3
        0x080020d0:    eef08a41    ..A.    VMOV.F32 s17,s2
