ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080020d4:    eeb09a60    ..`.    VMOV.F32 s18,s1
        0x080020d8:    eef09a40    ..@.    VMOV.F32 s19,s0
        0x080020dc:    f001fb80    ....    BL       LPF_2stOrder_1in_1out_SetPar ; 0x80037e0
        0x080020e0:    eef01a48    ..H.    VMOV.F32 s3,s16
        0x080020e4:    eeb01a68    ..h.    VMOV.F32 s2,s17
        0x080020e8:    eef00a49    ..I.    VMOV.F32 s1,s18
        0x080020ec:    eeb00a69    ..i.    VMOV.F32 s0,s19
        0x080020f0:    ecbd8b04    ....    VPOP     {d8-d9}
        0x080020f4:    e8bd4010    ...@    POP      {r4,lr}
        0x080020f8:    4802        .H      LDR      r0,[pc,#8] ; [0x8002104] = 0x20000284
        0x080020fa:    f001bb71    ..q.    B.W      LPF_2stOrder_1in_1out_SetPar ; 0x80037e0
    $d
        0x080020fe:    0000        ..      DCW    0
        0x08002100:    20000268    h..     DCD    536871528
        0x08002104:    20000284    ...     DCD    536871556
    $t
    i.HFSISensorlessObserver
    HFSISensorlessObserver
        0x08002108:    b570        p.      PUSH     {r4-r6,lr}
        0x0800210a:    4605        .F      MOV      r5,r0
        0x0800210c:    ed2d8b02    -...    VPUSH    {d8}
        0x08002110:    460c        .F      MOV      r4,r1
        0x08002112:    303c        <0      ADDS     r0,r0,#0x3c
        0x08002114:    f7fef9dc    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08002118:    ed840a04    ....    VSTR     s0,[r4,#0x10]
        0x0800211c:    edc40a05    ....    VSTR     s1,[r4,#0x14]
        0x08002120:    f1050124    ..$.    ADD      r1,r5,#0x24
        0x08002124:    f1040010    ....    ADD      r0,r4,#0x10
        0x08002128:    f7fefa1c    ....    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x0800212c:    eeb08a40    ..@.    VMOV.F32 s16,s0
        0x08002130:    eef08a60    ..`.    VMOV.F32 s17,s1
        0x08002134:    ed858a11    ....    VSTR     s16,[r5,#0x44]
        0x08002138:    edc58a12    ....    VSTR     s17,[r5,#0x48]
        0x0800213c:    ed840a06    ....    VSTR     s0,[r4,#0x18]
        0x08002140:    edc40a07    ....    VSTR     s1,[r4,#0x1c]
        0x08002144:    ed941a02    ....    VLDR     s2,[r4,#8]
        0x08002148:    ee301a01    0...    VADD.F32 s2,s0,s2
        0x0800214c:    eeb60a00    ....    VMOV.F32 s0,#0.50000000
        0x08002150:    ee211a00    !...    VMUL.F32 s2,s2,s0
        0x08002154:    ed851a11    ....    VSTR     s2,[r5,#0x44]
        0x08002158:    ed941a03    ....    VLDR     s2,[r4,#0xc]
        0x0800215c:    ee700a81    p...    VADD.F32 s1,s1,s2
        0x08002160:    ee600a80    `...    VMUL.F32 s1,s1,s0
        0x08002164:    edc50a12    ....    VSTR     s1,[r5,#0x48]
        0x08002168:    edd40a04    ....    VLDR     s1,[r4,#0x10]
        0x0800216c:    ed941a00    ....    VLDR     s2,[r4,#0]
        0x08002170:    edd41a01    ....    VLDR     s3,[r4,#4]
        0x08002174:    f8940058    ..X.    LDRB     r0,[r4,#0x58]
        0x08002178:    ee700ac1    p...    VSUB.F32 s1,s1,s2
        0x0800217c:    ed941a05    ....    VLDR     s2,[r4,#0x14]
        0x08002180:    2800        .(      CMP      r0,#0
        0x08002182:    ee311a61    1.a.    VSUB.F32 s2,s2,s3
        0x08002186:    ee600a80    `...    VMUL.F32 s1,s1,s0
        0x0800218a:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x0800218e:    bf1c        ..      ITT      NE
        0x08002190:    eef10a60    ..`.    VNEGNE.F32 s1,s1
        0x08002194:    eeb10a40    ..@.    VNEGNE.F32 s0,s0
        0x08002198:    edc40a0a    ....    VSTR     s1,[r4,#0x28]
        0x0800219c:    ee600aa0    `...    VMUL.F32 s1,s1,s1
        0x080021a0:    ed840a0b    ....    VSTR     s0,[r4,#0x2c]
        0x080021a4:    ee400a00    @...    VMLA.F32 s1,s0,s0
        0x080021a8:    eeb00a60    ..`.    VMOV.F32 s0,s1
        0x080021ac:    f7fffad4    ....    BL       FastReciprocalSquareRoot ; 0x8001758
        0x080021b0:    edd40a0a    ....    VLDR     s1,[r4,#0x28]
        0x080021b4:    4831        1H      LDR      r0,[pc,#196] ; [0x800227c] = 0x20000060
        0x080021b6:    4932        2I      LDR      r1,[pc,#200] ; [0x8002280] = 0x40490fdb
        0x080021b8:    ee600a80    `...    VMUL.F32 s1,s1,s0
        0x080021bc:    edc40a0c    ....    VSTR     s1,[r4,#0x30]
        0x080021c0:    ed941a0b    ....    VLDR     s2,[r4,#0x2c]
        0x080021c4:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x080021c8:    ed840a0d    ....    VSTR     s0,[r4,#0x34]
        0x080021cc:    ed951a0a    ....    VLDR     s2,[r5,#0x28]
        0x080021d0:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x080021d4:    ed951a09    ....    VLDR     s2,[r5,#0x24]
        0x080021d8:    ee000ac1    ....    VMLS.F32 s0,s1,s2
        0x080021dc:    ed840a15    ....    VSTR     s0,[r4,#0x54]
        0x080021e0:    6800        .h      LDR      r0,[r0,#0]
        0x080021e2:    edd40a0f    ....    VLDR     s1,[r4,#0x3c]
        0x080021e6:    edd01a06    ....    VLDR     s3,[r0,#0x18]
        0x080021ea:    ee410a80    A...    VMLA.F32 s1,s3,s0
        0x080021ee:    edc40a0f    ....    VSTR     s1,[r4,#0x3c]
        0x080021f2:    ed941a12    ....    VLDR     s2,[r4,#0x48]
        0x080021f6:    ee600a81    `...    VMUL.F32 s1,s1,s2
        0x080021fa:    ed941a11    ....    VLDR     s2,[r4,#0x44]
        0x080021fe:    ee400a01    @...    VMLA.F32 s1,s0,s2
        0x08002202:    edc40a14    ....    VSTR     s1,[r4,#0x50]
        0x08002206:    ed941a10    ....    VLDR     s2,[r4,#0x40]
        0x0800220a:    ee011aa0    ....    VMLA.F32 s2,s3,s1
        0x0800220e:    ee110a10    ....    VMOV     r0,s2
        0x08002212:    4288        .B      CMP      r0,r1
        0x08002214:    dd06        ..      BLE      0x8002224 ; HFSISensorlessObserver + 284
        0x08002216:    ed9f0a1b    ....    VLDR     s0,[pc,#108] ; [0x8002284] = 0xc0c90fdb
        0x0800221a:    ee310a00    1...    VADD.F32 s0,s2,s0
        0x0800221e:    ed840a10    ....    VSTR     s0,[r4,#0x40]
        0x08002222:    e00d        ..      B        0x8002240 ; HFSISensorlessObserver + 312
        0x08002224:    ee110a10    ....    VMOV     r0,s2
        0x08002228:    4917        .I      LDR      r1,[pc,#92] ; [0x8002288] = 0xc0490fdb
        0x0800222a:    4288        .B      CMP      r0,r1
        0x0800222c:    bf98        ..      IT       LS
        0x0800222e:    ed841a10    ....    VSTRLS   s2,[r4,#0x40]
        0x08002232:    d905        ..      BLS      0x8002240 ; HFSISensorlessObserver + 312
        0x08002234:    ed9f0a15    ....    VLDR     s0,[pc,#84] ; [0x800228c] = 0x40c90fdb
        0x08002238:    ee310a00    1...    VADD.F32 s0,s2,s0
        0x0800223c:    ed840a10    ....    VSTR     s0,[r4,#0x40]
        0x08002240:    ed940a10    ....    VLDR     s0,[r4,#0x40]
        0x08002244:    ed840a13    ....    VSTR     s0,[r4,#0x4c]
        0x08002248:    e9d40104    ....    LDRD     r0,r1,[r4,#0x10]
        0x0800224c:    e9c40100    ....    STRD     r0,r1,[r4,#0]
        0x08002250:    ed848a02    ....    VSTR     s16,[r4,#8]
        0x08002254:    edc48a03    ....    VSTR     s17,[r4,#0xc]
        0x08002258:    f8940058    ..X.    LDRB     r0,[r4,#0x58]
        0x0800225c:    2800        .(      CMP      r0,#0
        0x0800225e:    bf0c        ..      ITE      EQ
        0x08002260:    2001        .       MOVEQ    r0,#1
        0x08002262:    2000        .       MOVNE    r0,#0
        0x08002264:    f8840058    ..X.    STRB     r0,[r4,#0x58]
        0x08002268:    ed940a0e    ....    VLDR     s0,[r4,#0x38]
        0x0800226c:    eeb10a40    ..@.    VNEG.F32 s0,s0
        0x08002270:    ed840a0e    ....    VSTR     s0,[r4,#0x38]
        0x08002274:    ecbd8b02    ....    VPOP     {d8}
        0x08002278:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x0800227a:    0000        ..      DCW    0
        0x0800227c:    20000060    `..     DCD    536871008
        0x08002280:    40490fdb    ..I@    DCD    1078530011
        0x08002284:    c0c90fdb    ....    DCD    3234402267
        0x08002288:    c0490fdb    ..I.    DCD    3226013659
        0x0800228c:    40c90fdb    ...@    DCD    1086918619
    $t
    i.HardFault_Handler
    HardFault_Handler
        0x08002290:    e7fe        ..      B        HardFault_Handler ; 0x8002290
        0x08002292:    0000        ..      MOVS     r0,r0
    i.Hardware_FastReciprocalSquareRoot
    Hardware_FastReciprocalSquareRoot
        0x08002294:    ee100a10    ....    VMOV     r0,s0
        0x08002298:    eef60a00    ....    VMOV.F32 s1,#0.50000000
        0x0800229c:    4907        .I      LDR      r1,[pc,#28] ; [0x80022bc] = 0x5f3759df
        0x0800229e:    ee600a20    `. .    VMUL.F32 s1,s0,s1
        0x080022a2:    eba10060    ..`.    SUB      r0,r1,r0,ASR #1
        0x080022a6:    ee000a10    ....    VMOV     s0,r0
        0x080022aa:    ee201a80     ...    VMUL.F32 s2,s1,s0
        0x080022ae:    eef70a08    ....    VMOV.F32 s1,#1.50000000
        0x080022b2:    ee410a40    A.@.    VMLS.F32 s1,s2,s0
        0x080022b6:    ee200a80     ...    VMUL.F32 s0,s1,s0
        0x080022ba:    4770        pG      BX       lr
    $d
        0x080022bc:    5f3759df    .Y7_    DCD    1597463007
    $t
    i.Hardware_FastSquareRoot
    Hardware_FastSquareRoot
        0x080022c0:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x080022c4:    eef50ac0    ....    VCMPE.F32 s1,#0.0
        0x080022c8:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x080022cc:    bfac        ..      ITE      GE
        0x080022ce:    eeb10ae0    ....    VSQRTGE.F32 s0,s1
        0x080022d2:    ed9f0a01    ....    VLDRLT   s0,[pc,#4] ; [0x80022d8] = 0
        0x080022d6:    4770        pG      BX       lr
    $d
        0x080022d8:    00000000    ....    DCD    0
    $t
    i.Hardware_GetABZCounter
    Hardware_GetABZCounter
        0x080022dc:    4801        .H      LDR      r0,[pc,#4] ; [0x80022e4] = 0x40000424
        0x080022de:    6800        .h      LDR      r0,[r0,#0]
        0x080022e0:    4770        pG      BX       lr
    $d
        0x080022e2:    0000        ..      DCW    0
        0x080022e4:    40000424    $..@    DCD    1073742884
    $t
    i.Hardware_GetAbsCounter
    Hardware_GetAbsCounter
        0x080022e8:    4806        .H      LDR      r0,[pc,#24] ; [0x8002304] = 0x20000064
        0x080022ea:    f44f71cd    O..q    MOV      r1,#0x19a
        0x080022ee:    6800        .h      LDR      r0,[r0,#0]
        0x080022f0:    8800        ..      LDRH     r0,[r0,#0]
        0x080022f2:    00c0        ..      LSLS     r0,r0,#3
        0x080022f4:    f3c000cc    ....    UBFX     r0,r0,#3,#13
        0x080022f8:    fbb0f2f1    ....    UDIV     r2,r0,r1
        0x080022fc:    fb010012    ....    MLS      r0,r1,r2,r0
        0x08002300:    4770        pG      BX       lr
    $d
        0x08002302:    0000        ..      DCW    0
        0x08002304:    20000064    d..     DCD    536871012
    $t
    i.Hardware_GetBusVoltage
    Hardware_GetBusVoltage
        0x08002308:    f04f40a0    O..@    MOV      r0,#0x50000000
        0x0800230c:    6881        .h      LDR      r1,[r0,#8]
        0x0800230e:    f021013f    !.?.    BIC      r1,r1,#0x3f
        0x08002312:    f0214100    !..A    BIC      r1,r1,#0x80000000
        0x08002316:    f0410104    A...    ORR      r1,r1,#4
        0x0800231a:    6081        .`      STR      r1,[r0,#8]
        0x0800231c:    6801        .h      LDR      r1,[r0,#0]
        0x0800231e:    f0110f04    ....    TST      r1,#4
        0x08002322:    d0fb        ..      BEQ      0x800231c ; Hardware_GetBusVoltage + 20
        0x08002324:    6c01        .l      LDR      r1,[r0,#0x40]
        0x08002326:    ed9f1a14    ....    VLDR     s2,[pc,#80] ; [0x8002378] = 0x477fff00
        0x0800232a:    b289        ..      UXTH     r1,r1
        0x0800232c:    ee001a10    ....    VMOV     s0,r1
        0x08002330:    eddf1a12    ....    VLDR     s3,[pc,#72] ; [0x800237c] = 0x40533333
        0x08002334:    eef80a40    ..@.    VCVT.F32.U32 s1,s0
        0x08002338:    ee800a81    ....    VDIV.F32 s0,s1,s2
        0x0800233c:    eef30a0f    ....    VMOV.F32 s1,#31.00000000
        0x08002340:    ee200a21     .!.    VMUL.F32 s0,s0,s3
        0x08002344:    ee200a20     . .    VMUL.F32 s0,s0,s1
        0x08002348:    6801        .h      LDR      r1,[r0,#0]
        0x0800234a:    f0110f04    ....    TST      r1,#4
        0x0800234e:    d0fb        ..      BEQ      0x8002348 ; Hardware_GetBusVoltage + 64
        0x08002350:    6c00        .l      LDR      r0,[r0,#0x40]
        0x08002352:    b280        ..      UXTH     r0,r0
        0x08002354:    ee000a90    ....    VMOV     s1,r0
        0x08002358:    480a        .H      LDR      r0,[pc,#40] ; [0x8002384] = 0x20000098
        0x0800235a:    eef80a60    ..`.    VCVT.F32.U32 s1,s1
        0x0800235e:    6800        .h      LDR      r0,[r0,#0]
        0x08002360:    ee802a81    ...*    VDIV.F32 s4,s1,s2
        0x08002364:    ed9f1a06    ....    VLDR     s2,[pc,#24] ; [0x8002380] = 0x3f9b1000
        0x08002368:    ee620a21    b.!.    VMUL.F32 s1,s4,s3
        0x0800236c:    eec11a20    .. .    VDIV.F32 s3,s2,s1
        0x08002370:    edc01a00    ....    VSTR     s3,[r0,#0]
        0x08002374:    4770        pG      BX       lr
    $d
        0x08002376:    0000        ..      DCW    0
        0x08002378:    477fff00    ...G    DCD    1199570688
        0x0800237c:    40533333    33S@    DCD    1079194419
        0x08002380:    3f9b1000    ...?    DCD    1067126784
        0x08002384:    20000098    ...     DCD    536871064
    $t
    i.Hardware_GetPhaseVoltage
    Hardware_GetPhaseVoltage
        0x08002388:    4919        .I      LDR      r1,[pc,#100] ; [0x80023f0] = 0x50000084
        0x0800238a:    6809        .h      LDR      r1,[r1,#0]
        0x0800238c:    b289        ..      UXTH     r1,r1
        0x0800238e:    ee001a10    ....    VMOV     s0,r1
        0x08002392:    491a        .I      LDR      r1,[pc,#104] ; [0x80023fc] = 0x50000184
        0x08002394:    eef80a40    ..@.    VCVT.F32.U32 s1,s0
        0x08002398:    ed9f0a16    ....    VLDR     s0,[pc,#88] ; [0x80023f4] = 0x477fff00
        0x0800239c:    ee801a80    ....    VDIV.F32 s2,s1,s0
        0x080023a0:    eefb0a0f    ....    VMOV.F32 s1,#-31.00000000
        0x080023a4:    ee611a20    a. .    VMUL.F32 s3,s2,s1
        0x080023a8:    ed9f1a13    ....    VLDR     s2,[pc,#76] ; [0x80023f8] = 0x40533333
        0x080023ac:    ee611a81    a...    VMUL.F32 s3,s3,s2
        0x080023b0:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x080023b4:    6809        .h      LDR      r1,[r1,#0]
        0x080023b6:    b289        ..      UXTH     r1,r1
        0x080023b8:    ee011a90    ....    VMOV     s3,r1
        0x080023bc:    4910        .I      LDR      r1,[pc,#64] ; [0x8002400] = 0x50000188
        0x080023be:    eeb82a61    ..a*    VCVT.F32.U32 s4,s3
        0x080023c2:    eec21a00    ....    VDIV.F32 s3,s4,s0
        0x080023c6:    ee611aa0    a...    VMUL.F32 s3,s3,s1
        0x080023ca:    ee611a81    a...    VMUL.F32 s3,s3,s2
        0x080023ce:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080023d2:    6809        .h      LDR      r1,[r1,#0]
        0x080023d4:    b289        ..      UXTH     r1,r1
        0x080023d6:    ee011a90    ....    VMOV     s3,r1
        0x080023da:    eef81a61    ..a.    VCVT.F32.U32 s3,s3
        0x080023de:    ee812a80    ...*    VDIV.F32 s4,s3,s0
        0x080023e2:    ee220a20    ". .    VMUL.F32 s0,s4,s1
        0x080023e6:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x080023ea:    ed800a01    ....    VSTR     s0,[r0,#4]
        0x080023ee:    4770        pG      BX       lr
    $d
        0x080023f0:    50000084    ...P    DCD    1342177412
        0x080023f4:    477fff00    ...G    DCD    1199570688
        0x080023f8:    40533333    33S@    DCD    1079194419
        0x080023fc:    50000184    ...P    DCD    1342177668
        0x08002400:    50000188    ...P    DCD    1342177672
    $t
    i.Hardware_GetPulseCounter
    Hardware_GetPulseCounter
        0x08002404:    4801        .H      LDR      r0,[pc,#4] ; [0x800240c] = 0x40014424
        0x08002406:    6800        .h      LDR      r0,[r0,#0]
        0x08002408:    4770        pG      BX       lr
    $d
        0x0800240a:    0000        ..      DCW    0
        0x0800240c:    40014424    $D.@    DCD    1073824804
    $t
    i.Hardware_GetSinCosVal
    Hardware_GetSinCosVal
        0x08002410:    ed9f1a0f    ....    VLDR     s2,[pc,#60] ; [0x8002450] = 0x40490fdb
        0x08002414:    4910        .I      LDR      r1,[pc,#64] ; [0x8002458] = 0x40020c00
        0x08002416:    eec00a01    ....    VDIV.F32 s1,s0,s2
        0x0800241a:    ed9f0a0e    ....    VLDR     s0,[pc,#56] ; [0x8002454] = 0x4f000000
        0x0800241e:    ee200a80     ...    VMUL.F32 s0,s1,s0
        0x08002422:    eebd0ac0    ....    VCVT.S32.F32 s0,s0
        0x08002426:    ee100a10    ....    VMOV     r0,s0
        0x0800242a:    6048        H`      STR      r0,[r1,#4]
        0x0800242c:    6888        .h      LDR      r0,[r1,#8]
        0x0800242e:    6889        .h      LDR      r1,[r1,#8]
        0x08002430:    ee000a10    ....    VMOV     s0,r0
        0x08002434:    ee001a90    ....    VMOV     s1,r1
        0x08002438:    ed9f1a08    ....    VLDR     s2,[pc,#32] ; [0x800245c] = 0x30000000
        0x0800243c:    eeb80ac0    ....    VCVT.F32.S32 s0,s0
        0x08002440:    eef80ae0    ....    VCVT.F32.S32 s1,s1
        0x08002444:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x08002448:    ee600a81    `...    VMUL.F32 s1,s1,s2
        0x0800244c:    4770        pG      BX       lr
    $d
        0x0800244e:    0000        ..      DCW    0
        0x08002450:    40490fdb    ..I@    DCD    1078530011
        0x08002454:    4f000000    ...O    DCD    1325400064
        0x08002458:    40020c00    ...@    DCD    1073875968
        0x0800245c:    30000000    ...0    DCD    805306368
    $t
    i.Hardware_MCStartOrStop
    Hardware_MCStartOrStop
        0x08002460:    480b        .H      LDR      r0,[pc,#44] ; [0x8002490] = 0x48000400
        0x08002462:    6900        .i      LDR      r0,[r0,#0x10]
        0x08002464:    f04f0100    O...    MOV      r1,#0
        0x08002468:    f0100f40    ..@.    TST      r0,#0x40
        0x0800246c:    4809        .H      LDR      r0,[pc,#36] ; [0x8002494] = 0x200000bc
        0x0800246e:    bf18        ..      IT       NE
        0x08002470:    8081        ..      STRHNE   r1,[r0,#4]
        0x08002472:    d10b        ..      BNE      0x800248c ; Hardware_MCStartOrStop + 44
        0x08002474:    8882        ..      LDRH     r2,[r0,#4]
        0x08002476:    1c52        R.      ADDS     r2,r2,#1
        0x08002478:    b292        ..      UXTH     r2,r2
        0x0800247a:    8082        ..      STRH     r2,[r0,#4]
        0x0800247c:    f5b27f96    ....    CMP      r2,#0x12c
        0x08002480:    d904        ..      BLS      0x800248c ; Hardware_MCStartOrStop + 44
        0x08002482:    8081        ..      STRH     r1,[r0,#4]
        0x08002484:    7801        .x      LDRB     r1,[r0,#0]
        0x08002486:    f0810101    ....    EOR      r1,r1,#1
        0x0800248a:    7001        .p      STRB     r1,[r0,#0]
        0x0800248c:    7800        .x      LDRB     r0,[r0,#0]
        0x0800248e:    4770        pG      BX       lr
    $d
        0x08002490:    48000400    ...H    DCD    1207960576
        0x08002494:    200000bc    ...     DCD    536871100
    $t
    i.Hardware_PerformanceTaskEvent
    Hardware_PerformanceTaskEvent
        0x08002498:    480d        .H      LDR      r0,[pc,#52] ; [0x80024d0] = 0x20000098
        0x0800249a:    6801        .h      LDR      r1,[r0,#0]
        0x0800249c:    480d        .H      LDR      r0,[pc,#52] ; [0x80024d4] = 0x200000c8
        0x0800249e:    ed910a0f    ....    VLDR     s0,[r1,#0x3c]
        0x080024a2:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080024a6:    ed910a07    ....    VLDR     s0,[r1,#0x1c]
        0x080024aa:    ed800a01    ....    VSTR     s0,[r0,#4]
        0x080024ae:    ed910a08    ....    VLDR     s0,[r1,#0x20]
        0x080024b2:    4909        .I      LDR      r1,[pc,#36] ; [0x80024d8] = 0x2000008c
        0x080024b4:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x080024b8:    6809        .h      LDR      r1,[r1,#0]
        0x080024ba:    ed910a02    ....    VLDR     s0,[r1,#8]
        0x080024be:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080024c2:    ed910a03    ....    VLDR     s0,[r1,#0xc]
        0x080024c6:    2118        .!      MOVS     r1,#0x18
        0x080024c8:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x080024cc:    f7feb8ae    ....    B        CDC_Transmit_FS ; 0x800062c
    $d
        0x080024d0:    20000098    ...     DCD    536871064
        0x080024d4:    200000c8    ...     DCD    536871112
        0x080024d8:    2000008c    ...     DCD    536871052
    $t
    i.Hardware_SafatyTaskEvent
    Hardware_SafatyTaskEvent
        0x080024dc:    e92d01f0    -...    PUSH     {r4-r8}
        0x080024e0:    4a50        PJ      LDR      r2,[pc,#320] ; [0x8002624] = 0x200000bc
        0x080024e2:    f44f707a    O.zp    MOV      r0,#0x3e8
        0x080024e6:    6895        .h      LDR      r5,[r2,#8]
        0x080024e8:    fbb5f1f0    ....    UDIV     r1,r5,r0
        0x080024ec:    fb005011    ...P    MLS      r0,r0,r1,r5
        0x080024f0:    2800        .(      CMP      r0,#0
        0x080024f2:    d146        F.      BNE      0x8002582 ; Hardware_SafatyTaskEvent + 166
        0x080024f4:    484c        LH      LDR      r0,[pc,#304] ; [0x8002628] = 0x40005400
        0x080024f6:    6841        Ah      LDR      r1,[r0,#4]
        0x080024f8:    f4415100    A..Q    ORR      r1,r1,#0x2000
        0x080024fc:    6041        A`      STR      r1,[r0,#4]
        0x080024fe:    484b        KH      LDR      r0,[pc,#300] ; [0x800262c] = 0x20000000
        0x08002500:    8801        ..      LDRH     r1,[r0,#0]
        0x08002502:    8800        ..      LDRH     r0,[r0,#0]
        0x08002504:    0a09        ..      LSRS     r1,r1,#8
        0x08002506:    ea412000    A..     ORR      r0,r1,r0,LSL #8
        0x0800250a:    b200        ..      SXTH     r0,r0
        0x0800250c:    1140        @.      ASRS     r0,r0,#5
        0x0800250e:    ee000a10    ....    VMOV     s0,r0
        0x08002512:    4847        GH      LDR      r0,[pc,#284] ; [0x8002630] = 0x20000098
        0x08002514:    eef40a00    ....    VMOV.F32 s1,#0.12500000
        0x08002518:    eeb80ac0    ....    VCVT.F32.S32 s0,s0
        0x0800251c:    6800        .h      LDR      r0,[r0,#0]
        0x0800251e:    4b45        EK      LDR      r3,[pc,#276] ; [0x8002634] = 0x42820000
        0x08002520:    4945        EI      LDR      r1,[pc,#276] ; [0x8002638] = 0x48000800
        0x08002522:    ee200a20     . .    VMUL.F32 s0,s0,s1
        0x08002526:    ed800a0c    ....    VSTR     s0,[r0,#0x30]
        0x0800252a:    ee100a10    ....    VMOV     r0,s0
        0x0800252e:    4298        .B      CMP      r0,r3
        0x08002530:    dd1e        ..      BLE      0x8002570 ; Hardware_SafatyTaskEvent + 148
        0x08002532:    4842        BH      LDR      r0,[pc,#264] ; [0x800263c] = 0x40012c00
        0x08002534:    6c43        Cl      LDR      r3,[r0,#0x44]
        0x08002536:    f4234300    #..C    BIC      r3,r3,#0x8000
        0x0800253a:    6443        Cd      STR      r3,[r0,#0x44]
        0x0800253c:    6a03        .j      LDR      r3,[r0,#0x20]
        0x0800253e:    f0230301    #...    BIC      r3,r3,#1
        0x08002542:    6203        .b      STR      r3,[r0,#0x20]
        0x08002544:    6a03        .j      LDR      r3,[r0,#0x20]
        0x08002546:    f0230304    #...    BIC      r3,r3,#4
        0x0800254a:    6203        .b      STR      r3,[r0,#0x20]
        0x0800254c:    6a03        .j      LDR      r3,[r0,#0x20]
        0x0800254e:    f0230310    #...    BIC      r3,r3,#0x10
