ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08002552:    6203        .b      STR      r3,[r0,#0x20]
        0x08002554:    6a03        .j      LDR      r3,[r0,#0x20]
        0x08002556:    f0230340    #.@.    BIC      r3,r3,#0x40
        0x0800255a:    6203        .b      STR      r3,[r0,#0x20]
        0x0800255c:    6a03        .j      LDR      r3,[r0,#0x20]
        0x0800255e:    f4237380    #..s    BIC      r3,r3,#0x100
        0x08002562:    6203        .b      STR      r3,[r0,#0x20]
        0x08002564:    6a03        .j      LDR      r3,[r0,#0x20]
        0x08002566:    f4236380    #..c    BIC      r3,r3,#0x400
        0x0800256a:    6203        .b      STR      r3,[r0,#0x20]
        0x0800256c:    2001        .       MOVS     r0,#1
        0x0800256e:    6188        .a      STR      r0,[r1,#0x18]
        0x08002570:    6948        Hi      LDR      r0,[r1,#0x14]
        0x08002572:    f44f5300    O..S    MOV      r3,#0x2000
        0x08002576:    4383        .C      BICS     r3,r3,r0
        0x08002578:    f4005000    ...P    AND      r0,r0,#0x2000
        0x0800257c:    ea434000    C..@    ORR      r0,r3,r0,LSL #16
        0x08002580:    6188        .a      STR      r0,[r1,#0x18]
        0x08002582:    8850        P.      LDRH     r0,[r2,#2]
        0x08002584:    492e        .I      LDR      r1,[pc,#184] ; [0x8002640] = 0xaaaaaaab
        0x08002586:    fba1c300    ....    UMULL    r12,r3,r1,r0
        0x0800258a:    08db        ..      LSRS     r3,r3,#3
        0x0800258c:    eba30383    ....    SUB      r3,r3,r3,LSL #2
        0x08002590:    eb000783    ....    ADD      r7,r0,r3,LSL #2
        0x08002594:    1c43        C.      ADDS     r3,r0,#1
        0x08002596:    fba14c03    ...L    UMULL    r4,r12,r1,r3
        0x0800259a:    ea4f0cdc    O...    LSR      r12,r12,#3
        0x0800259e:    ebac0c8c    ....    SUB      r12,r12,r12,LSL #2
        0x080025a2:    eb03068c    ....    ADD      r6,r3,r12,LSL #2
        0x080025a6:    1c83        ..      ADDS     r3,r0,#2
        0x080025a8:    fba14c03    ...L    UMULL    r4,r12,r1,r3
        0x080025ac:    ea4f0cdc    O...    LSR      r12,r12,#3
        0x080025b0:    ebac0c8c    ....    SUB      r12,r12,r12,LSL #2
        0x080025b4:    eb03048c    ....    ADD      r4,r3,r12,LSL #2
        0x080025b8:    1cc3        ..      ADDS     r3,r0,#3
        0x080025ba:    fba1c103    ....    UMULL    r12,r1,r1,r3
        0x080025be:    08c9        ..      LSRS     r1,r1,#3
        0x080025c0:    eba10181    ....    SUB      r1,r1,r1,LSL #2
        0x080025c4:    eb030881    ....    ADD      r8,r3,r1,LSL #2
        0x080025c8:    491e        .I      LDR      r1,[pc,#120] ; [0x8002644] = 0x20001778
        0x080025ca:    5dcb        .]      LDRB     r3,[r1,r7]
        0x080025cc:    2b53        S+      CMP      r3,#0x53
        0x080025ce:    bf01        ..      ITTTT    EQ
        0x080025d0:    5d8b        .]      LDRBEQ   r3,[r1,r6]
        0x080025d2:    2b3a        :+      CMPEQ    r3,#0x3a
        0x080025d4:    f8113008    ...0    LDRBEQ   r3,[r1,r8]
        0x080025d8:    2b0a        .+      CMPEQ    r3,#0xa
        0x080025da:    d11b        ..      BNE      0x8002614 ; Hardware_SafatyTaskEvent + 312
        0x080025dc:    4b1a        .K      LDR      r3,[pc,#104] ; [0x8002648] = 0x200000ac
        0x080025de:    f811c004    ....    LDRB     r12,[r1,r4]
        0x080025e2:    681b        .h      LDR      r3,[r3,#0]
        0x080025e4:    f1bc0fc9    ....    CMP      r12,#0xc9
        0x080025e8:    bf24        $.      ITT      CS
        0x080025ea:    ed930a00    ....    VLDRCS   s0,[r3,#0]
        0x080025ee:    eeb10a40    ..@.    VNEGCS.F32 s0,s0
        0x080025f2:    d207        ..      BCS      0x8002604 ; Hardware_SafatyTaskEvent + 296
        0x080025f4:    ee00ca10    ....    VMOV     s0,r12
        0x080025f8:    eddf0a14    ....    VLDR     s1,[pc,#80] ; [0x800264c] = 0x40c90fdb
        0x080025fc:    eeb80a40    ..@.    VCVT.F32.U32 s0,s0
        0x08002600:    ee200a20     . .    VMUL.F32 s0,s0,s1
        0x08002604:    ed830a00    ....    VSTR     s0,[r3,#0]
        0x08002608:    2300        .#      MOVS     r3,#0
        0x0800260a:    558b        .U      STRB     r3,[r1,r6]
        0x0800260c:    55cb        .U      STRB     r3,[r1,r7]
        0x0800260e:    f8013008    ...0    STRB     r3,[r1,r8]
        0x08002612:    550b        .U      STRB     r3,[r1,r4]
        0x08002614:    1c40        @.      ADDS     r0,r0,#1
        0x08002616:    8050        P.      STRH     r0,[r2,#2]
        0x08002618:    1c68        h.      ADDS     r0,r5,#1
        0x0800261a:    6090        .`      STR      r0,[r2,#8]
        0x0800261c:    e8bd01f0    ....    POP      {r4-r8}
        0x08002620:    4770        pG      BX       lr
    $d
        0x08002622:    0000        ..      DCW    0
        0x08002624:    200000bc    ...     DCD    536871100
        0x08002628:    40005400    .T.@    DCD    1073763328
        0x0800262c:    20000000    ...     DCD    536870912
        0x08002630:    20000098    ...     DCD    536871064
        0x08002634:    42820000    ...B    DCD    1115815936
        0x08002638:    48000800    ...H    DCD    1207961600
        0x0800263c:    40012c00    .,.@    DCD    1073818624
        0x08002640:    aaaaaaab    ....    DCD    2863311531
        0x08002644:    20001778    x..     DCD    536876920
        0x08002648:    200000ac    ...     DCD    536871084
        0x0800264c:    40c90fdb    ...@    DCD    1086918619
    $t
    i.Hardware_SetABZCounter
    Hardware_SetABZCounter
        0x08002650:    4901        .I      LDR      r1,[pc,#4] ; [0x8002658] = 0x40000400
        0x08002652:    6248        Hb      STR      r0,[r1,#0x24]
        0x08002654:    4770        pG      BX       lr
    $d
        0x08002656:    0000        ..      DCW    0
        0x08002658:    40000400    ...@    DCD    1073742848
    $t
    i.Hardware_SetCCR
    Hardware_SetCCR
        0x0800265c:    4b02        .K      LDR      r3,[pc,#8] ; [0x8002668] = 0x40012c00
        0x0800265e:    6358        Xc      STR      r0,[r3,#0x34]
        0x08002660:    6399        .c      STR      r1,[r3,#0x38]
        0x08002662:    63da        .c      STR      r2,[r3,#0x3c]
        0x08002664:    4770        pG      BX       lr
    $d
        0x08002666:    0000        ..      DCW    0
        0x08002668:    40012c00    .,.@    DCD    1073818624
    $t
    i.Hardware_SetPulseCounter
    Hardware_SetPulseCounter
        0x0800266c:    4901        .I      LDR      r1,[pc,#4] ; [0x8002674] = 0x40014400
        0x0800266e:    6248        Hb      STR      r0,[r1,#0x24]
        0x08002670:    4770        pG      BX       lr
    $d
        0x08002672:    0000        ..      DCW    0
        0x08002674:    40014400    .D.@    DCD    1073824768
    $t
    i.Hardware_StartPWM
    Hardware_StartPWM
        0x08002678:    4810        .H      LDR      r0,[pc,#64] ; [0x80026bc] = 0x40012c00
        0x0800267a:    6a01        .j      LDR      r1,[r0,#0x20]
        0x0800267c:    f0410101    A...    ORR      r1,r1,#1
        0x08002680:    6201        .b      STR      r1,[r0,#0x20]
        0x08002682:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08002684:    f0410104    A...    ORR      r1,r1,#4
        0x08002688:    6201        .b      STR      r1,[r0,#0x20]
        0x0800268a:    6a01        .j      LDR      r1,[r0,#0x20]
        0x0800268c:    f0410110    A...    ORR      r1,r1,#0x10
        0x08002690:    6201        .b      STR      r1,[r0,#0x20]
        0x08002692:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08002694:    f0410140    A.@.    ORR      r1,r1,#0x40
        0x08002698:    6201        .b      STR      r1,[r0,#0x20]
        0x0800269a:    6a01        .j      LDR      r1,[r0,#0x20]
        0x0800269c:    f4417180    A..q    ORR      r1,r1,#0x100
        0x080026a0:    6201        .b      STR      r1,[r0,#0x20]
        0x080026a2:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026a4:    f4416180    A..a    ORR      r1,r1,#0x400
        0x080026a8:    6201        .b      STR      r1,[r0,#0x20]
        0x080026aa:    6c41        Al      LDR      r1,[r0,#0x44]
        0x080026ac:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x080026b0:    6441        Ad      STR      r1,[r0,#0x44]
        0x080026b2:    4903        .I      LDR      r1,[pc,#12] ; [0x80026c0] = 0x48000800
        0x080026b4:    2001        .       MOVS     r0,#1
        0x080026b6:    6288        .b      STR      r0,[r1,#0x28]
        0x080026b8:    4770        pG      BX       lr
    $d
        0x080026ba:    0000        ..      DCW    0
        0x080026bc:    40012c00    .,.@    DCD    1073818624
        0x080026c0:    48000800    ...H    DCD    1207961600
    $t
    i.Hardware_StopPWM
    Hardware_StopPWM
        0x080026c4:    4810        .H      LDR      r0,[pc,#64] ; [0x8002708] = 0x40012c00
        0x080026c6:    6c41        Al      LDR      r1,[r0,#0x44]
        0x080026c8:    f4214100    !..A    BIC      r1,r1,#0x8000
        0x080026cc:    6441        Ad      STR      r1,[r0,#0x44]
        0x080026ce:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026d0:    f0210101    !...    BIC      r1,r1,#1
        0x080026d4:    6201        .b      STR      r1,[r0,#0x20]
        0x080026d6:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026d8:    f0210104    !...    BIC      r1,r1,#4
        0x080026dc:    6201        .b      STR      r1,[r0,#0x20]
        0x080026de:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026e0:    f0210110    !...    BIC      r1,r1,#0x10
        0x080026e4:    6201        .b      STR      r1,[r0,#0x20]
        0x080026e6:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026e8:    f0210140    !.@.    BIC      r1,r1,#0x40
        0x080026ec:    6201        .b      STR      r1,[r0,#0x20]
        0x080026ee:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026f0:    f4217180    !..q    BIC      r1,r1,#0x100
        0x080026f4:    6201        .b      STR      r1,[r0,#0x20]
        0x080026f6:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080026f8:    f4216180    !..a    BIC      r1,r1,#0x400
        0x080026fc:    6201        .b      STR      r1,[r0,#0x20]
        0x080026fe:    4903        .I      LDR      r1,[pc,#12] ; [0x800270c] = 0x48000800
        0x08002700:    2001        .       MOVS     r0,#1
        0x08002702:    6188        .a      STR      r0,[r1,#0x18]
        0x08002704:    4770        pG      BX       lr
    $d
        0x08002706:    0000        ..      DCW    0
        0x08002708:    40012c00    .,.@    DCD    1073818624
        0x0800270c:    48000800    ...H    DCD    1207961600
    $t
    i.Harware_GetCurrentAB
    Harware_GetCurrentAB
        0x08002710:    4815        .H      LDR      r0,[pc,#84] ; [0x8002768] = 0x50000080
        0x08002712:    6800        .h      LDR      r0,[r0,#0]
        0x08002714:    b280        ..      UXTH     r0,r0
        0x08002716:    ee000a10    ....    VMOV     s0,r0
        0x0800271a:    4814        .H      LDR      r0,[pc,#80] ; [0x800276c] = 0x50000180
        0x0800271c:    eeb80a40    ..@.    VCVT.F32.U32 s0,s0
        0x08002720:    6800        .h      LDR      r0,[r0,#0]
        0x08002722:    ed9f1a13    ....    VLDR     s2,[pc,#76] ; [0x8002770] = 0x477fff00
        0x08002726:    b280        ..      UXTH     r0,r0
        0x08002728:    ee000a90    ....    VMOV     s1,r0
        0x0800272c:    ee802a01    ...*    VDIV.F32 s4,s0,s2
        0x08002730:    eeb83a60    ..`:    VCVT.F32.U32 s6,s1
        0x08002734:    eddf0a10    ....    VLDR     s1,[pc,#64] ; [0x8002778] = 0x3fd33333
        0x08002738:    eddf1a0e    ....    VLDR     s3,[pc,#56] ; [0x8002774] = 0x40533333
        0x0800273c:    eddf2a0f    ...*    VLDR     s5,[pc,#60] ; [0x800277c] = 0x43480000
        0x08002740:    eeb00a60    ..`.    VMOV.F32 s0,s1
        0x08002744:    ee020a61    ..a.    VMLS.F32 s0,s4,s3
        0x08002748:    eeb32a04    ...*    VMOV.F32 s4,#20.00000000
        0x0800274c:    eec03a02    ...:    VDIV.F32 s7,s0,s4
        0x08002750:    ee230aa2    #...    VMUL.F32 s0,s7,s5
        0x08002754:    eec33a01    ...:    VDIV.F32 s7,s6,s2
        0x08002758:    ee430ae1    C...    VMLS.F32 s1,s7,s3
        0x0800275c:    ee801a82    ....    VDIV.F32 s2,s1,s4
        0x08002760:    ee610a22    a.".    VMUL.F32 s1,s2,s5
        0x08002764:    4770        pG      BX       lr
    $d
        0x08002766:    0000        ..      DCW    0
        0x08002768:    50000080    ...P    DCD    1342177408
        0x0800276c:    50000180    ...P    DCD    1342177664
        0x08002770:    477fff00    ...G    DCD    1199570688
        0x08002774:    40533333    33S@    DCD    1079194419
        0x08002778:    3fd33333    33.?    DCD    1070805811
        0x0800277c:    43480000    ..HC    DCD    1128792064
    $t
    i.IdCurrentPIController
    IdCurrentPIController
        0x08002780:    491c        .I      LDR      r1,[pc,#112] ; [0x80027f4] = 0x20000060
        0x08002782:    edd00a00    ....    VLDR     s1,[r0,#0]
        0x08002786:    4a1c        .J      LDR      r2,[pc,#112] ; [0x80027f8] = 0x3f8c6f2d
        0x08002788:    6809        .h      LDR      r1,[r1,#0]
        0x0800278a:    ee700ac0    p...    VSUB.F32 s1,s1,s0
        0x0800278e:    ed900a03    ....    VLDR     s0,[r0,#0xc]
        0x08002792:    ed911a06    ....    VLDR     s2,[r1,#0x18]
        0x08002796:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x0800279a:    ee101a10    ....    VMOV     r1,s0
        0x0800279e:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080027a2:    4291        .B      CMP      r1,r2
        0x080027a4:    bfc4        ..      ITT      GT
        0x080027a6:    ed9f0a15    ....    VLDRGT   s0,[pc,#84] ; [0x80027fc] = 0x3f8c6f2d
        0x080027aa:    ed800a03    ....    VSTRGT   s0,[r0,#0xc]
        0x080027ae:    dc08        ..      BGT      0x80027c2 ; IdCurrentPIController + 66
        0x080027b0:    ee101a10    ....    VMOV     r1,s0
        0x080027b4:    4a12        .J      LDR      r2,[pc,#72] ; [0x8002800] = 0xbf8c6f2d
        0x080027b6:    4291        .B      CMP      r1,r2
        0x080027b8:    bf28        (.      IT       CS
        0x080027ba:    ed9f0a12    ....    VLDRCS   s0,[pc,#72] ; [0x8002804] = 0xbf8c6f2d
        0x080027be:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080027c2:    ed9f1a11    ....    VLDR     s2,[pc,#68] ; [0x8002808] = 0x41960000
        0x080027c6:    4911        .I      LDR      r1,[pc,#68] ; [0x800280c] = 0x41a49249
        0x080027c8:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x080027cc:    eeb01a00    ....    VMOV.F32 s2,#2.00000000
        0x080027d0:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x080027d4:    ee100a10    ....    VMOV     r0,s0
        0x080027d8:    4288        .B      CMP      r0,r1
        0x080027da:    bfc4        ..      ITT      GT
        0x080027dc:    ed9f0a0c    ....    VLDRGT   s0,[pc,#48] ; [0x8002810] = 0x41a49249
        0x080027e0:    4770        pG      BXGT     lr
        0x080027e2:    ee100a10    ....    VMOV     r0,s0
        0x080027e6:    490b        .I      LDR      r1,[pc,#44] ; [0x8002814] = 0xc1a49249
        0x080027e8:    4288        .B      CMP      r0,r1
        0x080027ea:    d800        ..      BHI      0x80027ee ; IdCurrentPIController + 110
        0x080027ec:    4770        pG      BX       lr
        0x080027ee:    ed9f0a0a    ....    VLDR     s0,[pc,#40] ; [0x8002818] = 0xc1a49249
        0x080027f2:    4770        pG      BX       lr
    $d
        0x080027f4:    20000060    `..     DCD    536871008
        0x080027f8:    3f8c6f2d    -o.?    DCD    1066168109
        0x080027fc:    3f8c6f2d    -o.?    DCD    1066168109
        0x08002800:    bf8c6f2d    -o..    DCD    3213651757
        0x08002804:    bf8c6f2d    -o..    DCD    3213651757
        0x08002808:    41960000    ...A    DCD    1100349440
        0x0800280c:    41a49249    I..A    DCD    1101304393
        0x08002810:    41a49249    I..A    DCD    1101304393
        0x08002814:    c1a49249    I...    DCD    3248788041
        0x08002818:    c1a49249    I...    DCD    3248788041
    $t
    i.IncAbzCalculateRealEleAngle
    IncAbzCalculateRealEleAngle
        0x0800281c:    b510        ..      PUSH     {r4,lr}
        0x0800281e:    4604        .F      MOV      r4,r0
        0x08002820:    f7fffd5c    ..\.    BL       Hardware_GetABZCounter ; 0x80022dc
        0x08002824:    68a1        .h      LDR      r1,[r4,#8]
        0x08002826:    edd40a04    ....    VLDR     s1,[r4,#0x10]
        0x0800282a:    fbb0f2f1    ....    UDIV     r2,r0,r1
        0x0800282e:    fb010012    ....    MLS      r0,r1,r2,r0
        0x08002832:    ee000a10    ....    VMOV     s0,r0
        0x08002836:    eeb80ac0    ....    VCVT.F32.S32 s0,s0
        0x0800283a:    ee801a20    .. .    VDIV.F32 s2,s0,s1
        0x0800283e:    ed9f0a03    ....    VLDR     s0,[pc,#12] ; [0x800284c] = 0x40490fdb
        0x08002842:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08002846:    ee110a20    .. .    VNMLS.F32 s0,s2,s1
        0x0800284a:    bd10        ..      POP      {r4,pc}
    $d
        0x0800284c:    40490fdb    ..I@    DCD    1078530011
    $t
    i.IncAbzCalculateRealEleSpeed
    IncAbzCalculateRealEleSpeed
        0x08002850:    b570        p.      PUSH     {r4-r6,lr}
        0x08002852:    4605        .F      MOV      r5,r0
        0x08002854:    ed2d8b02    -...    VPUSH    {d8}
        0x08002858:    eeb08a40    ..@.    VMOV.F32 s16,s0
        0x0800285c:    6986        .i      LDR      r6,[r0,#0x18]
        0x0800285e:    f7fffd3d    ..=.    BL       Hardware_GetABZCounter ; 0x80022dc
        0x08002862:    4604        .F      MOV      r4,r0
        0x08002864:    f7fffdce    ....    BL       Hardware_GetPulseCounter ; 0x8002404
        0x08002868:    ee080a90    ....    VMOV     s17,r0
        0x0800286c:    2000        .       MOVS     r0,#0
        0x0800286e:    f7fffefd    ....    BL       Hardware_SetPulseCounter ; 0x800266c
        0x08002872:    4b3f        ?K      LDR      r3,[pc,#252] ; [0x8002970] = 0x20000680
        0x08002874:    1ba0        ..      SUBS     r0,r4,r6
        0x08002876:    685a        Zh      LDR      r2,[r3,#4]
        0x08002878:    4251        QB      RSBS     r1,r2,#0
        0x0800287a:    ea4f7ce1    O..|    ASR      r12,r1,#31
        0x0800287e:    eb017c9c    ...|    ADD      r12,r1,r12,LSR #30
        0x08002882:    493c        <I      LDR      r1,[pc,#240] ; [0x8002974] = 0x20000040
        0x08002884:    ebb00fac    ....    CMP      r0,r12,ASR #2
        0x08002888:    dd07        ..      BLE      0x800289a ; IncAbzCalculateRealEleSpeed + 74
        0x0800288a:    ea4f7ce2    O..|    ASR      r12,r2,#31
        0x0800288e:    eb02729c    ...r    ADD      r2,r2,r12,LSR #30
        0x08002892:    ebb00fa2    ....    CMP      r0,r2,ASR #2
        0x08002896:    bfb8        ..      IT       LT
        0x08002898:    60c8        .`      STRLT    r0,[r1,#0xc]
        0x0800289a:    4837        7H      LDR      r0,[pc,#220] ; [0x8002978] = 0x20000094
        0x0800289c:    eeb58ac0    ....    VCMPE.F32 s16,#0.0
        0x080028a0:    6800        .h      LDR      r0,[r0,#0]
        0x080028a2:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x080028a6:    6184        .a      STR      r4,[r0,#0x18]
        0x080028a8:    bf38        8.      IT       CC
        0x080028aa:    eeb18a48    ..H.    VNEGCC.F32 s16,s16
        0x080028ae:    780a        .x      LDRB     r2,[r1,#0]
        0x080028b0:    ed9f0a32    ..2.    VLDR     s0,[pc,#200] ; [0x800297c] = 0x3dcccccd
        0x080028b4:    eddf0a32    ..2.    VLDR     s1,[pc,#200] ; [0x8002980] = 0x3f666666
        0x080028b8:    2a00        .*      CMP      r2,#0
        0x080028ba:    d03f        ?.      BEQ      0x800293c ; IncAbzCalculateRealEleSpeed + 236
        0x080028bc:    ed931a01    ....    VLDR     s2,[r3,#4]
        0x080028c0:    4b30        0K      LDR      r3,[pc,#192] ; [0x8002984] = 0x20000060
        0x080028c2:    eef81a68    ..h.    VCVT.F32.U32 s3,s17
        0x080028c6:    eeb81ac1    ....    VCVT.F32.S32 s2,s2
        0x080028ca:    681b        .h      LDR      r3,[r3,#0]
        0x080028cc:    ed9f2a2f    ../*    VLDR     s4,[pc,#188] ; [0x800298c] = 0x40c90fdb
        0x080028d0:    ee211a21    !.!.    VMUL.F32 s2,s2,s3
        0x080028d4:    edd31a07    ....    VLDR     s3,[r3,#0x1c]
        0x080028d8:    4b2b        +K      LDR      r3,[pc,#172] ; [0x8002988] = 0x20000090
        0x080028da:    ee611a21    a.!.    VMUL.F32 s3,s2,s3
        0x080028de:    681b        .h      LDR      r3,[r3,#0]
        0x080028e0:    781b        .x      LDRB     r3,[r3,#0]
        0x080028e2:    ee013a10    ...:    VMOV     s2,r3
        0x080028e6:    eeb81a41    ..A.    VCVT.F32.U32 s2,s2
        0x080028ea:    ee212a02    !..*    VMUL.F32 s4,s2,s4
        0x080028ee:    ee821a21    ..!.    VDIV.F32 s2,s4,s3
        0x080028f2:    edd11a02    ....    VLDR     s3,[r1,#8]
        0x080028f6:    ee211a00    !...    VMUL.F32 s2,s2,s0
        0x080028fa:    ee011aa0    ....    VMLA.F32 s2,s3,s1
        0x080028fe:    ed811a02    ....    VSTR     s2,[r1,#8]
        0x08002902:    edd11a03    ....    VLDR     s3,[r1,#0xc]
        0x08002906:    eef81ae1    ....    VCVT.F32.S32 s3,s3
        0x0800290a:    ee211a81    !...    VMUL.F32 s2,s3,s2
        0x0800290e:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x08002912:    ed911a01    ....    VLDR     s2,[r1,#4]
        0x08002916:    ee010a20    .. .    VMLA.F32 s0,s2,s1
        0x0800291a:    ed810a01    ....    VSTR     s0,[r1,#4]
        0x0800291e:    ed900a0a    ....    VLDR     s0,[r0,#0x28]
        0x08002922:    eeb40ac8    ....    VCMPE.F32 s0,s16
        0x08002926:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x0800292a:    bf38        8.      IT       CC
        0x0800292c:    43d0        .C      MVNCC    r0,r2
        0x0800292e:    d200        ..      BCS      0x8002932 ; IncAbzCalculateRealEleSpeed + 226
        0x08002930:    7008        .p      STRB     r0,[r1,#0]
        0x08002932:    ed910a01    ....    VLDR     s0,[r1,#4]
        0x08002936:    ecbd8b02    ....    VPOP     {d8}
        0x0800293a:    bd70        p.      POP      {r4-r6,pc}
        0x0800293c:    ed911a03    ....    VLDR     s2,[r1,#0xc]
        0x08002940:    edd51a03    ....    VLDR     s3,[r5,#0xc]
        0x08002944:    eeb81ac1    ....    VCVT.F32.S32 s2,s2
        0x08002948:    ee211a81    !...    VMUL.F32 s2,s3,s2
        0x0800294c:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x08002950:    ed911a01    ....    VLDR     s2,[r1,#4]
        0x08002954:    ee010a20    .. .    VMLA.F32 s0,s2,s1
        0x08002958:    ed810a01    ....    VSTR     s0,[r1,#4]
        0x0800295c:    ed900a09    ....    VLDR     s0,[r0,#0x24]
        0x08002960:    eeb40ac8    ....    VCMPE.F32 s0,s16
        0x08002964:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08002968:    bfc8        ..      IT       GT
        0x0800296a:    20ff        .       MOVGT    r0,#0xff
        0x0800296c:    dde1        ..      BLE      0x8002932 ; IncAbzCalculateRealEleSpeed + 226
        0x0800296e:    e7df        ..      B        0x8002930 ; IncAbzCalculateRealEleSpeed + 224
    $d
        0x08002970:    20000680    ...     DCD    536872576
        0x08002974:    20000040    @..     DCD    536870976
        0x08002978:    20000094    ...     DCD    536871060
        0x0800297c:    3dcccccd    ...=    DCD    1036831949
        0x08002980:    3f666666    fff?    DCD    1063675494
        0x08002984:    20000060    `..     DCD    536871008
        0x08002988:    20000090    ...     DCD    536871056
        0x0800298c:    40c90fdb    ...@    DCD    1086918619
    $t
    i.IqCurrentPIController
    IqCurrentPIController
