ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08002990:    491c        .I      LDR      r1,[pc,#112] ; [0x8002a04] = 0x20000060
        0x08002992:    edd00a00    ....    VLDR     s1,[r0,#0]
        0x08002996:    4a1c        .J      LDR      r2,[pc,#112] ; [0x8002a08] = 0x3f8c6f2d
        0x08002998:    6809        .h      LDR      r1,[r1,#0]
        0x0800299a:    ee700ac0    p...    VSUB.F32 s1,s1,s0
        0x0800299e:    ed900a03    ....    VLDR     s0,[r0,#0xc]
        0x080029a2:    ed911a06    ....    VLDR     s2,[r1,#0x18]
        0x080029a6:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x080029aa:    ee101a10    ....    VMOV     r1,s0
        0x080029ae:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080029b2:    4291        .B      CMP      r1,r2
        0x080029b4:    bfc4        ..      ITT      GT
        0x080029b6:    ed9f0a15    ....    VLDRGT   s0,[pc,#84] ; [0x8002a0c] = 0x3f8c6f2d
        0x080029ba:    ed800a03    ....    VSTRGT   s0,[r0,#0xc]
        0x080029be:    dc08        ..      BGT      0x80029d2 ; IqCurrentPIController + 66
        0x080029c0:    ee101a10    ....    VMOV     r1,s0
        0x080029c4:    4a12        .J      LDR      r2,[pc,#72] ; [0x8002a10] = 0xbf8c6f2d
        0x080029c6:    4291        .B      CMP      r1,r2
        0x080029c8:    bf28        (.      IT       CS
        0x080029ca:    ed9f0a12    ....    VLDRCS   s0,[pc,#72] ; [0x8002a14] = 0xbf8c6f2d
        0x080029ce:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080029d2:    ed9f1a11    ....    VLDR     s2,[pc,#68] ; [0x8002a18] = 0x41960000
        0x080029d6:    4911        .I      LDR      r1,[pc,#68] ; [0x8002a1c] = 0x41a49249
        0x080029d8:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x080029dc:    eeb01a00    ....    VMOV.F32 s2,#2.00000000
        0x080029e0:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x080029e4:    ee100a10    ....    VMOV     r0,s0
        0x080029e8:    4288        .B      CMP      r0,r1
        0x080029ea:    bfc4        ..      ITT      GT
        0x080029ec:    ed9f0a0c    ....    VLDRGT   s0,[pc,#48] ; [0x8002a20] = 0x41a49249
        0x080029f0:    4770        pG      BXGT     lr
        0x080029f2:    ee100a10    ....    VMOV     r0,s0
        0x080029f6:    490b        .I      LDR      r1,[pc,#44] ; [0x8002a24] = 0xc1a49249
        0x080029f8:    4288        .B      CMP      r0,r1
        0x080029fa:    d800        ..      BHI      0x80029fe ; IqCurrentPIController + 110
        0x080029fc:    4770        pG      BX       lr
        0x080029fe:    ed9f0a0a    ....    VLDR     s0,[pc,#40] ; [0x8002a28] = 0xc1a49249
        0x08002a02:    4770        pG      BX       lr
    $d
        0x08002a04:    20000060    `..     DCD    536871008
        0x08002a08:    3f8c6f2d    -o.?    DCD    1066168109
        0x08002a0c:    3f8c6f2d    -o.?    DCD    1066168109
        0x08002a10:    bf8c6f2d    -o..    DCD    3213651757
        0x08002a14:    bf8c6f2d    -o..    DCD    3213651757
        0x08002a18:    41960000    ...A    DCD    1100349440
        0x08002a1c:    41a49249    I..A    DCD    1101304393
        0x08002a20:    41a49249    I..A    DCD    1101304393
        0x08002a24:    c1a49249    I...    DCD    3248788041
        0x08002a28:    c1a49249    I...    DCD    3248788041
    $t
    i.LL_ADC_CommonInit
    LL_ADC_CommonInit
        0x08002a2c:    b410        ..      PUSH     {r4}
        0x08002a2e:    f04f4ca0    O..L    MOV      r12,#0x50000000
        0x08002a32:    684a        Jh      LDR      r2,[r1,#4]
        0x08002a34:    f8dc4008    ...@    LDR      r4,[r12,#8]
        0x08002a38:    2300        .#      MOVS     r3,#0
        0x08002a3a:    f8dcc108    ....    LDR      r12,[r12,#0x108]
        0x08002a3e:    ea440c0c    D...    ORR      r12,r4,r12
        0x08002a42:    f01c0f01    ....    TST      r12,#1
        0x08002a46:    bf18        ..      IT       NE
        0x08002a48:    2301        .#      MOVNE    r3,#1
        0x08002a4a:    d002        ..      BEQ      0x8002a52 ; LL_ADC_CommonInit + 38
        0x08002a4c:    bc10        ..      POP      {r4}
        0x08002a4e:    4618        .F      MOV      r0,r3
        0x08002a50:    4770        pG      BX       lr
        0x08002a52:    f8dfc028    ..(.    LDR      r12,[pc,#40] ; [0x8002a7c] = 0xffc030e0
        0x08002a56:    b152        R.      CBZ      r2,0x8002a6e ; LL_ADC_CommonInit + 66
        0x08002a58:    680c        .h      LDR      r4,[r1,#0]
        0x08002a5a:    4322        "C      ORRS     r2,r2,r4
        0x08002a5c:    e9d14102    ...A    LDRD     r4,r1,[r1,#8]
        0x08002a60:    4321        !C      ORRS     r1,r1,r4
        0x08002a62:    4311        .C      ORRS     r1,r1,r2
        0x08002a64:    6882        .h      LDR      r2,[r0,#8]
        0x08002a66:    ea02020c    ....    AND      r2,r2,r12
        0x08002a6a:    4311        .C      ORRS     r1,r1,r2
        0x08002a6c:    e004        ..      B        0x8002a78 ; LL_ADC_CommonInit + 76
        0x08002a6e:    6882        .h      LDR      r2,[r0,#8]
        0x08002a70:    6809        .h      LDR      r1,[r1,#0]
        0x08002a72:    ea02020c    ....    AND      r2,r2,r12
        0x08002a76:    4311        .C      ORRS     r1,r1,r2
        0x08002a78:    6081        .`      STR      r1,[r0,#8]
        0x08002a7a:    e7e7        ..      B        0x8002a4c ; LL_ADC_CommonInit + 32
    $d
        0x08002a7c:    ffc030e0    .0..    DCD    4290785504
    $t
    i.LL_ADC_INJ_Init
    LL_ADC_INJ_Init
        0x08002a80:    684b        Kh      LDR      r3,[r1,#4]
        0x08002a82:    f8d0c008    ....    LDR      r12,[r0,#8]
        0x08002a86:    2200        ."      MOVS     r2,#0
        0x08002a88:    f01c0f01    ....    TST      r12,#1
        0x08002a8c:    bf18        ..      IT       NE
        0x08002a8e:    2201        ."      MOVNE    r2,#1
        0x08002a90:    d001        ..      BEQ      0x8002a96 ; LL_ADC_INJ_Init + 22
        0x08002a92:    4610        .F      MOV      r0,r2
        0x08002a94:    4770        pG      BX       lr
        0x08002a96:    b15b        [.      CBZ      r3,0x8002ab0 ; LL_ADC_INJ_Init + 48
        0x08002a98:    e9d13c02    ...<    LDRD     r3,r12,[r1,#8]
        0x08002a9c:    ea43030c    C...    ORR      r3,r3,r12
        0x08002aa0:    f8d0c00c    ....    LDR      r12,[r0,#0xc]
        0x08002aa4:    f02c7c04    ,..|    BIC      r12,r12,#0x2100000
        0x08002aa8:    ea43030c    C...    ORR      r3,r3,r12
        0x08002aac:    60c3        .`      STR      r3,[r0,#0xc]
        0x08002aae:    e007        ..      B        0x8002ac0 ; LL_ADC_INJ_Init + 64
        0x08002ab0:    68c3        .h      LDR      r3,[r0,#0xc]
        0x08002ab2:    f8d1c00c    ....    LDR      r12,[r1,#0xc]
        0x08002ab6:    f0237304    #..s    BIC      r3,r3,#0x2100000
        0x08002aba:    ea43030c    C...    ORR      r3,r3,r12
        0x08002abe:    60c3        .`      STR      r3,[r0,#0xc]
        0x08002ac0:    e9d13100    ...1    LDRD     r3,r1,[r1,#0]
        0x08002ac4:    430b        .C      ORRS     r3,r3,r1
        0x08002ac6:    6cc1        .l      LDR      r1,[r0,#0x4c]
        0x08002ac8:    f36f0108    o...    BFC      r1,#0,#9
        0x08002acc:    4319        .C      ORRS     r1,r1,r3
        0x08002ace:    64c1        .d      STR      r1,[r0,#0x4c]
        0x08002ad0:    e7df        ..      B        0x8002a92 ; LL_ADC_INJ_Init + 18
    i.LL_ADC_Init
    LL_ADC_Init
        0x08002ad2:    6883        .h      LDR      r3,[r0,#8]
        0x08002ad4:    2200        ."      MOVS     r2,#0
        0x08002ad6:    f0130f01    ....    TST      r3,#1
        0x08002ada:    bf18        ..      IT       NE
        0x08002adc:    2201        ."      MOVNE    r2,#1
        0x08002ade:    d001        ..      BEQ      0x8002ae4 ; LL_ADC_Init + 18
        0x08002ae0:    4610        .F      MOV      r0,r2
        0x08002ae2:    4770        pG      BX       lr
        0x08002ae4:    e9d13c00    ...<    LDRD     r3,r12,[r1,#0]
        0x08002ae8:    ea43030c    C...    ORR      r3,r3,r12
        0x08002aec:    6889        .h      LDR      r1,[r1,#8]
        0x08002aee:    f8d0c00c    ....    LDR      r12,[r0,#0xc]
        0x08002af2:    f02c0c18    ,...    BIC      r12,r12,#0x18
        0x08002af6:    f42c4c40    ,.@L    BIC      r12,r12,#0xc000
        0x08002afa:    ea41010c    A...    ORR      r1,r1,r12
        0x08002afe:    4319        .C      ORRS     r1,r1,r3
        0x08002b00:    60c1        .`      STR      r1,[r0,#0xc]
        0x08002b02:    e7ed        ..      B        0x8002ae0 ; LL_ADC_Init + 14
    i.LL_ADC_REG_Init
    LL_ADC_REG_Init
        0x08002b04:    b430        0.      PUSH     {r4,r5}
        0x08002b06:    684b        Kh      LDR      r3,[r1,#4]
        0x08002b08:    f8d0c008    ....    LDR      r12,[r0,#8]
        0x08002b0c:    2200        ."      MOVS     r2,#0
        0x08002b0e:    f01c0f01    ....    TST      r12,#1
        0x08002b12:    bf18        ..      IT       NE
        0x08002b14:    2201        ."      MOVNE    r2,#1
        0x08002b16:    d002        ..      BEQ      0x8002b1e ; LL_ADC_REG_Init + 26
        0x08002b18:    bc30        0.      POP      {r4,r5}
        0x08002b1a:    4610        .F      MOV      r0,r2
        0x08002b1c:    4770        pG      BX       lr
        0x08002b1e:    2b00        .+      CMP      r3,#0
        0x08002b20:    f8dfc048    ..H.    LDR      r12,[pc,#72] ; [0x8002b6c] = 0xfff0c01c
        0x08002b24:    680b        .h      LDR      r3,[r1,#0]
        0x08002b26:    d00e        ..      BEQ      0x8002b46 ; LL_ADC_REG_Init + 66
        0x08002b28:    688c        .h      LDR      r4,[r1,#8]
        0x08002b2a:    4323        #C      ORRS     r3,r3,r4
        0x08002b2c:    e9d14503    ...E    LDRD     r4,r5,[r1,#0xc]
        0x08002b30:    432c        ,C      ORRS     r4,r4,r5
        0x08002b32:    4323        #C      ORRS     r3,r3,r4
        0x08002b34:    694c        Li      LDR      r4,[r1,#0x14]
        0x08002b36:    4323        #C      ORRS     r3,r3,r4
        0x08002b38:    68c4        .h      LDR      r4,[r0,#0xc]
        0x08002b3a:    ea040c0c    ....    AND      r12,r4,r12
        0x08002b3e:    ea43030c    C...    ORR      r3,r3,r12
        0x08002b42:    60c3        .`      STR      r3,[r0,#0xc]
        0x08002b44:    e00b        ..      B        0x8002b5e ; LL_ADC_REG_Init + 90
        0x08002b46:    68cc        .h      LDR      r4,[r1,#0xc]
        0x08002b48:    4323        #C      ORRS     r3,r3,r4
        0x08002b4a:    e9d14504    ...E    LDRD     r4,r5,[r1,#0x10]
        0x08002b4e:    432c        ,C      ORRS     r4,r4,r5
        0x08002b50:    4323        #C      ORRS     r3,r3,r4
        0x08002b52:    68c4        .h      LDR      r4,[r0,#0xc]
        0x08002b54:    ea040c0c    ....    AND      r12,r4,r12
        0x08002b58:    ea43030c    C...    ORR      r3,r3,r12
        0x08002b5c:    60c3        .`      STR      r3,[r0,#0xc]
        0x08002b5e:    6849        Ih      LDR      r1,[r1,#4]
        0x08002b60:    6b03        .k      LDR      r3,[r0,#0x30]
        0x08002b62:    f023030f    #...    BIC      r3,r3,#0xf
        0x08002b66:    4319        .C      ORRS     r1,r1,r3
        0x08002b68:    6301        .c      STR      r1,[r0,#0x30]
        0x08002b6a:    e7d5        ..      B        0x8002b18 ; LL_ADC_REG_Init + 20
    $d
        0x08002b6c:    fff0c01c    ....    DCD    4293967900
    $t
    i.LL_COMP_Init
    LL_COMP_Init
        0x08002b70:    b410        ..      PUSH     {r4}
        0x08002b72:    6803        .h      LDR      r3,[r0,#0]
        0x08002b74:    2200        ."      MOVS     r2,#0
        0x08002b76:    0fdb        ..      LSRS     r3,r3,#31
        0x08002b78:    bf18        ..      IT       NE
        0x08002b7a:    2201        ."      MOVNE    r2,#1
        0x08002b7c:    d002        ..      BEQ      0x8002b84 ; LL_COMP_Init + 20
        0x08002b7e:    bc10        ..      POP      {r4}
        0x08002b80:    4610        .F      MOV      r0,r2
        0x08002b82:    4770        pG      BX       lr
        0x08002b84:    e9d13c00    ...<    LDRD     r3,r12,[r1,#0]
        0x08002b88:    ea43030c    C...    ORR      r3,r3,r12
        0x08002b8c:    e9d1c402    ....    LDRD     r12,r4,[r1,#8]
        0x08002b90:    ea4c0c04    L...    ORR      r12,r12,r4
        0x08002b94:    6909        .i      LDR      r1,[r1,#0x10]
        0x08002b96:    ea43030c    C...    ORR      r3,r3,r12
        0x08002b9a:    4319        .C      ORRS     r1,r1,r3
        0x08002b9c:    6803        .h      LDR      r3,[r0,#0]
        0x08002b9e:    f8dfc00c    ....    LDR      r12,[pc,#12] ; [0x8002bac] = 0xff007e0f
        0x08002ba2:    ea03030c    ....    AND      r3,r3,r12
        0x08002ba6:    4319        .C      ORRS     r1,r1,r3
        0x08002ba8:    6001        .`      STR      r1,[r0,#0]
        0x08002baa:    e7e8        ..      B        0x8002b7e ; LL_COMP_Init + 14
    $d
        0x08002bac:    ff007e0f    .~..    DCD    4278222351
    $t
    i.LL_DAC_Init
    LL_DAC_Init
        0x08002bb0:    b470        p.      PUSH     {r4-r6}
        0x08002bb2:    2400        .$      MOVS     r4,#0
        0x08002bb4:    f0010310    ....    AND      r3,r1,#0x10
        0x08002bb8:    2501        .%      MOVS     r5,#1
        0x08002bba:    f8d2c008    ....    LDR      r12,[r2,#8]
        0x08002bbe:    6806        .h      LDR      r6,[r0,#0]
        0x08002bc0:    409d        .@      LSLS     r5,r5,r3
        0x08002bc2:    43b5        .C      BICS     r5,r5,r6
        0x08002bc4:    bf08        ..      IT       EQ
        0x08002bc6:    2401        .$      MOVEQ    r4,#1
        0x08002bc8:    d05b        [.      BEQ      0x8002c82 ; LL_DAC_Init + 210
        0x08002bca:    f1bc0f00    ....    CMP      r12,#0
        0x08002bce:    d039        9.      BEQ      0x8002c44 ; LL_DAC_Init + 148
        0x08002bd0:    f1bc0fc0    ....    CMP      r12,#0xc0
        0x08002bd4:    d010        ..      BEQ      0x8002bf8 ; LL_DAC_Init + 72
        0x08002bd6:    6801        .h      LDR      r1,[r0,#0]
        0x08002bd8:    f64075fc    @..u    MOV      r5,#0xffc
        0x08002bdc:    409d        .@      LSLS     r5,r5,r3
        0x08002bde:    43a9        .C      BICS     r1,r1,r5
        0x08002be0:    6815        .h      LDR      r5,[r2,#0]
        0x08002be2:    ea450c0c    E...    ORR      r12,r5,r12
        0x08002be6:    68d5        .h      LDR      r5,[r2,#0xc]
        0x08002be8:    ea4c0c05    L...    ORR      r12,r12,r5
        0x08002bec:    fa0cfc03    ....    LSL      r12,r12,r3
        0x08002bf0:    ea41010c    A...    ORR      r1,r1,r12
        0x08002bf4:    6001        .`      STR      r1,[r0,#0]
        0x08002bf6:    e033        3.      B        0x8002c60 ; LL_DAC_Init + 176
        0x08002bf8:    6805        .h      LDR      r5,[r0,#0]
        0x08002bfa:    f04f0cc0    O...    MOV      r12,#0xc0
        0x08002bfe:    fa0cfc03    ....    LSL      r12,r12,r3
        0x08002c02:    ea25050c    %...    BIC      r5,r5,r12
        0x08002c06:    ea450c0c    E...    ORR      r12,r5,r12
        0x08002c0a:    f8c0c000    ....    STR      r12,[r0,#0]
        0x08002c0e:    f8d0c060    ..`.    LDR      r12,[r0,#0x60]
        0x08002c12:    f640750f    @..u    MOV      r5,#0xf0f
        0x08002c16:    409d        .@      LSLS     r5,r5,r3
        0x08002c18:    ea2c0c05    ,...    BIC      r12,r12,r5
        0x08002c1c:    6815        .h      LDR      r5,[r2,#0]
        0x08002c1e:    6856        Vh      LDR      r6,[r2,#4]
        0x08002c20:    08ad        ..      LSRS     r5,r5,#2
        0x08002c22:    08b6        ..      LSRS     r6,r6,#2
        0x08002c24:    ea452506    E..%    ORR      r5,r5,r6,LSL #8
        0x08002c28:    409d        .@      LSLS     r5,r5,r3
        0x08002c2a:    ea4c0c05    L...    ORR      r12,r12,r5
        0x08002c2e:    f8c0c060    ..`.    STR      r12,[r0,#0x60]
        0x08002c32:    f3c111c0    ....    UBFX     r1,r1,#7,#1
        0x08002c36:    eb000181    ....    ADD      r1,r0,r1,LSL #2
        0x08002c3a:    f8d2c00c    ....    LDR      r12,[r2,#0xc]
        0x08002c3e:    f8c1c058    ..X.    STR      r12,[r1,#0x58]
        0x08002c42:    e00d        ..      B        0x8002c60 ; LL_DAC_Init + 176
        0x08002c44:    6801        .h      LDR      r1,[r0,#0]
        0x08002c46:    f04f0cfc    O...    MOV      r12,#0xfc
        0x08002c4a:    fa0cfc03    ....    LSL      r12,r12,r3
        0x08002c4e:    ea21010c    !...    BIC      r1,r1,r12
        0x08002c52:    f8d2c000    ....    LDR      r12,[r2,#0]
        0x08002c56:    fa0cfc03    ....    LSL      r12,r12,r3
        0x08002c5a:    ea41010c    A...    ORR      r1,r1,r12
        0x08002c5e:    6001        .`      STR      r1,[r0,#0]
        0x08002c60:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x08002c62:    f04f0c07    O...    MOV      r12,#7
        0x08002c66:    fa0cfc03    ....    LSL      r12,r12,r3
        0x08002c6a:    ea21010c    !...    BIC      r1,r1,r12
        0x08002c6e:    e9d2c504    ....    LDRD     r12,r5,[r2,#0x10]
        0x08002c72:    6992        .i      LDR      r2,[r2,#0x18]
        0x08002c74:    ea4c0c05    L...    ORR      r12,r12,r5
        0x08002c78:    ea4c0202    L...    ORR      r2,r12,r2
        0x08002c7c:    409a        .@      LSLS     r2,r2,r3
        0x08002c7e:    4311        .C      ORRS     r1,r1,r2
        0x08002c80:    63c1        .c      STR      r1,[r0,#0x3c]
        0x08002c82:    4620         F      MOV      r0,r4
        0x08002c84:    bc70        p.      POP      {r4-r6}
        0x08002c86:    4770        pG      BX       lr
    i.LL_EXTI_Init
    LL_EXTI_Init
        0x08002c88:    b470        p.      PUSH     {r4-r6}
        0x08002c8a:    4a68        hJ      LDR      r2,[pc,#416] ; [0x8002e2c] = 0x40010404
        0x08002c8c:    7a06        .z      LDRB     r6,[r0,#8]
        0x08002c8e:    4b68        hK      LDR      r3,[pc,#416] ; [0x8002e30] = 0x40010424
        0x08002c90:    2500        .%      MOVS     r5,#0
        0x08002c92:    1f14        ..      SUBS     r4,r2,#4
        0x08002c94:    6801        .h      LDR      r1,[r0,#0]
        0x08002c96:    f1a30c04    ....    SUB      r12,r3,#4
        0x08002c9a:    2e00        ..      CMP      r6,#0
        0x08002c9c:    d074        t.      BEQ      0x8002d88 ; LL_EXTI_Init + 256
        0x08002c9e:    b1a1        ..      CBZ      r1,0x8002cca ; LL_EXTI_Init + 66
        0x08002ca0:    7a46        Fz      LDRB     r6,[r0,#9]
        0x08002ca2:    b376        v.      CBZ      r6,0x8002d02 ; LL_EXTI_Init + 122
        0x08002ca4:    2e01        ..      CMP      r6,#1
        0x08002ca6:    d036        6.      BEQ      0x8002d16 ; LL_EXTI_Init + 142
        0x08002ca8:    2e02        ..      CMP      r6,#2
        0x08002caa:    bf18        ..      IT       NE
        0x08002cac:    2501        .%      MOVNE    r5,#1
        0x08002cae:    d03b        ;.      BEQ      0x8002d28 ; LL_EXTI_Init + 160
        0x08002cb0:    7a84        .z      LDRB     r4,[r0,#0xa]
        0x08002cb2:    b154        T.      CBZ      r4,0x8002cca ; LL_EXTI_Init + 66
        0x08002cb4:    495f        _I      LDR      r1,[pc,#380] ; [0x8002e34] = 0x4001040c
        0x08002cb6:    1f0a        ..      SUBS     r2,r1,#4
        0x08002cb8:    2c01        .,      CMP      r4,#1
        0x08002cba:    d03d        =.      BEQ      0x8002d38 ; LL_EXTI_Init + 176
        0x08002cbc:    2c02        .,      CMP      r4,#2
        0x08002cbe:    d045        E.      BEQ      0x8002d4c ; LL_EXTI_Init + 196
        0x08002cc0:    2c03        .,      CMP      r4,#3
        0x08002cc2:    bf18        ..      IT       NE
        0x08002cc4:    f0450502    E...    ORRNE    r5,r5,#2
        0x08002cc8:    d04a        J.      BEQ      0x8002d60 ; LL_EXTI_Init + 216
        0x08002cca:    6841        Ah      LDR      r1,[r0,#4]
        0x08002ccc:    2900        .)      CMP      r1,#0
        0x08002cce:    d071        q.      BEQ      0x8002db4 ; LL_EXTI_Init + 300
        0x08002cd0:    7a42        Bz      LDRB     r2,[r0,#9]
        0x08002cd2:    2a00        .*      CMP      r2,#0
        0x08002cd4:    d04d        M.      BEQ      0x8002d72 ; LL_EXTI_Init + 234
        0x08002cd6:    2a01        .*      CMP      r2,#1
        0x08002cd8:    d057        W.      BEQ      0x8002d8a ; LL_EXTI_Init + 258
        0x08002cda:    2a02        .*      CMP      r2,#2
        0x08002cdc:    bf18        ..      IT       NE
        0x08002cde:    f0450504    E...    ORRNE    r5,r5,#4
        0x08002ce2:    d05d        ].      BEQ      0x8002da0 ; LL_EXTI_Init + 280
        0x08002ce4:    7a83        .z      LDRB     r3,[r0,#0xa]
        0x08002ce6:    2b00        .+      CMP      r3,#0
        0x08002ce8:    d064        d.      BEQ      0x8002db4 ; LL_EXTI_Init + 300
        0x08002cea:    4953        SI      LDR      r1,[pc,#332] ; [0x8002e38] = 0x4001042c
        0x08002cec:    1f0a        ..      SUBS     r2,r1,#4
        0x08002cee:    2b01        .+      CMP      r3,#1
        0x08002cf0:    d061        a.      BEQ      0x8002db6 ; LL_EXTI_Init + 302
        0x08002cf2:    2b02        .+      CMP      r3,#2
        0x08002cf4:    d06a        j.      BEQ      0x8002dcc ; LL_EXTI_Init + 324
        0x08002cf6:    2b03        .+      CMP      r3,#3
        0x08002cf8:    bf18        ..      IT       NE
        0x08002cfa:    f0450505    E...    ORRNE    r5,r5,#5
        0x08002cfe:    d071        q.      BEQ      0x8002de4 ; LL_EXTI_Init + 348
        0x08002d00:    e090        ..      B        0x8002e24 ; LL_EXTI_Init + 412
        0x08002d02:    e7ff        ..      B        0x8002d04 ; LL_EXTI_Init + 124
        0x08002d04:    6816        .h      LDR      r6,[r2,#0]
        0x08002d06:    ea260101    &...    BIC      r1,r6,r1
        0x08002d0a:    6011        .`      STR      r1,[r2,#0]
        0x08002d0c:    6801        .h      LDR      r1,[r0,#0]
        0x08002d0e:    6822        "h      LDR      r2,[r4,#0]
        0x08002d10:    4311        .C      ORRS     r1,r1,r2
        0x08002d12:    6021        !`      STR      r1,[r4,#0]
        0x08002d14:    e7cc        ..      B        0x8002cb0 ; LL_EXTI_Init + 40
        0x08002d16:    6826        &h      LDR      r6,[r4,#0]
        0x08002d18:    ea260101    &...    BIC      r1,r6,r1
        0x08002d1c:    6021        !`      STR      r1,[r4,#0]
        0x08002d1e:    6801        .h      LDR      r1,[r0,#0]
        0x08002d20:    6814        .h      LDR      r4,[r2,#0]
        0x08002d22:    4321        !C      ORRS     r1,r1,r4
        0x08002d24:    6011        .`      STR      r1,[r2,#0]
        0x08002d26:    e7c3        ..      B        0x8002cb0 ; LL_EXTI_Init + 40
        0x08002d28:    6826        &h      LDR      r6,[r4,#0]
        0x08002d2a:    4331        1C      ORRS     r1,r1,r6
        0x08002d2c:    6021        !`      STR      r1,[r4,#0]
        0x08002d2e:    6801        .h      LDR      r1,[r0,#0]
        0x08002d30:    6814        .h      LDR      r4,[r2,#0]
        0x08002d32:    4321        !C      ORRS     r1,r1,r4
        0x08002d34:    6011        .`      STR      r1,[r2,#0]
        0x08002d36:    e7bb        ..      B        0x8002cb0 ; LL_EXTI_Init + 40
        0x08002d38:    6804        .h      LDR      r4,[r0,#0]
        0x08002d3a:    680e        .h      LDR      r6,[r1,#0]
        0x08002d3c:    ea260404    &...    BIC      r4,r6,r4
        0x08002d40:    600c        .`      STR      r4,[r1,#0]
        0x08002d42:    6801        .h      LDR      r1,[r0,#0]
        0x08002d44:    6814        .h      LDR      r4,[r2,#0]
        0x08002d46:    4321        !C      ORRS     r1,r1,r4
        0x08002d48:    6011        .`      STR      r1,[r2,#0]
        0x08002d4a:    e7be        ..      B        0x8002cca ; LL_EXTI_Init + 66
        0x08002d4c:    6804        .h      LDR      r4,[r0,#0]
        0x08002d4e:    6816        .h      LDR      r6,[r2,#0]
