ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08002d50:    ea260404    &...    BIC      r4,r6,r4
        0x08002d54:    6014        .`      STR      r4,[r2,#0]
        0x08002d56:    6802        .h      LDR      r2,[r0,#0]
        0x08002d58:    680c        .h      LDR      r4,[r1,#0]
        0x08002d5a:    4322        "C      ORRS     r2,r2,r4
        0x08002d5c:    600a        .`      STR      r2,[r1,#0]
        0x08002d5e:    e7b4        ..      B        0x8002cca ; LL_EXTI_Init + 66
        0x08002d60:    6804        .h      LDR      r4,[r0,#0]
        0x08002d62:    6816        .h      LDR      r6,[r2,#0]
        0x08002d64:    4334        4C      ORRS     r4,r4,r6
        0x08002d66:    6014        .`      STR      r4,[r2,#0]
        0x08002d68:    6802        .h      LDR      r2,[r0,#0]
        0x08002d6a:    680c        .h      LDR      r4,[r1,#0]
        0x08002d6c:    4322        "C      ORRS     r2,r2,r4
        0x08002d6e:    600a        .`      STR      r2,[r1,#0]
        0x08002d70:    e7ab        ..      B        0x8002cca ; LL_EXTI_Init + 66
        0x08002d72:    681a        .h      LDR      r2,[r3,#0]
        0x08002d74:    ea220101    "...    BIC      r1,r2,r1
        0x08002d78:    6019        .`      STR      r1,[r3,#0]
        0x08002d7a:    6841        Ah      LDR      r1,[r0,#4]
        0x08002d7c:    f8dc2000    ...     LDR      r2,[r12,#0]
        0x08002d80:    4311        .C      ORRS     r1,r1,r2
        0x08002d82:    f8cc1000    ....    STR      r1,[r12,#0]
        0x08002d86:    e7ad        ..      B        0x8002ce4 ; LL_EXTI_Init + 92
        0x08002d88:    e037        7.      B        0x8002dfa ; LL_EXTI_Init + 370
        0x08002d8a:    f8dc2000    ...     LDR      r2,[r12,#0]
        0x08002d8e:    ea220101    "...    BIC      r1,r2,r1
        0x08002d92:    f8cc1000    ....    STR      r1,[r12,#0]
        0x08002d96:    6841        Ah      LDR      r1,[r0,#4]
        0x08002d98:    681a        .h      LDR      r2,[r3,#0]
        0x08002d9a:    4311        .C      ORRS     r1,r1,r2
        0x08002d9c:    6019        .`      STR      r1,[r3,#0]
        0x08002d9e:    e7a1        ..      B        0x8002ce4 ; LL_EXTI_Init + 92
        0x08002da0:    f8dc2000    ...     LDR      r2,[r12,#0]
        0x08002da4:    4311        .C      ORRS     r1,r1,r2
        0x08002da6:    f8cc1000    ....    STR      r1,[r12,#0]
        0x08002daa:    6841        Ah      LDR      r1,[r0,#4]
        0x08002dac:    681a        .h      LDR      r2,[r3,#0]
        0x08002dae:    4311        .C      ORRS     r1,r1,r2
        0x08002db0:    6019        .`      STR      r1,[r3,#0]
        0x08002db2:    e797        ..      B        0x8002ce4 ; LL_EXTI_Init + 92
        0x08002db4:    e036        6.      B        0x8002e24 ; LL_EXTI_Init + 412
        0x08002db6:    6843        Ch      LDR      r3,[r0,#4]
        0x08002db8:    f8d1c000    ....    LDR      r12,[r1,#0]
        0x08002dbc:    ea2c0303    ,...    BIC      r3,r12,r3
        0x08002dc0:    600b        .`      STR      r3,[r1,#0]
        0x08002dc2:    6840        @h      LDR      r0,[r0,#4]
        0x08002dc4:    6811        .h      LDR      r1,[r2,#0]
        0x08002dc6:    4308        .C      ORRS     r0,r0,r1
        0x08002dc8:    6010        .`      STR      r0,[r2,#0]
        0x08002dca:    e02b        +.      B        0x8002e24 ; LL_EXTI_Init + 412
        0x08002dcc:    6843        Ch      LDR      r3,[r0,#4]
        0x08002dce:    f8d2c000    ....    LDR      r12,[r2,#0]
        0x08002dd2:    ea2c0303    ,...    BIC      r3,r12,r3
        0x08002dd6:    6013        .`      STR      r3,[r2,#0]
        0x08002dd8:    6840        @h      LDR      r0,[r0,#4]
        0x08002dda:    680a        .h      LDR      r2,[r1,#0]
        0x08002ddc:    4310        .C      ORRS     r0,r0,r2
        0x08002dde:    6008        .`      STR      r0,[r1,#0]
        0x08002de0:    e020         .      B        0x8002e24 ; LL_EXTI_Init + 412
        0x08002de2:    e7ff        ..      B        0x8002de4 ; LL_EXTI_Init + 348
        0x08002de4:    6843        Ch      LDR      r3,[r0,#4]
        0x08002de6:    f8d2c000    ....    LDR      r12,[r2,#0]
        0x08002dea:    ea4c0303    L...    ORR      r3,r12,r3
        0x08002dee:    6013        .`      STR      r3,[r2,#0]
        0x08002df0:    6840        @h      LDR      r0,[r0,#4]
        0x08002df2:    680a        .h      LDR      r2,[r1,#0]
        0x08002df4:    4310        .C      ORRS     r0,r0,r2
        0x08002df6:    6008        .`      STR      r0,[r1,#0]
        0x08002df8:    e014        ..      B        0x8002e24 ; LL_EXTI_Init + 412
        0x08002dfa:    6826        &h      LDR      r6,[r4,#0]
        0x08002dfc:    ea260101    &...    BIC      r1,r6,r1
        0x08002e00:    6021        !`      STR      r1,[r4,#0]
        0x08002e02:    6801        .h      LDR      r1,[r0,#0]
        0x08002e04:    6814        .h      LDR      r4,[r2,#0]
        0x08002e06:    ea240101    $...    BIC      r1,r4,r1
        0x08002e0a:    6011        .`      STR      r1,[r2,#0]
        0x08002e0c:    6841        Ah      LDR      r1,[r0,#4]
        0x08002e0e:    f8dc2000    ...     LDR      r2,[r12,#0]
        0x08002e12:    ea220101    "...    BIC      r1,r2,r1
        0x08002e16:    f8cc1000    ....    STR      r1,[r12,#0]
        0x08002e1a:    6840        @h      LDR      r0,[r0,#4]
        0x08002e1c:    6819        .h      LDR      r1,[r3,#0]
        0x08002e1e:    ea210000    !...    BIC      r0,r1,r0
        0x08002e22:    6018        .`      STR      r0,[r3,#0]
        0x08002e24:    4628        (F      MOV      r0,r5
        0x08002e26:    bc70        p.      POP      {r4-r6}
        0x08002e28:    4770        pG      BX       lr
    $d
        0x08002e2a:    0000        ..      DCW    0
        0x08002e2c:    40010404    ...@    DCD    1073808388
        0x08002e30:    40010424    $..@    DCD    1073808420
        0x08002e34:    4001040c    ...@    DCD    1073808396
        0x08002e38:    4001042c    ,..@    DCD    1073808428
    $t
    i.LL_GPIO_Init
    LL_GPIO_Init
        0x08002e3c:    e92d03f0    -...    PUSH     {r4-r9}
        0x08002e40:    680a        .h      LDR      r2,[r1,#0]
        0x08002e42:    fa92f3a2    ....    RBIT     r3,r2
        0x08002e46:    fab3f383    ....    CLZ      r3,r3
        0x08002e4a:    40da        .@      LSRS     r2,r2,r3
        0x08002e4c:    d07e        ~.      BEQ      0x8002f4c ; LL_GPIO_Init + 272
        0x08002e4e:    2501        .%      MOVS     r5,#1
        0x08002e50:    240f        .$      MOVS     r4,#0xf
        0x08002e52:    f04f0c03    O...    MOV      r12,#3
        0x08002e56:    bf00        ..      NOP      
        0x08002e58:    680e        .h      LDR      r6,[r1,#0]
        0x08002e5a:    fa05f203    ....    LSL      r2,r5,r3
        0x08002e5e:    4032        2@      ANDS     r2,r2,r6
        0x08002e60:    d075        u.      BEQ      0x8002f4e ; LL_GPIO_Init + 274
        0x08002e62:    684e        Nh      LDR      r6,[r1,#4]
        0x08002e64:    2e01        ..      CMP      r6,#1
        0x08002e66:    bf18        ..      IT       NE
        0x08002e68:    2e02        ..      CMPNE    r6,#2
        0x08002e6a:    d122        ".      BNE      0x8002eb2 ; LL_GPIO_Init + 118
        0x08002e6c:    688f        .h      LDR      r7,[r1,#8]
        0x08002e6e:    f8d08008    ....    LDR      r8,[r0,#8]
        0x08002e72:    fa92f6a2    ....    RBIT     r6,r2
        0x08002e76:    fab6f686    ....    CLZ      r6,r6
        0x08002e7a:    ea4f0646    O.F.    LSL      r6,r6,#1
        0x08002e7e:    fa0cf606    ....    LSL      r6,r12,r6
        0x08002e82:    ea280606    (...    BIC      r6,r8,r6
        0x08002e86:    fa92f8a2    ....    RBIT     r8,r2
        0x08002e8a:    fab8f888    ....    CLZ      r8,r8
        0x08002e8e:    ea4f0848    O.H.    LSL      r8,r8,#1
        0x08002e92:    fa07f708    ....    LSL      r7,r7,r8
        0x08002e96:    ea460607    F...    ORR      r6,r6,r7
        0x08002e9a:    6086        .`      STR      r6,[r0,#8]
        0x08002e9c:    68cf        .h      LDR      r7,[r1,#0xc]
        0x08002e9e:    680e        .h      LDR      r6,[r1,#0]
        0x08002ea0:    f8d08004    ....    LDR      r8,[r0,#4]
        0x08002ea4:    ea280806    (...    BIC      r8,r8,r6
        0x08002ea8:    fb06f607    ....    MUL      r6,r6,r7
        0x08002eac:    ea480606    H...    ORR      r6,r8,r6
        0x08002eb0:    6046        F`      STR      r6,[r0,#4]
        0x08002eb2:    690e        .i      LDR      r6,[r1,#0x10]
        0x08002eb4:    f8d0800c    ....    LDR      r8,[r0,#0xc]
        0x08002eb8:    fa92f7a2    ....    RBIT     r7,r2
        0x08002ebc:    fab7f787    ....    CLZ      r7,r7
        0x08002ec0:    ea4f0747    O.G.    LSL      r7,r7,#1
        0x08002ec4:    fa0cf707    ....    LSL      r7,r12,r7
        0x08002ec8:    ea280707    (...    BIC      r7,r8,r7
        0x08002ecc:    fa92f8a2    ....    RBIT     r8,r2
        0x08002ed0:    fab8f888    ....    CLZ      r8,r8
        0x08002ed4:    ea4f0848    O.H.    LSL      r8,r8,#1
        0x08002ed8:    fa06f608    ....    LSL      r6,r6,r8
        0x08002edc:    ea470606    G...    ORR      r6,r7,r6
        0x08002ee0:    60c6        .`      STR      r6,[r0,#0xc]
        0x08002ee2:    684e        Nh      LDR      r6,[r1,#4]
        0x08002ee4:    2e02        ..      CMP      r6,#2
        0x08002ee6:    d134        4.      BNE      0x8002f52 ; LL_GPIO_Init + 278
        0x08002ee8:    f5b27f80    ....    CMP      r2,#0x100
        0x08002eec:    d216        ..      BCS      0x8002f1c ; LL_GPIO_Init + 224
        0x08002eee:    694e        Ni      LDR      r6,[r1,#0x14]
        0x08002ef0:    6a07        .j      LDR      r7,[r0,#0x20]
        0x08002ef2:    fa92f8a2    ....    RBIT     r8,r2
        0x08002ef6:    fab8f888    ....    CLZ      r8,r8
        0x08002efa:    ea4f0888    O...    LSL      r8,r8,#2
        0x08002efe:    fa04f808    ....    LSL      r8,r4,r8
        0x08002f02:    ea270708    '...    BIC      r7,r7,r8
        0x08002f06:    fa92f8a2    ....    RBIT     r8,r2
        0x08002f0a:    fab8f888    ....    CLZ      r8,r8
        0x08002f0e:    ea4f0888    O...    LSL      r8,r8,#2
        0x08002f12:    fa06f608    ....    LSL      r6,r6,r8
        0x08002f16:    433e        >C      ORRS     r6,r6,r7
        0x08002f18:    6206        .b      STR      r6,[r0,#0x20]
        0x08002f1a:    e01a        ..      B        0x8002f52 ; LL_GPIO_Init + 278
        0x08002f1c:    694f        Oi      LDR      r7,[r1,#0x14]
        0x08002f1e:    f8d08024    ..$.    LDR      r8,[r0,#0x24]
        0x08002f22:    0a16        ..      LSRS     r6,r2,#8
        0x08002f24:    fa96f9a6    ....    RBIT     r9,r6
        0x08002f28:    fab9f989    ....    CLZ      r9,r9
        0x08002f2c:    ea4f0989    O...    LSL      r9,r9,#2
        0x08002f30:    fa04f909    ....    LSL      r9,r4,r9
        0x08002f34:    fa96f6a6    ....    RBIT     r6,r6
        0x08002f38:    fab6f686    ....    CLZ      r6,r6
        0x08002f3c:    00b6        ..      LSLS     r6,r6,#2
        0x08002f3e:    ea280809    (...    BIC      r8,r8,r9
        0x08002f42:    fa07f606    ....    LSL      r6,r7,r6
        0x08002f46:    ea480606    H...    ORR      r6,r8,r6
        0x08002f4a:    e001        ..      B        0x8002f50 ; LL_GPIO_Init + 276
        0x08002f4c:    e01b        ..      B        0x8002f86 ; LL_GPIO_Init + 330
        0x08002f4e:    e015        ..      B        0x8002f7c ; LL_GPIO_Init + 320
        0x08002f50:    6246        Fb      STR      r6,[r0,#0x24]
        0x08002f52:    684f        Oh      LDR      r7,[r1,#4]
        0x08002f54:    f8d08000    ....    LDR      r8,[r0,#0]
        0x08002f58:    fa92f6a2    ....    RBIT     r6,r2
        0x08002f5c:    fab6f686    ....    CLZ      r6,r6
        0x08002f60:    0076        v.      LSLS     r6,r6,#1
        0x08002f62:    fa0cf606    ....    LSL      r6,r12,r6
        0x08002f66:    fa92f2a2    ....    RBIT     r2,r2
        0x08002f6a:    fab2f282    ....    CLZ      r2,r2
        0x08002f6e:    0052        R.      LSLS     r2,r2,#1
        0x08002f70:    ea280606    (...    BIC      r6,r8,r6
        0x08002f74:    fa07f202    ....    LSL      r2,r7,r2
        0x08002f78:    4332        2C      ORRS     r2,r2,r6
        0x08002f7a:    6002        .`      STR      r2,[r0,#0]
        0x08002f7c:    680a        .h      LDR      r2,[r1,#0]
        0x08002f7e:    1c5b        [.      ADDS     r3,r3,#1
        0x08002f80:    40da        .@      LSRS     r2,r2,r3
        0x08002f82:    f47faf69    ..i.    BNE      0x8002e58 ; LL_GPIO_Init + 28
        0x08002f86:    e8bd03f0    ....    POP      {r4-r9}
        0x08002f8a:    2000        .       MOVS     r0,#0
        0x08002f8c:    4770        pG      BX       lr
    i.LL_I2C_Init
    LL_I2C_Init
        0x08002f8e:    6802        .h      LDR      r2,[r0,#0]
        0x08002f90:    f0220201    "...    BIC      r2,r2,#1
        0x08002f94:    6002        .`      STR      r2,[r0,#0]
        0x08002f96:    e9d13202    ...2    LDRD     r3,r2,[r1,#8]
        0x08002f9a:    f8d0c000    ....    LDR      r12,[r0,#0]
        0x08002f9e:    ea432202    C.."    ORR      r2,r3,r2,LSL #8
        0x08002fa2:    f42c5cf8    ,..\    BIC      r12,r12,#0x1f00
        0x08002fa6:    ea4c0202    L...    ORR      r2,r12,r2
        0x08002faa:    6002        .`      STR      r2,[r0,#0]
        0x08002fac:    684a        Jh      LDR      r2,[r1,#4]
        0x08002fae:    6102        .a      STR      r2,[r0,#0x10]
        0x08002fb0:    6802        .h      LDR      r2,[r0,#0]
        0x08002fb2:    f0420201    B...    ORR      r2,r2,#1
        0x08002fb6:    6002        .`      STR      r2,[r0,#0]
        0x08002fb8:    6882        .h      LDR      r2,[r0,#8]
        0x08002fba:    f4224200    "..B    BIC      r2,r2,#0x8000
        0x08002fbe:    6082        .`      STR      r2,[r0,#8]
        0x08002fc0:    690b        .i      LDR      r3,[r1,#0x10]
        0x08002fc2:    698a        .i      LDR      r2,[r1,#0x18]
        0x08002fc4:    f8d0c008    ....    LDR      r12,[r0,#8]
        0x08002fc8:    431a        .C      ORRS     r2,r2,r3
        0x08002fca:    f36f0c0a    o...    BFC      r12,#0,#11
        0x08002fce:    ea4c0202    L...    ORR      r2,r12,r2
        0x08002fd2:    6082        .`      STR      r2,[r0,#8]
        0x08002fd4:    690a        .i      LDR      r2,[r1,#0x10]
        0x08002fd6:    b11a        ..      CBZ      r2,0x8002fe0 ; LL_I2C_Init + 82
        0x08002fd8:    6882        .h      LDR      r2,[r0,#8]
        0x08002fda:    f4424200    B..B    ORR      r2,r2,#0x8000
        0x08002fde:    6082        .`      STR      r2,[r0,#8]
        0x08002fe0:    680a        .h      LDR      r2,[r1,#0]
        0x08002fe2:    6803        .h      LDR      r3,[r0,#0]
        0x08002fe4:    f4231340    #.@.    BIC      r3,r3,#0x300000
        0x08002fe8:    431a        .C      ORRS     r2,r2,r3
        0x08002fea:    6002        .`      STR      r2,[r0,#0]
        0x08002fec:    6949        Ii      LDR      r1,[r1,#0x14]
        0x08002fee:    6842        Bh      LDR      r2,[r0,#4]
        0x08002ff0:    f4224200    "..B    BIC      r2,r2,#0x8000
        0x08002ff4:    4311        .C      ORRS     r1,r1,r2
        0x08002ff6:    6041        A`      STR      r1,[r0,#4]
        0x08002ff8:    2000        .       MOVS     r0,#0
        0x08002ffa:    4770        pG      BX       lr
    i.LL_RCC_GetUARTClockFreq
    LL_RCC_GetUARTClockFreq
        0x08002ffc:    4601        .F      MOV      r1,r0
        0x08002ffe:    b510        ..      PUSH     {r4,lr}
        0x08003000:    2000        .       MOVS     r0,#0
        0x08003002:    29c0        .)      CMP      r1,#0xc0
        0x08003004:    bf18        ..      IT       NE
        0x08003006:    bd10        ..      POPNE    {r4,pc}
        0x08003008:    4c1a        .L      LDR      r4,[pc,#104] ; [0x8003074] = 0x40021000
        0x0800300a:    f8d41088    ....    LDR      r1,[r4,#0x88]
        0x0800300e:    f00101c0    ....    AND      r1,r1,#0xc0
        0x08003012:    f4410140    A.@.    ORR      r1,r1,#0xc00000
        0x08003016:    3940        @9      SUBS     r1,r1,#0x40
        0x08003018:    f5b10140    ..@.    SUBS     r1,r1,#0xc00000
        0x0800301c:    d017        ..      BEQ      0x800304e ; LL_RCC_GetUARTClockFreq + 82
        0x0800301e:    2940        @)      CMP      r1,#0x40
        0x08003020:    d019        ..      BEQ      0x8003056 ; LL_RCC_GetUARTClockFreq + 90
        0x08003022:    2980        .)      CMP      r1,#0x80
        0x08003024:    d01e        ..      BEQ      0x8003064 ; LL_RCC_GetUARTClockFreq + 104
        0x08003026:    f001fded    ....    BL       RCC_GetSystemClockFreq ; 0x8004c04
        0x0800302a:    68a1        .h      LDR      r1,[r4,#8]
        0x0800302c:    4a12        .J      LDR      r2,[pc,#72] ; [0x8003078] = 0x8008a04
        0x0800302e:    f00101f0    ....    AND      r1,r1,#0xf0
        0x08003032:    0909        ..      LSRS     r1,r1,#4
        0x08003034:    5c51        Q\      LDRB     r1,[r2,r1]
        0x08003036:    f001011f    ....    AND      r1,r1,#0x1f
        0x0800303a:    40c8        .@      LSRS     r0,r0,r1
        0x0800303c:    68a1        .h      LDR      r1,[r4,#8]
        0x0800303e:    4a0f        .J      LDR      r2,[pc,#60] ; [0x800307c] = 0x8008a14
        0x08003040:    f3c12102    ...!    UBFX     r1,r1,#8,#3
        0x08003044:    5c51        Q\      LDRB     r1,[r2,r1]
        0x08003046:    f001011f    ....    AND      r1,r1,#0x1f
        0x0800304a:    40c8        .@      LSRS     r0,r0,r1
        0x0800304c:    bd10        ..      POP      {r4,pc}
        0x0800304e:    e8bd4010    ...@    POP      {r4,lr}
        0x08003052:    f001bdd7    ....    B.W      RCC_GetSystemClockFreq ; 0x8004c04
        0x08003056:    6821        !h      LDR      r1,[r4,#0]
        0x08003058:    f3c12180    ...!    UBFX     r1,r1,#10,#1
        0x0800305c:    2900        .)      CMP      r1,#0
        0x0800305e:    bf18        ..      IT       NE
        0x08003060:    4807        .H      LDRNE    r0,[pc,#28] ; [0x8003080] = 0xf42400
        0x08003062:    bd10        ..      POP      {r4,pc}
        0x08003064:    f8d41090    ....    LDR      r1,[r4,#0x90]
        0x08003068:    f0110f02    ....    TST      r1,#2
        0x0800306c:    bf18        ..      IT       NE
        0x0800306e:    f44f4000    O..@    MOVNE    r0,#0x8000
        0x08003072:    bd10        ..      POP      {r4,pc}
    $d
        0x08003074:    40021000    ...@    DCD    1073876992
        0x08003078:    08008a04    ....    DCD    134253060
        0x0800307c:    08008a14    ....    DCD    134253076
        0x08003080:    00f42400    .$..    DCD    16000000
    $t
    i.LL_RCC_GetUSARTClockFreq
    LL_RCC_GetUSARTClockFreq
        0x08003084:    b570        p.      PUSH     {r4-r6,lr}
        0x08003086:    4602        .F      MOV      r2,r0
        0x08003088:    2000        .       MOVS     r0,#0
        0x0800308a:    4944        DI      LDR      r1,[pc,#272] ; [0x800319c] = 0xf42400
        0x0800308c:    4d44        DM      LDR      r5,[pc,#272] ; [0x80031a0] = 0x8008a04
        0x0800308e:    4e45        EN      LDR      r6,[pc,#276] ; [0x80031a4] = 0x8008a14
        0x08003090:    4c45        EL      LDR      r4,[pc,#276] ; [0x80031a8] = 0x40021000
        0x08003092:    2a03        .*      CMP      r2,#3
        0x08003094:    d013        ..      BEQ      0x80030be ; LL_RCC_GetUSARTClockFreq + 58
        0x08003096:    2a0c        .*      CMP      r2,#0xc
        0x08003098:    d043        C.      BEQ      0x8003122 ; LL_RCC_GetUSARTClockFreq + 158
        0x0800309a:    2a30        0*      CMP      r2,#0x30
        0x0800309c:    bf18        ..      IT       NE
        0x0800309e:    bd70        p.      POPNE    {r4-r6,pc}
        0x080030a0:    f8d42088    ...     LDR      r2,[r4,#0x88]
        0x080030a4:    f0020230    ..0.    AND      r2,r2,#0x30
        0x080030a8:    f4421240    B.@.    ORR      r2,r2,#0x300000
        0x080030ac:    3a10        .:      SUBS     r2,r2,#0x10
        0x080030ae:    f5b21240    ..@.    SUBS     r2,r2,#0x300000
        0x080030b2:    d062        b.      BEQ      0x800317a ; LL_RCC_GetUSARTClockFreq + 246
        0x080030b4:    2a10        .*      CMP      r2,#0x10
        0x080030b6:    d064        d.      BEQ      0x8003182 ; LL_RCC_GetUSARTClockFreq + 254
        0x080030b8:    2a20         *      CMP      r2,#0x20
        0x080030ba:    d068        h.      BEQ      0x800318e ; LL_RCC_GetUSARTClockFreq + 266
        0x080030bc:    e03f        ?.      B        0x800313e ; LL_RCC_GetUSARTClockFreq + 186
        0x080030be:    f8d42088    ...     LDR      r2,[r4,#0x88]
        0x080030c2:    f46f3340    o.@3    MVN      r3,#0x30000
        0x080030c6:    f0020203    ....    AND      r2,r2,#3
        0x080030ca:    f4423240    B.@2    ORR      r2,r2,#0x30000
        0x080030ce:    18d2        ..      ADDS     r2,r2,r3
        0x080030d0:    d053        S.      BEQ      0x800317a ; LL_RCC_GetUSARTClockFreq + 246
        0x080030d2:    2a01        .*      CMP      r2,#1
        0x080030d4:    d013        ..      BEQ      0x80030fe ; LL_RCC_GetUSARTClockFreq + 122
        0x080030d6:    2a02        .*      CMP      r2,#2
        0x080030d8:    d019        ..      BEQ      0x800310e ; LL_RCC_GetUSARTClockFreq + 138
        0x080030da:    f001fd93    ....    BL       RCC_GetSystemClockFreq ; 0x8004c04
        0x080030de:    68a1        .h      LDR      r1,[r4,#8]
        0x080030e0:    f00101f0    ....    AND      r1,r1,#0xf0
        0x080030e4:    0909        ..      LSRS     r1,r1,#4
        0x080030e6:    5c69        i\      LDRB     r1,[r5,r1]
        0x080030e8:    f001011f    ....    AND      r1,r1,#0x1f
        0x080030ec:    40c8        .@      LSRS     r0,r0,r1
        0x080030ee:    68a1        .h      LDR      r1,[r4,#8]
        0x080030f0:    f3c121c2    ...!    UBFX     r1,r1,#11,#3
        0x080030f4:    5c71        q\      LDRB     r1,[r6,r1]
        0x080030f6:    f001011f    ....    AND      r1,r1,#0x1f
        0x080030fa:    40c8        .@      LSRS     r0,r0,r1
        0x080030fc:    bd70        p.      POP      {r4-r6,pc}
        0x080030fe:    6822        "h      LDR      r2,[r4,#0]
        0x08003100:    f3c22280    ..."    UBFX     r2,r2,#10,#1
        0x08003104:    2a00        .*      CMP      r2,#0
        0x08003106:    bf08        ..      IT       EQ
        0x08003108:    bd70        p.      POPEQ    {r4-r6,pc}
        0x0800310a:    4608        .F      MOV      r0,r1
        0x0800310c:    bd70        p.      POP      {r4-r6,pc}
        0x0800310e:    f8d41090    ....    LDR      r1,[r4,#0x90]
        0x08003112:    f0110f02    ....    TST      r1,#2
        0x08003116:    bf08        ..      IT       EQ
        0x08003118:    bd70        p.      POPEQ    {r4-r6,pc}
        0x0800311a:    bf00        ..      NOP      
        0x0800311c:    f44f4000    O..@    MOV      r0,#0x8000
        0x08003120:    bd70        p.      POP      {r4-r6,pc}
        0x08003122:    f8d42088    ...     LDR      r2,[r4,#0x88]
        0x08003126:    f002020c    ....    AND      r2,r2,#0xc
        0x0800312a:    f4422240    B.@"    ORR      r2,r2,#0xc0000
        0x0800312e:    1f12        ..      SUBS     r2,r2,#4
        0x08003130:    f5b22240    ..@"    SUBS     r2,r2,#0xc0000
        0x08003134:    d021        !.      BEQ      0x800317a ; LL_RCC_GetUSARTClockFreq + 246
        0x08003136:    2a04        .*      CMP      r2,#4
        0x08003138:    d013        ..      BEQ      0x8003162 ; LL_RCC_GetUSARTClockFreq + 222
        0x0800313a:    2a08        .*      CMP      r2,#8
        0x0800313c:    d017        ..      BEQ      0x800316e ; LL_RCC_GetUSARTClockFreq + 234
        0x0800313e:    f001fd61    ..a.    BL       RCC_GetSystemClockFreq ; 0x8004c04
