ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08003142:    68a1        .h      LDR      r1,[r4,#8]
        0x08003144:    f00101f0    ....    AND      r1,r1,#0xf0
        0x08003148:    0909        ..      LSRS     r1,r1,#4
        0x0800314a:    5c69        i\      LDRB     r1,[r5,r1]
        0x0800314c:    f001011f    ....    AND      r1,r1,#0x1f
        0x08003150:    40c8        .@      LSRS     r0,r0,r1
        0x08003152:    68a1        .h      LDR      r1,[r4,#8]
        0x08003154:    f3c12102    ...!    UBFX     r1,r1,#8,#3
        0x08003158:    5c71        q\      LDRB     r1,[r6,r1]
        0x0800315a:    f001011f    ....    AND      r1,r1,#0x1f
        0x0800315e:    40c8        .@      LSRS     r0,r0,r1
        0x08003160:    bd70        p.      POP      {r4-r6,pc}
        0x08003162:    6822        "h      LDR      r2,[r4,#0]
        0x08003164:    f3c22280    ..."    UBFX     r2,r2,#10,#1
        0x08003168:    2a00        .*      CMP      r2,#0
        0x0800316a:    d1ce        ..      BNE      0x800310a ; LL_RCC_GetUSARTClockFreq + 134
        0x0800316c:    bd70        p.      POP      {r4-r6,pc}
        0x0800316e:    f8d41090    ....    LDR      r1,[r4,#0x90]
        0x08003172:    f0110f02    ....    TST      r1,#2
        0x08003176:    d1d1        ..      BNE      0x800311c ; LL_RCC_GetUSARTClockFreq + 152
        0x08003178:    bd70        p.      POP      {r4-r6,pc}
        0x0800317a:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x0800317e:    f001bd41    ..A.    B.W      RCC_GetSystemClockFreq ; 0x8004c04
        0x08003182:    6822        "h      LDR      r2,[r4,#0]
        0x08003184:    f3c22280    ..."    UBFX     r2,r2,#10,#1
        0x08003188:    2a00        .*      CMP      r2,#0
        0x0800318a:    d1be        ..      BNE      0x800310a ; LL_RCC_GetUSARTClockFreq + 134
        0x0800318c:    bd70        p.      POP      {r4-r6,pc}
        0x0800318e:    f8d41090    ....    LDR      r1,[r4,#0x90]
        0x08003192:    f0110f02    ....    TST      r1,#2
        0x08003196:    d1c1        ..      BNE      0x800311c ; LL_RCC_GetUSARTClockFreq + 152
        0x08003198:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x0800319a:    0000        ..      DCW    0
        0x0800319c:    00f42400    .$..    DCD    16000000
        0x080031a0:    08008a04    ....    DCD    134253060
        0x080031a4:    08008a14    ....    DCD    134253076
        0x080031a8:    40021000    ...@    DCD    1073876992
    $t
    i.LL_SPI_Init
    LL_SPI_Init
        0x080031ac:    6803        .h      LDR      r3,[r0,#0]
        0x080031ae:    2201        ."      MOVS     r2,#1
        0x080031b0:    f0130f40    ..@.    TST      r3,#0x40
        0x080031b4:    d131        1.      BNE      0x800321a ; LL_SPI_Init + 110
        0x080031b6:    e9d12300    ...#    LDRD     r2,r3,[r1,#0]
        0x080031ba:    431a        .C      ORRS     r2,r2,r3
        0x080031bc:    e9d13c03    ...<    LDRD     r3,r12,[r1,#0xc]
        0x080031c0:    ea43030c    C...    ORR      r3,r3,r12
        0x080031c4:    431a        .C      ORRS     r2,r2,r3
        0x080031c6:    694b        Ki      LDR      r3,[r1,#0x14]
        0x080031c8:    431a        .C      ORRS     r2,r2,r3
        0x080031ca:    698b        .i      LDR      r3,[r1,#0x18]
        0x080031cc:    431a        .C      ORRS     r2,r2,r3
        0x080031ce:    69cb        .i      LDR      r3,[r1,#0x1c]
        0x080031d0:    431a        .C      ORRS     r2,r2,r3
        0x080031d2:    6a0b        .j      LDR      r3,[r1,#0x20]
        0x080031d4:    431a        .C      ORRS     r2,r2,r3
        0x080031d6:    6803        .h      LDR      r3,[r0,#0]
        0x080031d8:    f02303bf    #...    BIC      r3,r3,#0xbf
        0x080031dc:    f423437f    #..C    BIC      r3,r3,#0xff00
        0x080031e0:    431a        .C      ORRS     r2,r2,r3
        0x080031e2:    6002        .`      STR      r2,[r0,#0]
        0x080031e4:    6842        Bh      LDR      r2,[r0,#4]
        0x080031e6:    694b        Ki      LDR      r3,[r1,#0x14]
        0x080031e8:    f4227241    ".Ar    BIC      r2,r2,#0x304
        0x080031ec:    f4226240    ".@b    BIC      r2,r2,#0xc00
        0x080031f0:    ea424213    B..B    ORR      r2,r2,r3,LSR #16
        0x080031f4:    688b        .h      LDR      r3,[r1,#8]
        0x080031f6:    431a        .C      ORRS     r2,r2,r3
        0x080031f8:    6042        B`      STR      r2,[r0,#4]
        0x080031fa:    688a        .h      LDR      r2,[r1,#8]
        0x080031fc:    f5b26f00    ...o    CMP      r2,#0x800
        0x08003200:    d203        ..      BCS      0x800320a ; LL_SPI_Init + 94
        0x08003202:    6842        Bh      LDR      r2,[r0,#4]
        0x08003204:    f4425280    B..R    ORR      r2,r2,#0x1000
        0x08003208:    6042        B`      STR      r2,[r0,#4]
        0x0800320a:    6a0a        .j      LDR      r2,[r1,#0x20]
        0x0800320c:    f5b25f00    ..._    CMP      r2,#0x2000
        0x08003210:    d102        ..      BNE      0x8003218 ; LL_SPI_Init + 108
        0x08003212:    8c89        ..      LDRH     r1,[r1,#0x24]
        0x08003214:    b289        ..      UXTH     r1,r1
        0x08003216:    6101        .a      STR      r1,[r0,#0x10]
        0x08003218:    2200        ."      MOVS     r2,#0
        0x0800321a:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x0800321c:    f4216100    !..a    BIC      r1,r1,#0x800
        0x08003220:    61c1        .a      STR      r1,[r0,#0x1c]
        0x08003222:    4610        .F      MOV      r0,r2
        0x08003224:    4770        pG      BX       lr
        0x08003226:    0000        ..      MOVS     r0,r0
    i.LL_SetSystemCoreClock
    LL_SetSystemCoreClock
        0x08003228:    4901        .I      LDR      r1,[pc,#4] ; [0x8003230] = 0x20000004
        0x0800322a:    6008        .`      STR      r0,[r1,#0]
        0x0800322c:    4770        pG      BX       lr
    $d
        0x0800322e:    0000        ..      DCW    0
        0x08003230:    20000004    ...     DCD    536870916
    $t
    i.LL_TIM_BDTR_Init
    LL_TIM_BDTR_Init
        0x08003234:    7b0a        .{      LDRB     r2,[r1,#0xc]
        0x08003236:    688b        .h      LDR      r3,[r1,#8]
        0x08003238:    431a        .C      ORRS     r2,r2,r3
        0x0800323a:    684b        Kh      LDR      r3,[r1,#4]
        0x0800323c:    f4226280    "..b    BIC      r2,r2,#0x400
        0x08003240:    431a        .C      ORRS     r2,r2,r3
        0x08003242:    680b        .h      LDR      r3,[r1,#0]
        0x08003244:    f4226200    "..b    BIC      r2,r2,#0x800
        0x08003248:    431a        .C      ORRS     r2,r2,r3
        0x0800324a:    89cb        ..      LDRH     r3,[r1,#0xe]
        0x0800324c:    f4225280    "..R    BIC      r2,r2,#0x1000
        0x08003250:    431a        .C      ORRS     r2,r2,r3
        0x08003252:    690b        .i      LDR      r3,[r1,#0x10]
        0x08003254:    f4225200    "..R    BIC      r2,r2,#0x2000
        0x08003258:    431a        .C      ORRS     r2,r2,r3
        0x0800325a:    6acb        .j      LDR      r3,[r1,#0x2c]
        0x0800325c:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08003260:    431a        .C      ORRS     r2,r2,r3
        0x08003262:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08003264:    f4222270    ".p"    BIC      r2,r2,#0xf0000
        0x08003268:    431a        .C      ORRS     r2,r2,r3
        0x0800326a:    698b        .i      LDR      r3,[r1,#0x18]
        0x0800326c:    f0225280    "..R    BIC      r2,r2,#0x10000000
        0x08003270:    431a        .C      ORRS     r2,r2,r3
        0x08003272:    f1a04380    ...C    SUB      r3,r0,#0x40000000
        0x08003276:    f5b33396    ...3    SUBS     r3,r3,#0x12c00
        0x0800327a:    bf1c        ..      ITT      NE
        0x0800327c:    f1a04380    ...C    SUBNE    r3,r0,#0x40000000
        0x08003280:    f5b3339a    ...3    SUBSNE   r3,r3,#0x13400
        0x08003284:    d10f        ..      BNE      0x80032a6 ; LL_TIM_BDTR_Init + 114
        0x08003286:    6a4b        Kj      LDR      r3,[r1,#0x24]
        0x08003288:    f4220270    ".p.    BIC      r2,r2,#0xf00000
        0x0800328c:    431a        .C      ORRS     r2,r2,r3
        0x0800328e:    69cb        .i      LDR      r3,[r1,#0x1c]
        0x08003290:    f0227280    "..r    BIC      r2,r2,#0x1000000
        0x08003294:    431a        .C      ORRS     r2,r2,r3
        0x08003296:    6a0b        .j      LDR      r3,[r1,#0x20]
        0x08003298:    f0227200    "..r    BIC      r2,r2,#0x2000000
        0x0800329c:    431a        .C      ORRS     r2,r2,r3
        0x0800329e:    6a89        .j      LDR      r1,[r1,#0x28]
        0x080032a0:    f0225200    "..R    BIC      r2,r2,#0x20000000
        0x080032a4:    430a        .C      ORRS     r2,r2,r1
        0x080032a6:    6442        Bd      STR      r2,[r0,#0x44]
        0x080032a8:    2000        .       MOVS     r0,#0
        0x080032aa:    4770        pG      BX       lr
    i.LL_TIM_Init
    LL_TIM_Init
        0x080032ac:    e92d01f0    -...    PUSH     {r4-r8}
        0x080032b0:    6802        .h      LDR      r2,[r0,#0]
        0x080032b2:    4b23        #K      LDR      r3,[pc,#140] ; [0x8003340] = 0x40012c00
        0x080032b4:    4c23        #L      LDR      r4,[pc,#140] ; [0x8003344] = 0x40000400
        0x080032b6:    f8df8090    ....    LDR      r8,[pc,#144] ; [0x8003348] = 0x40000800
        0x080032ba:    f8dfc090    ....    LDR      r12,[pc,#144] ; [0x800334c] = 0x40013400
        0x080032be:    4298        .B      CMP      r0,r3
        0x080032c0:    bf18        ..      IT       NE
        0x080032c2:    f1b04f80    ...O    CMPNE    r0,#0x40000000
        0x080032c6:    d004        ..      BEQ      0x80032d2 ; LL_TIM_Init + 38
        0x080032c8:    42a0        .B      CMP      r0,r4
        0x080032ca:    bf1c        ..      ITT      NE
        0x080032cc:    4540        @E      CMPNE    r0,r8
        0x080032ce:    4560        `E      CMPNE    r0,r12
        0x080032d0:    d104        ..      BNE      0x80032dc ; LL_TIM_Init + 48
        0x080032d2:    684d        Mh      LDR      r5,[r1,#4]
        0x080032d4:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x080032d8:    ea420205    B...    ORR      r2,r2,r5
        0x080032dc:    4d1c        .M      LDR      r5,[pc,#112] ; [0x8003350] = 0x40014000
        0x080032de:    4e1d        .N      LDR      r6,[pc,#116] ; [0x8003354] = 0x40014400
        0x080032e0:    4f1d        .O      LDR      r7,[pc,#116] ; [0x8003358] = 0x40014800
        0x080032e2:    4298        .B      CMP      r0,r3
        0x080032e4:    bf18        ..      IT       NE
        0x080032e6:    f1b04f80    ...O    CMPNE    r0,#0x40000000
        0x080032ea:    d00b        ..      BEQ      0x8003304 ; LL_TIM_Init + 88
        0x080032ec:    42a0        .B      CMP      r0,r4
        0x080032ee:    bf18        ..      IT       NE
        0x080032f0:    4540        @E      CMPNE    r0,r8
        0x080032f2:    d007        ..      BEQ      0x8003304 ; LL_TIM_Init + 88
        0x080032f4:    4560        `E      CMP      r0,r12
        0x080032f6:    bf18        ..      IT       NE
        0x080032f8:    42a8        .B      CMPNE    r0,r5
        0x080032fa:    d003        ..      BEQ      0x8003304 ; LL_TIM_Init + 88
        0x080032fc:    42b0        .B      CMP      r0,r6
        0x080032fe:    bf18        ..      IT       NE
        0x08003300:    42b8        .B      CMPNE    r0,r7
        0x08003302:    d104        ..      BNE      0x800330e ; LL_TIM_Init + 98
        0x08003304:    68cc        .h      LDR      r4,[r1,#0xc]
        0x08003306:    f4227240    ".@r    BIC      r2,r2,#0x300
        0x0800330a:    ea420204    B...    ORR      r2,r2,r4
        0x0800330e:    6002        .`      STR      r2,[r0,#0]
        0x08003310:    688a        .h      LDR      r2,[r1,#8]
        0x08003312:    62c2        .b      STR      r2,[r0,#0x2c]
        0x08003314:    880a        ..      LDRH     r2,[r1,#0]
        0x08003316:    6282        .b      STR      r2,[r0,#0x28]
        0x08003318:    4298        .B      CMP      r0,r3
        0x0800331a:    bf18        ..      IT       NE
        0x0800331c:    4560        `E      CMPNE    r0,r12
        0x0800331e:    d004        ..      BEQ      0x800332a ; LL_TIM_Init + 126
        0x08003320:    42a8        .B      CMP      r0,r5
        0x08003322:    bf1c        ..      ITT      NE
        0x08003324:    42b0        .B      CMPNE    r0,r6
        0x08003326:    42b8        .B      CMPNE    r0,r7
        0x08003328:    d101        ..      BNE      0x800332e ; LL_TIM_Init + 130
        0x0800332a:    6909        .i      LDR      r1,[r1,#0x10]
        0x0800332c:    6301        .c      STR      r1,[r0,#0x30]
        0x0800332e:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08003330:    f0410101    A...    ORR      r1,r1,#1
        0x08003334:    6141        Aa      STR      r1,[r0,#0x14]
        0x08003336:    e8bd01f0    ....    POP      {r4-r8}
        0x0800333a:    f04f0000    O...    MOV      r0,#0
        0x0800333e:    4770        pG      BX       lr
    $d
        0x08003340:    40012c00    .,.@    DCD    1073818624
        0x08003344:    40000400    ...@    DCD    1073742848
        0x08003348:    40000800    ...@    DCD    1073743872
        0x0800334c:    40013400    .4.@    DCD    1073820672
        0x08003350:    40014000    .@.@    DCD    1073823744
        0x08003354:    40014400    .D.@    DCD    1073824768
        0x08003358:    40014800    .H.@    DCD    1073825792
    $t
    i.LL_TIM_OC_Init
    LL_TIM_OC_Init
        0x0800335c:    e92d07f0    -...    PUSH     {r4-r10}
        0x08003360:    2300        .#      MOVS     r3,#0
        0x08003362:    f8dfc338    ..8.    LDR      r12,[pc,#824] ; [0x800369c] = 0x40012c00
        0x08003366:    4cce        .L      LDR      r4,[pc,#824] ; [0x80036a0] = 0x40013400
        0x08003368:    4dce        .M      LDR      r5,[pc,#824] ; [0x80036a4] = 0x40014000
        0x0800336a:    4ecf        .N      LDR      r6,[pc,#828] ; [0x80036a8] = 0x40014400
        0x0800336c:    4fcf        .O      LDR      r7,[pc,#828] ; [0x80036ac] = 0x40014800
        0x0800336e:    f04f0801    O...    MOV      r8,#1
        0x08003372:    f5b15f80    ..._    CMP      r1,#0x1000
        0x08003376:    f00080e0    ....    BEQ.W    0x800353a ; LL_TIM_OC_Init + 478
        0x0800337a:    dc08        ..      BGT      0x800338e ; LL_TIM_OC_Init + 50
        0x0800337c:    2901        .)      CMP      r1,#1
        0x0800337e:    d010        ..      BEQ      0x80033a2 ; LL_TIM_OC_Init + 70
        0x08003380:    2910        .)      CMP      r1,#0x10
        0x08003382:    d052        R.      BEQ      0x800342a ; LL_TIM_OC_Init + 206
        0x08003384:    f5b17f80    ....    CMP      r1,#0x100
        0x08003388:    d07e        ~.      BEQ      0x8003488 ; LL_TIM_OC_Init + 300
        0x0800338a:    f000b983    ....    B.W      0x8003694 ; LL_TIM_OC_Init + 824
        0x0800338e:    f5b13f80    ...?    CMP      r1,#0x10000
        0x08003392:    f0008117    ....    BEQ.W    0x80035c4 ; LL_TIM_OC_Init + 616
        0x08003396:    f5b11f80    ....    CMP      r1,#0x100000
        0x0800339a:    f0008148    ..H.    BEQ.W    0x800362e ; LL_TIM_OC_Init + 722
        0x0800339e:    f000b979    ..y.    B.W      0x8003694 ; LL_TIM_OC_Init + 824
        0x080033a2:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080033a4:    f0210101    !...    BIC      r1,r1,#1
        0x080033a8:    6201        .b      STR      r1,[r0,#0x20]
        0x080033aa:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080033ac:    f8d08004    ....    LDR      r8,[r0,#4]
        0x080033b0:    f8d09018    ....    LDR      r9,[r0,#0x18]
        0x080033b4:    f8d2a000    ....    LDR      r10,[r2,#0]
        0x080033b8:    f0290973    ).s.    BIC      r9,r9,#0x73
        0x080033bc:    f4293980    )..9    BIC      r9,r9,#0x10000
        0x080033c0:    ea49090a    I...    ORR      r9,r9,r10
        0x080033c4:    f8d2a010    ....    LDR      r10,[r2,#0x10]
        0x080033c8:    f0210102    !...    BIC      r1,r1,#2
        0x080033cc:    ea41010a    A...    ORR      r1,r1,r10
        0x080033d0:    f8d2a004    ....    LDR      r10,[r2,#4]
        0x080033d4:    f0210101    !...    BIC      r1,r1,#1
        0x080033d8:    ea41010a    A...    ORR      r1,r1,r10
        0x080033dc:    4560        `E      CMP      r0,r12
        0x080033de:    bf18        ..      IT       NE
        0x080033e0:    42a0        .B      CMPNE    r0,r4
        0x080033e2:    d004        ..      BEQ      0x80033ee ; LL_TIM_OC_Init + 146
        0x080033e4:    42a8        .B      CMP      r0,r5
        0x080033e6:    bf1c        ..      ITT      NE
        0x080033e8:    42b0        .B      CMPNE    r0,r6
        0x080033ea:    42b8        .B      CMPNE    r0,r7
        0x080033ec:    d115        ..      BNE      0x800341a ; LL_TIM_OC_Init + 190
        0x080033ee:    f8d2c014    ....    LDR      r12,[r2,#0x14]
        0x080033f2:    f0210108    !...    BIC      r1,r1,#8
        0x080033f6:    ea41018c    A...    ORR      r1,r1,r12,LSL #2
        0x080033fa:    f8d2c008    ....    LDR      r12,[r2,#8]
        0x080033fe:    f0210104    !...    BIC      r1,r1,#4
        0x08003402:    ea41018c    A...    ORR      r1,r1,r12,LSL #2
        0x08003406:    6994        .i      LDR      r4,[r2,#0x18]
        0x08003408:    f4287c80    (..|    BIC      r12,r8,#0x100
        0x0800340c:    ea4c0c04    L...    ORR      r12,r12,r4
        0x08003410:    69d4        .i      LDR      r4,[r2,#0x1c]
        0x08003412:    f42c7c00    ,..|    BIC      r12,r12,#0x200
        0x08003416:    ea4c0844    L.D.    ORR      r8,r12,r4,LSL #1
        0x0800341a:    f8c08004    ....    STR      r8,[r0,#4]
        0x0800341e:    f8c09018    ....    STR      r9,[r0,#0x18]
        0x08003422:    68d2        .h      LDR      r2,[r2,#0xc]
        0x08003424:    6342        Bc      STR      r2,[r0,#0x34]
        0x08003426:    f000b933    ..3.    B.W      0x8003690 ; LL_TIM_OC_Init + 820
        0x0800342a:    6a01        .j      LDR      r1,[r0,#0x20]
        0x0800342c:    f0210110    !...    BIC      r1,r1,#0x10
        0x08003430:    6201        .b      STR      r1,[r0,#0x20]
        0x08003432:    f8d08020    .. .    LDR      r8,[r0,#0x20]
        0x08003436:    6841        Ah      LDR      r1,[r0,#4]
        0x08003438:    f8d09018    ....    LDR      r9,[r0,#0x18]
        0x0800343c:    f8d2a000    ....    LDR      r10,[r2,#0]
        0x08003440:    f42949e6    )..I    BIC      r9,r9,#0x7300
        0x08003444:    f0297980    )..y    BIC      r9,r9,#0x1000000
        0x08003448:    ea49290a    I..)    ORR      r9,r9,r10,LSL #8
        0x0800344c:    f8d2a010    ....    LDR      r10,[r2,#0x10]
        0x08003450:    f0280820    (. .    BIC      r8,r8,#0x20
        0x08003454:    ea48180a    H...    ORR      r8,r8,r10,LSL #4
        0x08003458:    f8d2a004    ....    LDR      r10,[r2,#4]
        0x0800345c:    f0280810    (...    BIC      r8,r8,#0x10
        0x08003460:    ea48180a    H...    ORR      r8,r8,r10,LSL #4
        0x08003464:    4560        `E      CMP      r0,r12
        0x08003466:    bf18        ..      IT       NE
        0x08003468:    42a0        .B      CMPNE    r0,r4
        0x0800346a:    d004        ..      BEQ      0x8003476 ; LL_TIM_OC_Init + 282
        0x0800346c:    42a8        .B      CMP      r0,r5
        0x0800346e:    bf1c        ..      ITT      NE
        0x08003470:    42b0        .B      CMPNE    r0,r6
        0x08003472:    42b8        .B      CMPNE    r0,r7
        0x08003474:    d117        ..      BNE      0x80034a6 ; LL_TIM_OC_Init + 330
        0x08003476:    6954        Ti      LDR      r4,[r2,#0x14]
        0x08003478:    f0280c80    (...    BIC      r12,r8,#0x80
        0x0800347c:    ea4c1c84    L...    ORR      r12,r12,r4,LSL #6
        0x08003480:    f02c0c40    ,.@.    BIC      r12,r12,#0x40
        0x08003484:    6894        .h      LDR      r4,[r2,#8]
        0x08003486:    e000        ..      B        0x800348a ; LL_TIM_OC_Init + 302
        0x08003488:    e013        ..      B        0x80034b2 ; LL_TIM_OC_Init + 342
        0x0800348a:    ea4c1884    L...    ORR      r8,r12,r4,LSL #6
        0x0800348e:    f8d2c018    ....    LDR      r12,[r2,#0x18]
        0x08003492:    f4216180    !..a    BIC      r1,r1,#0x400
        0x08003496:    ea41018c    A...    ORR      r1,r1,r12,LSL #2
        0x0800349a:    f8d2c01c    ....    LDR      r12,[r2,#0x1c]
        0x0800349e:    f4216100    !..a    BIC      r1,r1,#0x800
        0x080034a2:    ea4101cc    A...    ORR      r1,r1,r12,LSL #3
        0x080034a6:    6041        A`      STR      r1,[r0,#4]
        0x080034a8:    f8c09018    ....    STR      r9,[r0,#0x18]
        0x080034ac:    68d1        .h      LDR      r1,[r2,#0xc]
        0x080034ae:    6381        .c      STR      r1,[r0,#0x38]
        0x080034b0:    e040        @.      B        0x8003534 ; LL_TIM_OC_Init + 472
        0x080034b2:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080034b4:    f4217180    !..q    BIC      r1,r1,#0x100
        0x080034b8:    6201        .b      STR      r1,[r0,#0x20]
        0x080034ba:    f8d08020    .. .    LDR      r8,[r0,#0x20]
        0x080034be:    6841        Ah      LDR      r1,[r0,#4]
        0x080034c0:    f8d0901c    ....    LDR      r9,[r0,#0x1c]
        0x080034c4:    f8d2a000    ....    LDR      r10,[r2,#0]
        0x080034c8:    f0290973    ).s.    BIC      r9,r9,#0x73
        0x080034cc:    f4293980    )..9    BIC      r9,r9,#0x10000
        0x080034d0:    ea49090a    I...    ORR      r9,r9,r10
        0x080034d4:    f8d2a010    ....    LDR      r10,[r2,#0x10]
        0x080034d8:    f4287800    (..x    BIC      r8,r8,#0x200
        0x080034dc:    ea48280a    H..(    ORR      r8,r8,r10,LSL #8
        0x080034e0:    f8d2a004    ....    LDR      r10,[r2,#4]
        0x080034e4:    f4287880    (..x    BIC      r8,r8,#0x100
        0x080034e8:    ea48280a    H..(    ORR      r8,r8,r10,LSL #8
        0x080034ec:    4560        `E      CMP      r0,r12
        0x080034ee:    bf18        ..      IT       NE
        0x080034f0:    42a0        .B      CMPNE    r0,r4
        0x080034f2:    d004        ..      BEQ      0x80034fe ; LL_TIM_OC_Init + 418
        0x080034f4:    42a8        .B      CMP      r0,r5
        0x080034f6:    bf1c        ..      ITT      NE
        0x080034f8:    42b0        .B      CMPNE    r0,r6
        0x080034fa:    42b8        .B      CMPNE    r0,r7
        0x080034fc:    d115        ..      BNE      0x800352a ; LL_TIM_OC_Init + 462
        0x080034fe:    6954        Ti      LDR      r4,[r2,#0x14]
        0x08003500:    f4286c00    (..l    BIC      r12,r8,#0x800
        0x08003504:    ea4c2c84    L..,    ORR      r12,r12,r4,LSL #10
        0x08003508:    6894        .h      LDR      r4,[r2,#8]
        0x0800350a:    f42c6c80    ,..l    BIC      r12,r12,#0x400
        0x0800350e:    ea4c2884    L..(    ORR      r8,r12,r4,LSL #10
        0x08003512:    f8d2c018    ....    LDR      r12,[r2,#0x18]
        0x08003516:    f4215180    !..Q    BIC      r1,r1,#0x1000
        0x0800351a:    ea41110c    A...    ORR      r1,r1,r12,LSL #4
        0x0800351e:    f8d2c01c    ....    LDR      r12,[r2,#0x1c]
        0x08003522:    f4215100    !..Q    BIC      r1,r1,#0x2000
        0x08003526:    ea41114c    A.L.    ORR      r1,r1,r12,LSL #5
        0x0800352a:    6041        A`      STR      r1,[r0,#4]
        0x0800352c:    f8c0901c    ....    STR      r9,[r0,#0x1c]
        0x08003530:    68d1        .h      LDR      r1,[r2,#0xc]
        0x08003532:    63c1        .c      STR      r1,[r0,#0x3c]
        0x08003534:    f8c08020    .. .    STR      r8,[r0,#0x20]
        0x08003538:    e0ab        ..      B        0x8003692 ; LL_TIM_OC_Init + 822
        0x0800353a:    6a01        .j      LDR      r1,[r0,#0x20]
