ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800353c:    f4215180    !..Q    BIC      r1,r1,#0x1000
        0x08003540:    6201        .b      STR      r1,[r0,#0x20]
        0x08003542:    f8d08020    .. .    LDR      r8,[r0,#0x20]
        0x08003546:    6841        Ah      LDR      r1,[r0,#4]
        0x08003548:    f8d0901c    ....    LDR      r9,[r0,#0x1c]
        0x0800354c:    f8d2a000    ....    LDR      r10,[r2,#0]
        0x08003550:    f42949e6    )..I    BIC      r9,r9,#0x7300
        0x08003554:    f0297980    )..y    BIC      r9,r9,#0x1000000
        0x08003558:    ea49290a    I..)    ORR      r9,r9,r10,LSL #8
        0x0800355c:    f8d2a010    ....    LDR      r10,[r2,#0x10]
        0x08003560:    f4285800    (..X    BIC      r8,r8,#0x2000
        0x08003564:    ea48380a    H..8    ORR      r8,r8,r10,LSL #12
        0x08003568:    f8d2a004    ....    LDR      r10,[r2,#4]
        0x0800356c:    f4285880    (..X    BIC      r8,r8,#0x1000
        0x08003570:    ea48380a    H..8    ORR      r8,r8,r10,LSL #12
        0x08003574:    4560        `E      CMP      r0,r12
        0x08003576:    bf18        ..      IT       NE
        0x08003578:    42a0        .B      CMPNE    r0,r4
        0x0800357a:    d004        ..      BEQ      0x8003586 ; LL_TIM_OC_Init + 554
        0x0800357c:    42a8        .B      CMP      r0,r5
        0x0800357e:    bf1c        ..      ITT      NE
        0x08003580:    42b0        .B      CMPNE    r0,r6
        0x08003582:    42b8        .B      CMPNE    r0,r7
        0x08003584:    d115        ..      BNE      0x80035b2 ; LL_TIM_OC_Init + 598
        0x08003586:    6954        Ti      LDR      r4,[r2,#0x14]
        0x08003588:    f4284c00    (..L    BIC      r12,r8,#0x8000
        0x0800358c:    ea4c3c84    L..<    ORR      r12,r12,r4,LSL #14
        0x08003590:    6894        .h      LDR      r4,[r2,#8]
        0x08003592:    f42c4c80    ,..L    BIC      r12,r12,#0x4000
        0x08003596:    ea4c3884    L..8    ORR      r8,r12,r4,LSL #14
        0x0800359a:    f8d2c018    ....    LDR      r12,[r2,#0x18]
        0x0800359e:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x080035a2:    ea41118c    A...    ORR      r1,r1,r12,LSL #6
        0x080035a6:    f8d2c01c    ....    LDR      r12,[r2,#0x1c]
        0x080035aa:    f4214100    !..A    BIC      r1,r1,#0x8000
        0x080035ae:    ea4111cc    A...    ORR      r1,r1,r12,LSL #7
        0x080035b2:    6041        A`      STR      r1,[r0,#4]
        0x080035b4:    f8c0901c    ....    STR      r9,[r0,#0x1c]
        0x080035b8:    68d1        .h      LDR      r1,[r2,#0xc]
        0x080035ba:    6401        .d      STR      r1,[r0,#0x40]
        0x080035bc:    f8c08020    .. .    STR      r8,[r0,#0x20]
        0x080035c0:    4698        .F      MOV      r8,r3
        0x080035c2:    e067        g.      B        0x8003694 ; LL_TIM_OC_Init + 824
        0x080035c4:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080035c6:    f4213180    !..1    BIC      r1,r1,#0x10000
        0x080035ca:    6201        .b      STR      r1,[r0,#0x20]
        0x080035cc:    f8d08020    .. .    LDR      r8,[r0,#0x20]
        0x080035d0:    6d01        .m      LDR      r1,[r0,#0x50]
        0x080035d2:    f8d29000    ....    LDR      r9,[r2,#0]
        0x080035d6:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x080035da:    f4213180    !..1    BIC      r1,r1,#0x10000
        0x080035de:    ea410109    A...    ORR      r1,r1,r9
        0x080035e2:    f8b29010    ....    LDRH     r9,[r2,#0x10]
        0x080035e6:    f4283800    (..8    BIC      r8,r8,#0x20000
        0x080035ea:    ea484809    H..H    ORR      r8,r8,r9,LSL #16
        0x080035ee:    f8b29004    ....    LDRH     r9,[r2,#4]
        0x080035f2:    f4283880    (..8    BIC      r8,r8,#0x10000
        0x080035f6:    ea484809    H..H    ORR      r8,r8,r9,LSL #16
        0x080035fa:    4560        `E      CMP      r0,r12
        0x080035fc:    bf18        ..      IT       NE
        0x080035fe:    42a0        .B      CMPNE    r0,r4
        0x08003600:    d004        ..      BEQ      0x800360c ; LL_TIM_OC_Init + 688
        0x08003602:    42a8        .B      CMP      r0,r5
        0x08003604:    bf1c        ..      ITT      NE
        0x08003606:    42b0        .B      CMPNE    r0,r6
        0x08003608:    42b8        .B      CMPNE    r0,r7
        0x0800360a:    d108        ..      BNE      0x800361e ; LL_TIM_OC_Init + 706
        0x0800360c:    f8d0c004    ....    LDR      r12,[r0,#4]
        0x08003610:    6994        .i      LDR      r4,[r2,#0x18]
        0x08003612:    f42c3c80    ,..<    BIC      r12,r12,#0x10000
        0x08003616:    ea4c2c04    L..,    ORR      r12,r12,r4,LSL #8
        0x0800361a:    f8c0c004    ....    STR      r12,[r0,#4]
        0x0800361e:    6501        .e      STR      r1,[r0,#0x50]
        0x08003620:    68d1        .h      LDR      r1,[r2,#0xc]
        0x08003622:    6c82        .l      LDR      r2,[r0,#0x48]
        0x08003624:    6481        .d      STR      r1,[r0,#0x48]
        0x08003626:    f8c08020    .. .    STR      r8,[r0,#0x20]
        0x0800362a:    4698        .F      MOV      r8,r3
        0x0800362c:    e032        2.      B        0x8003694 ; LL_TIM_OC_Init + 824
        0x0800362e:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08003630:    f4211180    !...    BIC      r1,r1,#0x100000
        0x08003634:    6201        .b      STR      r1,[r0,#0x20]
        0x08003636:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08003638:    f8d08050    ..P.    LDR      r8,[r0,#0x50]
        0x0800363c:    f8d29000    ....    LDR      r9,[r2,#0]
        0x08003640:    f42848e0    (..H    BIC      r8,r8,#0x7000
        0x08003644:    f0287880    (..x    BIC      r8,r8,#0x1000000
        0x08003648:    ea482809    H..(    ORR      r8,r8,r9,LSL #8
        0x0800364c:    f8b29010    ....    LDRH     r9,[r2,#0x10]
        0x08003650:    f4211100    !...    BIC      r1,r1,#0x200000
        0x08003654:    ea415109    A..Q    ORR      r1,r1,r9,LSL #20
        0x08003658:    f8b29004    ....    LDRH     r9,[r2,#4]
        0x0800365c:    f4211180    !...    BIC      r1,r1,#0x100000
        0x08003660:    ea415109    A..Q    ORR      r1,r1,r9,LSL #20
        0x08003664:    4560        `E      CMP      r0,r12
        0x08003666:    bf18        ..      IT       NE
        0x08003668:    42a0        .B      CMPNE    r0,r4
        0x0800366a:    d004        ..      BEQ      0x8003676 ; LL_TIM_OC_Init + 794
        0x0800366c:    42a8        .B      CMP      r0,r5
        0x0800366e:    bf1c        ..      ITT      NE
        0x08003670:    42b0        .B      CMPNE    r0,r6
        0x08003672:    42b8        .B      CMPNE    r0,r7
        0x08003674:    d108        ..      BNE      0x8003688 ; LL_TIM_OC_Init + 812
        0x08003676:    f8d0c004    ....    LDR      r12,[r0,#4]
        0x0800367a:    6994        .i      LDR      r4,[r2,#0x18]
        0x0800367c:    f42c2c80    ,..,    BIC      r12,r12,#0x40000
        0x08003680:    ea4c2c84    L..,    ORR      r12,r12,r4,LSL #10
        0x08003684:    f8c0c004    ....    STR      r12,[r0,#4]
        0x08003688:    f8c08050    ..P.    STR      r8,[r0,#0x50]
        0x0800368c:    68d2        .h      LDR      r2,[r2,#0xc]
        0x0800368e:    64c2        .d      STR      r2,[r0,#0x4c]
        0x08003690:    6201        .b      STR      r1,[r0,#0x20]
        0x08003692:    4698        .F      MOV      r8,r3
        0x08003694:    4640        @F      MOV      r0,r8
        0x08003696:    e8bd07f0    ....    POP      {r4-r10}
        0x0800369a:    4770        pG      BX       lr
    $d
        0x0800369c:    40012c00    .,.@    DCD    1073818624
        0x080036a0:    40013400    .4.@    DCD    1073820672
        0x080036a4:    40014000    .@.@    DCD    1073823744
        0x080036a8:    40014400    .D.@    DCD    1073824768
        0x080036ac:    40014800    .H.@    DCD    1073825792
    $t
    i.LL_USART_Init
    LL_USART_Init
        0x080036b0:    b570        p.      PUSH     {r4-r6,lr}
        0x080036b2:    4604        .F      MOV      r4,r0
        0x080036b4:    6800        .h      LDR      r0,[r0,#0]
        0x080036b6:    460d        .F      MOV      r5,r1
        0x080036b8:    2601        .&      MOVS     r6,#1
        0x080036ba:    f0100f01    ....    TST      r0,#1
        0x080036be:    d15c        \.      BNE      0x800377a ; LL_USART_Init + 202
        0x080036c0:    6929        )i      LDR      r1,[r5,#0x10]
        0x080036c2:    68a8        .h      LDR      r0,[r5,#8]
        0x080036c4:    69ea        .i      LDR      r2,[r5,#0x1c]
        0x080036c6:    4308        .C      ORRS     r0,r0,r1
        0x080036c8:    6969        ii      LDR      r1,[r5,#0x14]
        0x080036ca:    4311        .C      ORRS     r1,r1,r2
        0x080036cc:    4308        .C      ORRS     r0,r0,r1
        0x080036ce:    6821        !h      LDR      r1,[r4,#0]
        0x080036d0:    4a31        1J      LDR      r2,[pc,#196] ; [0x8003798] = 0xefff69f3
        0x080036d2:    4011        .@      ANDS     r1,r1,r2
        0x080036d4:    4308        .C      ORRS     r0,r0,r1
        0x080036d6:    6020         `      STR      r0,[r4,#0]
        0x080036d8:    68e8        .h      LDR      r0,[r5,#0xc]
        0x080036da:    6861        ah      LDR      r1,[r4,#4]
        0x080036dc:    f4215140    !.@Q    BIC      r1,r1,#0x3000
        0x080036e0:    4308        .C      ORRS     r0,r0,r1
        0x080036e2:    6060        ``      STR      r0,[r4,#4]
        0x080036e4:    69a8        .i      LDR      r0,[r5,#0x18]
        0x080036e6:    68a1        .h      LDR      r1,[r4,#8]
        0x080036e8:    f4217140    !.@q    BIC      r1,r1,#0x300
        0x080036ec:    4308        .C      ORRS     r0,r0,r1
        0x080036ee:    60a0        .`      STR      r0,[r4,#8]
        0x080036f0:    f1a44080    ...@    SUB      r0,r4,#0x40000000
        0x080036f4:    f5b0309c    ...0    SUBS     r0,r0,#0x13800
        0x080036f8:    d013        ..      BEQ      0x8003722 ; LL_USART_Init + 114
        0x080036fa:    f1a44080    ...@    SUB      r0,r4,#0x40000000
        0x080036fe:    f5b04088    ...@    SUBS     r0,r0,#0x4400
        0x08003702:    bf08        ..      IT       EQ
        0x08003704:    200c        .       MOVEQ    r0,#0xc
        0x08003706:    d010        ..      BEQ      0x800372a ; LL_USART_Init + 122
        0x08003708:    f1a44080    ...@    SUB      r0,r4,#0x40000000
        0x0800370c:    f5b04090    ...@    SUBS     r0,r0,#0x4800
        0x08003710:    bf08        ..      IT       EQ
        0x08003712:    2030        0       MOVEQ    r0,#0x30
        0x08003714:    d009        ..      BEQ      0x800372a ; LL_USART_Init + 122
        0x08003716:    f1a44080    ...@    SUB      r0,r4,#0x40000000
        0x0800371a:    f5b04098    ...@    SUBS     r0,r0,#0x4c00
        0x0800371e:    d007        ..      BEQ      0x8003730 ; LL_USART_Init + 128
        0x08003720:    e024        $.      B        0x800376c ; LL_USART_Init + 188
        0x08003722:    2003        .       MOVS     r0,#3
        0x08003724:    f7fffcae    ....    BL       LL_RCC_GetUSARTClockFreq ; 0x8003084
        0x08003728:    e005        ..      B        0x8003736 ; LL_USART_Init + 134
        0x0800372a:    f7fffcab    ....    BL       LL_RCC_GetUSARTClockFreq ; 0x8003084
        0x0800372e:    e002        ..      B        0x8003736 ; LL_USART_Init + 134
        0x08003730:    20c0        .       MOVS     r0,#0xc0
        0x08003732:    f7fffc63    ..c.    BL       LL_RCC_GetUARTClockFreq ; 0x8002ffc
        0x08003736:    2800        .(      CMP      r0,#0
        0x08003738:    bf1c        ..      ITT      NE
        0x0800373a:    6869        ih      LDRNE    r1,[r5,#4]
        0x0800373c:    2900        .)      CMPNE    r1,#0
        0x0800373e:    d015        ..      BEQ      0x800376c ; LL_USART_Init + 188
        0x08003740:    682a        *h      LDR      r2,[r5,#0]
        0x08003742:    69eb        .i      LDR      r3,[r5,#0x1c]
        0x08003744:    f04f0600    O...    MOV      r6,#0
        0x08003748:    2a0b        .*      CMP      r2,#0xb
        0x0800374a:    d80f        ..      BHI      0x800376c ; LL_USART_Init + 188
        0x0800374c:    f8dfc04c    ..L.    LDR      r12,[pc,#76] ; [0x800379c] = 0x8008e2c
        0x08003750:    b2d2        ..      UXTB     r2,r2
        0x08003752:    f5b34f00    ...O    CMP      r3,#0x8000
        0x08003756:    f85c2022    \."     LDR      r2,[r12,r2,LSL #2]
        0x0800375a:    fbb0f0f2    ....    UDIV     r0,r0,r2
        0x0800375e:    d00e        ..      BEQ      0x800377e ; LL_USART_Init + 206
        0x08003760:    eb000051    ..Q.    ADD      r0,r0,r1,LSR #1
        0x08003764:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08003768:    b280        ..      UXTH     r0,r0
        0x0800376a:    60e0        .`      STR      r0,[r4,#0xc]
        0x0800376c:    8828        (.      LDRH     r0,[r5,#0]
        0x0800376e:    6ae1        .j      LDR      r1,[r4,#0x2c]
        0x08003770:    b280        ..      UXTH     r0,r0
        0x08003772:    f021010f    !...    BIC      r1,r1,#0xf
        0x08003776:    4308        .C      ORRS     r0,r0,r1
        0x08003778:    62e0        .b      STR      r0,[r4,#0x2c]
        0x0800377a:    4630        0F      MOV      r0,r6
        0x0800377c:    bd70        p.      POP      {r4-r6,pc}
        0x0800377e:    0040        @.      LSLS     r0,r0,#1
        0x08003780:    eb000051    ..Q.    ADD      r0,r0,r1,LSR #1
        0x08003784:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08003788:    b280        ..      UXTH     r0,r0
        0x0800378a:    f64f71f0    O..q    MOV      r1,#0xfff0
        0x0800378e:    4001        .@      ANDS     r1,r1,r0
        0x08003790:    f3c00042    ..B.    UBFX     r0,r0,#1,#3
        0x08003794:    4308        .C      ORRS     r0,r0,r1
        0x08003796:    e7e8        ..      B        0x800376a ; LL_USART_Init + 186
    $d
        0x08003798:    efff69f3    .i..    DCD    4026493427
        0x0800379c:    08008e2c    ,...    DCD    134254124
    $t
    i.LPF_2stOrder_1in_1out_Calculate
    LPF_2stOrder_1in_1out_Calculate
        0x080037a0:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x080037a4:    ed900a00    ....    VLDR     s0,[r0,#0]
        0x080037a8:    ed901a04    ....    VLDR     s2,[r0,#0x10]
        0x080037ac:    edd01a01    ....    VLDR     s3,[r0,#4]
        0x080037b0:    ed902a05    ...*    VLDR     s4,[r0,#0x14]
        0x080037b4:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x080037b8:    ee010a82    ....    VMLA.F32 s0,s3,s4
        0x080037bc:    edd01a02    ....    VLDR     s3,[r0,#8]
        0x080037c0:    ed902a06    ...*    VLDR     s4,[r0,#0x18]
        0x080037c4:    ee010aa0    ....    VMLA.F32 s0,s3,s1
        0x080037c8:    edd01a03    ....    VLDR     s3,[r0,#0xc]
        0x080037cc:    ed801a05    ....    VSTR     s2,[r0,#0x14]
        0x080037d0:    ee010a82    ....    VMLA.F32 s0,s3,s4
        0x080037d4:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x080037d8:    edc00a06    ....    VSTR     s1,[r0,#0x18]
        0x080037dc:    4770        pG      BX       lr
        0x080037de:    0000        ..      MOVS     r0,r0
    i.LPF_2stOrder_1in_1out_SetPar
    LPF_2stOrder_1in_1out_SetPar
        0x080037e0:    ec800a04    ....    VSTM     r0,{s0-s3}
        0x080037e4:    ed9f0a04    ....    VLDR     s0,[pc,#16] ; [0x80037f8] = 0
        0x080037e8:    ed800a06    ....    VSTR     s0,[r0,#0x18]
        0x080037ec:    ed800a05    ....    VSTR     s0,[r0,#0x14]
        0x080037f0:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x080037f4:    4770        pG      BX       lr
    $d
        0x080037f6:    0000        ..      DCW    0
        0x080037f8:    00000000    ....    DCD    0
    $t
    i.MCParIdentify_Rs_Ls
    MCParIdentify_Rs_Ls
        0x080037fc:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08003800:    4d92        .M      LDR      r5,[pc,#584] ; [0x8003a4c] = 0x20000008
        0x08003802:    4604        .F      MOV      r4,r0
        0x08003804:    ed2d8b04    -...    VPUSH    {d8-d9}
        0x08003808:    edd58a00    ....    VLDR     s17,[r5,#0]
        0x0800380c:    eddf0a90    ....    VLDR     s1,[pc,#576] ; [0x8003a50] = 0x3ffa1cac
        0x08003810:    ed951a01    ....    VLDR     s2,[r5,#4]
        0x08003814:    ee680aa0    h...    VMUL.F32 s1,s17,s1
        0x08003818:    eddf1a8e    ....    VLDR     s3,[pc,#568] ; [0x8003a54] = 0x3f7816f0
        0x0800381c:    ee410a61    A.a.    VMLS.F32 s1,s2,s3
        0x08003820:    ed9f1a8d    ....    VLDR     s2,[pc,#564] ; [0x8003a58] = 0x3cfcb924
        0x08003824:    edd51a02    ....    VLDR     s3,[r5,#8]
        0x08003828:    edc58a01    ....    VSTR     s17,[r5,#4]
        0x0800382c:    ee400a01    @...    VMLA.F32 s1,s0,s2
        0x08003830:    ee410ac1    A...    VMLS.F32 s1,s3,s2
        0x08003834:    edc50a00    ....    VSTR     s1,[r5,#0]
        0x08003838:    ed850a02    ....    VSTR     s0,[r5,#8]
        0x0800383c:    ed900a02    ....    VLDR     s0,[r0,#8]
        0x08003840:    edd00a00    ....    VLDR     s1,[r0,#0]
        0x08003844:    ed9f8a85    ....    VLDR     s16,[pc,#532] ; [0x8003a5c] = 0x40c90fdb
        0x08003848:    4885        .H      LDR      r0,[pc,#532] ; [0x8003a60] = 0x20000060
        0x0800384a:    4f86        .O      LDR      r7,[pc,#536] ; [0x8003a64] = 0x40490fdb
        0x0800384c:    ee600a88    `...    VMUL.F32 s1,s1,s16
        0x08003850:    6800        .h      LDR      r0,[r0,#0]
        0x08003852:    f8df8214    ....    LDR      r8,[pc,#532] ; [0x8003a68] = 0xc0490fdb
        0x08003856:    ed901a06    ....    VLDR     s2,[r0,#0x18]
        0x0800385a:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x0800385e:    ee100a10    ....    VMOV     r0,s0
        0x08003862:    ed840a02    ....    VSTR     s0,[r4,#8]
        0x08003866:    42b8        .B      CMP      r0,r7
        0x08003868:    bfc8        ..      IT       GT
        0x0800386a:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x0800386e:    dc06        ..      BGT      0x800387e ; MCParIdentify_Rs_Ls + 130
        0x08003870:    ee100a10    ....    VMOV     r0,s0
        0x08003874:    4540        @E      CMP      r0,r8
        0x08003876:    bf88        ..      IT       HI
        0x08003878:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x0800387c:    d901        ..      BLS      0x8003882 ; MCParIdentify_Rs_Ls + 134
        0x0800387e:    ed840a02    ....    VSTR     s0,[r4,#8]
        0x08003882:    edd40a04    ....    VLDR     s1,[r4,#0x10]
        0x08003886:    ee300a20    0. .    VADD.F32 s0,s0,s1
        0x0800388a:    ee100a10    ....    VMOV     r0,s0
        0x0800388e:    42b8        .B      CMP      r0,r7
        0x08003890:    bfc8        ..      IT       GT
        0x08003892:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08003896:    dc05        ..      BGT      0x80038a4 ; MCParIdentify_Rs_Ls + 168
        0x08003898:    ee100a10    ....    VMOV     r0,s0
        0x0800389c:    4540        @E      CMP      r0,r8
        0x0800389e:    bf88        ..      IT       HI
        0x080038a0:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x080038a4:    f7fcfed8    ....    BL       CalculateSinCosValue ; 0x8000658
        0x080038a8:    ed941a03    ....    VLDR     s2,[r4,#0xc]
        0x080038ac:    486f        oH      LDR      r0,[pc,#444] ; [0x8003a6c] = 0x20000020
        0x080038ae:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x080038b2:    ee610a20    a. .    VMUL.F32 s1,s2,s1
        0x080038b6:    ed840a05    ....    VSTR     s0,[r4,#0x14]
        0x080038ba:    edc40a06    ....    VSTR     s1,[r4,#0x18]
        0x080038be:    ee200a28     .(.    VMUL.F32 s0,s0,s17
        0x080038c2:    ee600aa8    `...    VMUL.F32 s1,s1,s17
        0x080038c6:    ed840a07    ....    VSTR     s0,[r4,#0x1c]
        0x080038ca:    edc40a08    ....    VSTR     s1,[r4,#0x20]
        0x080038ce:    ed900a00    ....    VLDR     s0,[r0,#0]
        0x080038d2:    eddf2a67    ..g*    VLDR     s5,[pc,#412] ; [0x8003a70] = 0x3ffa5e35
        0x080038d6:    f1000108    ....    ADD      r1,r0,#8
        0x080038da:    ee200a22     .".    VMUL.F32 s0,s0,s5
        0x080038de:    edd10a00    ....    VLDR     s1,[r1,#0]
        0x080038e2:    eddf1a64    ..d.    VLDR     s3,[pc,#400] ; [0x8003a74] = 0x3f74dd2f
        0x080038e6:    f1000210    ....    ADD      r2,r0,#0x10
        0x080038ea:    ee000ae1    ....    VMLS.F32 s0,s1,s3
        0x080038ee:    edd20a00    ....    VLDR     s1,[r2,#0]
        0x080038f2:    ed9f2a61    ..a*    VLDR     s4,[pc,#388] ; [0x8003a78] = 0x39fee8a9
        0x080038f6:    ee000a82    ....    VMLA.F32 s0,s1,s4
        0x080038fa:    edd40a07    ....    VLDR     s1,[r4,#0x1c]
        0x080038fe:    ed9f1a5f    .._.    VLDR     s2,[pc,#380] ; [0x8003a7c] = 0x39fb2fb7
        0x08003902:    f1a00308    ....    SUB      r3,r0,#8
        0x08003906:    f1000618    ....    ADD      r6,r0,#0x18
        0x0800390a:    eeb79a00    ....    VMOV.F32 s18,#1.00000000
        0x0800390e:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08003912:    ed830a00    ....    VSTR     s0,[r3,#0]
        0x08003916:    edc20a00    ....    VSTR     s1,[r2,#0]
        0x0800391a:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x0800391e:    ed810a00    ....    VSTR     s0,[r1,#0]
        0x08003922:    edd00a01    ....    VLDR     s1,[r0,#4]
        0x08003926:    ee600aa2    `...    VMUL.F32 s1,s1,s5
        0x0800392a:    edd12a01    ...*    VLDR     s5,[r1,#4]
        0x0800392e:    ee420ae1    B...    VMLS.F32 s1,s5,s3
        0x08003932:    edd21a01    ....    VLDR     s3,[r2,#4]
        0x08003936:    ee410a82    A...    VMLA.F32 s1,s3,s4
        0x0800393a:    edd41a08    ....    VLDR     s3,[r4,#0x20]
        0x0800393e:    ee410a81    A...    VMLA.F32 s1,s3,s2
        0x08003942:    edc30a01    ....    VSTR     s1,[r3,#4]
        0x08003946:    edc21a01    ....    VSTR     s3,[r2,#4]
        0x0800394a:    edc00a01    ....    VSTR     s1,[r0,#4]
        0x0800394e:    edc10a01    ....    VSTR     s1,[r1,#4]
        0x08003952:    ed840a09    ....    VSTR     s0,[r4,#0x24]
        0x08003956:    edc40a0a    ....    VSTR     s1,[r4,#0x28]
        0x0800395a:    ed961a00    ....    VLDR     s2,[r6,#0]
        0x0800395e:    ee001a00    ....    VMLA.F32 s2,s0,s0
        0x08003962:    ed861a00    ....    VSTR     s2,[r6,#0]
        0x08003966:    ed960a01    ....    VLDR     s0,[r6,#4]
        0x0800396a:    ee000aa0    ....    VMLA.F32 s0,s1,s1
        0x0800396e:    ed860a01    ....    VSTR     s0,[r6,#4]
        0x08003972:    ed950a03    ....    VLDR     s0,[r5,#0xc]
        0x08003976:    ee700a09    p...    VADD.F32 s1,s0,s18
        0x0800397a:    ee810a20    .. .    VDIV.F32 s0,s2,s1
        0x0800397e:    f7fdfeed    ....    BL       FastSquareRoot ; 0x800175c
        0x08003982:    eef08a40    ..@.    VMOV.F32 s17,s0
        0x08003986:    ed950a03    ....    VLDR     s0,[r5,#0xc]
        0x0800398a:    edd60a01    ....    VLDR     s1,[r6,#4]
        0x0800398e:    ee301a09    0...    VADD.F32 s2,s0,s18
        0x08003992:    ee800a81    ....    VDIV.F32 s0,s1,s2
        0x08003996:    f7fdfee1    ....    BL       FastSquareRoot ; 0x800175c
        0x0800399a:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x0800399e:    ed950a03    ....    VLDR     s0,[r5,#0xc]
        0x080039a2:    ee300a09    0...    VADD.F32 s0,s0,s18
        0x080039a6:    ed850a03    ....    VSTR     s0,[r5,#0xc]
        0x080039aa:    ee280aa8    (...    VMUL.F32 s0,s17,s17
        0x080039ae:    edc48a0b    ....    VSTR     s17,[r4,#0x2c]
        0x080039b2:    edc40a0c    ....    VSTR     s1,[r4,#0x30]
        0x080039b6:    ee000aa0    ....    VMLA.F32 s0,s1,s1
        0x080039ba:    f7fdfecf    ....    BL       FastSquareRoot ; 0x800175c
