ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080039be:    eef00a00    ....    VMOV.F32 s1,#2.00000000
        0x080039c2:    ee608a20    `. .    VMUL.F32 s17,s0,s1
        0x080039c6:    edd40a0b    ....    VLDR     s1,[r4,#0x2c]
        0x080039ca:    ed940a0c    ....    VLDR     s0,[r4,#0x30]
        0x080039ce:    f003fa75    ..u.    BL       atan2Rad ; 0x8006ebc
        0x080039d2:    edd40a01    ....    VLDR     s1,[r4,#4]
        0x080039d6:    ed9f1a2a    ..*.    VLDR     s2,[pc,#168] ; [0x8003a80] = 0x3fa2f1aa
        0x080039da:    492b        +I      LDR      r1,[pc,#172] ; [0x8003a88] = 0x41200000
        0x080039dc:    ee600a81    `...    VMUL.F32 s1,s1,s2
        0x080039e0:    ee801aa8    ....    VDIV.F32 s2,s1,s17
        0x080039e4:    eddf0a27    ..'.    VLDR     s1,[pc,#156] ; [0x8003a84] = 0x3fd06823
        0x080039e8:    ee618a20    a. .    VMUL.F32 s17,s2,s1
        0x080039ec:    ee180a90    ....    VMOV     r0,s17
        0x080039f0:    4288        .B      CMP      r0,r1
        0x080039f2:    bfc8        ..      IT       GT
        0x080039f4:    eddf8a25    ..%.    VLDRGT   s17,[pc,#148] ; [0x8003a8c] = 0
        0x080039f8:    eeb10a40    ..@.    VNEG.F32 s0,s0
        0x080039fc:    ee100a10    ....    VMOV     r0,s0
        0x08003a00:    42b8        .B      CMP      r0,r7
        0x08003a02:    bfc8        ..      IT       GT
        0x08003a04:    ee300a48    0.H.    VSUBGT.F32 s0,s0,s16
        0x08003a08:    dc05        ..      BGT      0x8003a16 ; MCParIdentify_Rs_Ls + 538
        0x08003a0a:    ee100a10    ....    VMOV     r0,s0
        0x08003a0e:    4540        @E      CMP      r0,r8
        0x08003a10:    bf88        ..      IT       HI
        0x08003a12:    ee300a08    0...    VADDHI.F32 s0,s0,s16
        0x08003a16:    f7fcfe1f    ....    BL       CalculateSinCosValue ; 0x8000658
        0x08003a1a:    ee600aa8    `...    VMUL.F32 s1,s1,s17
        0x08003a1e:    ee200a28     .(.    VMUL.F32 s0,s0,s17
        0x08003a22:    ed9f1a1b    ....    VLDR     s2,[pc,#108] ; [0x8003a90] = 0x40490fdb
        0x08003a26:    edc40a0f    ....    VSTR     s1,[r4,#0x3c]
        0x08003a2a:    eefe0a00    ....    VMOV.F32 s1,#-0.50000000
        0x08003a2e:    ee600a20    `. .    VMUL.F32 s1,s0,s1
        0x08003a32:    ee800a81    ....    VDIV.F32 s0,s1,s2
        0x08003a36:    edd40a00    ....    VLDR     s1,[r4,#0]
        0x08003a3a:    ee801a20    .. .    VDIV.F32 s2,s0,s1
        0x08003a3e:    ed841a10    ....    VSTR     s2,[r4,#0x40]
        0x08003a42:    ecbd8b04    ....    VPOP     {d8-d9}
        0x08003a46:    e8bd81f0    ....    POP      {r4-r8,pc}
    $d
        0x08003a4a:    0000        ..      DCW    0
        0x08003a4c:    20000008    ...     DCD    536870920
        0x08003a50:    3ffa1cac    ...?    DCD    1073355948
        0x08003a54:    3f7816f0    ..x?    DCD    1064834800
        0x08003a58:    3cfcb924    $..<    DCD    1023195428
        0x08003a5c:    40c90fdb    ...@    DCD    1086918619
        0x08003a60:    20000060    `..     DCD    536871008
        0x08003a64:    40490fdb    ..I@    DCD    1078530011
        0x08003a68:    c0490fdb    ..I.    DCD    3226013659
        0x08003a6c:    20000020     ..     DCD    536870944
        0x08003a70:    3ffa5e35    5^.?    DCD    1073372725
        0x08003a74:    3f74dd2f    /.t?    DCD    1064623407
        0x08003a78:    39fee8a9    ...9    DCD    973007017
        0x08003a7c:    39fb2fb7    ./.9    DCD    972763063
        0x08003a80:    3fa2f1aa    ...?    DCD    1067643306
        0x08003a84:    3fd06823    #h.?    DCD    1070622755
        0x08003a88:    41200000    .. A    DCD    1092616192
        0x08003a8c:    00000000    ....    DCD    0
        0x08003a90:    40490fdb    ..I@    DCD    1078530011
    $t
    i.MX_ADC1_Init
    MX_ADC1_Init
        0x08003a94:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08003a98:    b098        ..      SUB      sp,sp,#0x60
        0x08003a9a:    2400        .$      MOVS     r4,#0
        0x08003a9c:    9416        ..      STR      r4,[sp,#0x58]
        0x08003a9e:    9414        ..      STR      r4,[sp,#0x50]
        0x08003aa0:    9415        ..      STR      r4,[sp,#0x54]
        0x08003aa2:    9407        ..      STR      r4,[sp,#0x1c]
        0x08003aa4:    9408        ..      STR      r4,[sp,#0x20]
        0x08003aa6:    9409        ..      STR      r4,[sp,#0x24]
        0x08003aa8:    9406        ..      STR      r4,[sp,#0x18]
        0x08003aaa:    940a        ..      STR      r4,[sp,#0x28]
        0x08003aac:    9411        ..      STR      r4,[sp,#0x44]
        0x08003aae:    9412        ..      STR      r4,[sp,#0x48]
        0x08003ab0:    9413        ..      STR      r4,[sp,#0x4c]
        0x08003ab2:    4899        .H      LDR      r0,[pc,#612] ; [0x8003d18] = 0x40021000
        0x08003ab4:    940b        ..      STR      r4,[sp,#0x2c]
        0x08003ab6:    940c        ..      STR      r4,[sp,#0x30]
        0x08003ab8:    940d        ..      STR      r4,[sp,#0x34]
        0x08003aba:    940e        ..      STR      r4,[sp,#0x38]
        0x08003abc:    940f        ..      STR      r4,[sp,#0x3c]
        0x08003abe:    9410        ..      STR      r4,[sp,#0x40]
        0x08003ac0:    9402        ..      STR      r4,[sp,#8]
        0x08003ac2:    9403        ..      STR      r4,[sp,#0xc]
        0x08003ac4:    9404        ..      STR      r4,[sp,#0x10]
        0x08003ac6:    9405        ..      STR      r4,[sp,#0x14]
        0x08003ac8:    f8501f88    P...    LDR      r1,[r0,#0x88]!
        0x08003acc:    2603        .&      MOVS     r6,#3
        0x08003ace:    f0215140    !.@Q    BIC      r1,r1,#0x30000000
        0x08003ad2:    f0415100    A..Q    ORR      r1,r1,#0x20000000
        0x08003ad6:    2702        .'      MOVS     r7,#2
        0x08003ad8:    f840193c    @.<.    STR      r1,[r0],#-0x3c
        0x08003adc:    6801        .h      LDR      r1,[r0,#0]
        0x08003ade:    f4415100    A..Q    ORR      r1,r1,#0x2000
        0x08003ae2:    6001        .`      STR      r1,[r0,#0]
        0x08003ae4:    6801        .h      LDR      r1,[r0,#0]
        0x08003ae6:    f4015100    ...Q    AND      r1,r1,#0x2000
        0x08003aea:    9117        ..      STR      r1,[sp,#0x5c]
        0x08003aec:    6801        .h      LDR      r1,[r0,#0]
        0x08003aee:    f0410104    A...    ORR      r1,r1,#4
        0x08003af2:    6001        .`      STR      r1,[r0,#0]
        0x08003af4:    6801        .h      LDR      r1,[r0,#0]
        0x08003af6:    f0010104    ....    AND      r1,r1,#4
        0x08003afa:    9117        ..      STR      r1,[sp,#0x5c]
        0x08003afc:    6801        .h      LDR      r1,[r0,#0]
        0x08003afe:    f0410102    A...    ORR      r1,r1,#2
        0x08003b02:    6001        .`      STR      r1,[r0,#0]
        0x08003b04:    6800        .h      LDR      r0,[r0,#0]
        0x08003b06:    4d85        .M      LDR      r5,[pc,#532] ; [0x8003d1c] = 0x48000800
        0x08003b08:    f0000002    ....    AND      r0,r0,#2
        0x08003b0c:    e9cd7600    ...v    STRD     r7,r6,[sp,#0]
        0x08003b10:    9017        ..      STR      r0,[sp,#0x5c]
        0x08003b12:    4669        iF      MOV      r1,sp
        0x08003b14:    4628        (F      MOV      r0,r5
        0x08003b16:    f7fff991    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003b1a:    2004        .       MOVS     r0,#4
        0x08003b1c:    e9cd0600    ....    STRD     r0,r6,[sp,#0]
        0x08003b20:    4669        iF      MOV      r1,sp
        0x08003b22:    9404        ..      STR      r4,[sp,#0x10]
        0x08003b24:    4628        (F      MOV      r0,r5
        0x08003b26:    f7fff989    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003b2a:    2501        .%      MOVS     r5,#1
        0x08003b2c:    f8df81f0    ....    LDR      r8,[pc,#496] ; [0x8003d20] = 0x48000400
        0x08003b30:    e9cd5600    ...V    STRD     r5,r6,[sp,#0]
        0x08003b34:    4669        iF      MOV      r1,sp
        0x08003b36:    4640        @F      MOV      r0,r8
        0x08003b38:    9404        ..      STR      r4,[sp,#0x10]
        0x08003b3a:    f7fff97f    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003b3e:    e9cd7600    ...v    STRD     r7,r6,[sp,#0]
        0x08003b42:    4669        iF      MOV      r1,sp
        0x08003b44:    4640        @F      MOV      r0,r8
        0x08003b46:    9404        ..      STR      r4,[sp,#0x10]
        0x08003b48:    f7fff978    ..x.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003b4c:    4875        uH      LDR      r0,[pc,#468] ; [0x8003d24] = 0xe000ed0c
        0x08003b4e:    6800        .h      LDR      r0,[r0,#0]
        0x08003b50:    f3c02002    ...     UBFX     r0,r0,#8,#3
        0x08003b54:    f1c00107    ....    RSB      r1,r0,#7
        0x08003b58:    2904        .)      CMP      r1,#4
        0x08003b5a:    bf88        ..      IT       HI
        0x08003b5c:    2104        .!      MOVHI    r1,#4
        0x08003b5e:    1d02        ..      ADDS     r2,r0,#4
        0x08003b60:    2a07        .*      CMP      r2,#7
        0x08003b62:    bf34        4.      ITE      CC
        0x08003b64:    2000        .       MOVCC    r0,#0
        0x08003b66:    1ec0        ..      SUBCS    r0,r0,#3
        0x08003b68:    fa05f101    ....    LSL      r1,r5,r1
        0x08003b6c:    1e49        I.      SUBS     r1,r1,#1
        0x08003b6e:    f0010105    ....    AND      r1,r1,#5
        0x08003b72:    fa01f000    ....    LSL      r0,r1,r0
        0x08003b76:    496c        lI      LDR      r1,[pc,#432] ; [0x8003d28] = 0xe000e012
        0x08003b78:    0100        ..      LSLS     r0,r0,#4
        0x08003b7a:    f8810400    ....    STRB     r0,[r1,#0x400]
        0x08003b7e:    f04f21e0    O..!    MOV      r1,#0xe000e000
        0x08003b82:    f44f2080    O..     MOV      r0,#0x40000
        0x08003b86:    f8c10100    ....    STR      r0,[r1,#0x100]
        0x08003b8a:    10c0        ..      ASRS     r0,r0,#3
        0x08003b8c:    e9cd4014    ...@    STRD     r4,r0,[sp,#0x50]
        0x08003b90:    a914        ..      ADD      r1,sp,#0x50
        0x08003b92:    f04f40a0    O..@    MOV      r0,#0x50000000
        0x08003b96:    9416        ..      STR      r4,[sp,#0x58]
        0x08003b98:    f7feff9b    ....    BL       LL_ADC_Init ; 0x8002ad2
        0x08003b9c:    e9cd4506    ...E    STRD     r4,r5,[sp,#0x18]
        0x08003ba0:    9408        ..      STR      r4,[sp,#0x20]
        0x08003ba2:    9409        ..      STR      r4,[sp,#0x24]
        0x08003ba4:    940a        ..      STR      r4,[sp,#0x28]
        0x08003ba6:    a906        ..      ADD      r1,sp,#0x18
        0x08003ba8:    f04f40a0    O..@    MOV      r0,#0x50000000
        0x08003bac:    940b        ..      STR      r4,[sp,#0x2c]
        0x08003bae:    f7feffa9    ....    BL       LL_ADC_REG_Init ; 0x8002b04
        0x08003bb2:    f04f45a0    O..E    MOV      r5,#0x50000000
        0x08003bb6:    f8d500c0    ....    LDR      r0,[r5,#0xc0]
        0x08003bba:    f36f000d    o...    BFC      r0,#0,#14
        0x08003bbe:    f8c500c0    ....    STR      r0,[r5,#0xc0]
        0x08003bc2:    6928        (i      LDR      r0,[r5,#0x10]
        0x08003bc4:    f4203080     ..0    BIC      r0,r0,#0x10000
        0x08003bc8:    6128        (a      STR      r0,[r5,#0x10]
        0x08003bca:    6928        (i      LDR      r0,[r5,#0x10]
        0x08003bcc:    f0200003     ...    BIC      r0,r0,#3
        0x08003bd0:    f4206080     ..`    BIC      r0,r0,#0x400
        0x08003bd4:    6128        (a      STR      r0,[r5,#0x10]
        0x08003bd6:    f44f3040    O.@0    MOV      r0,#0x30000
        0x08003bda:    e9cd0410    ....    STRD     r0,r4,[sp,#0x40]
        0x08003bde:    4e53        SN      LDR      r6,[pc,#332] ; [0x8003d2c] = 0x50000300
        0x08003be0:    a910        ..      ADD      r1,sp,#0x40
        0x08003be2:    4630        0F      MOV      r0,r6
        0x08003be4:    f7feff22    ..".    BL       LL_ADC_CommonInit ; 0x8002a2c
        0x08003be8:    2080        .       MOVS     r0,#0x80
        0x08003bea:    900c        ..      STR      r0,[sp,#0x30]
        0x08003bec:    e9cd740d    ...t    STRD     r7,r4,[sp,#0x34]
        0x08003bf0:    a90c        ..      ADD      r1,sp,#0x30
        0x08003bf2:    4628        (F      MOV      r0,r5
        0x08003bf4:    940f        ..      STR      r4,[sp,#0x3c]
        0x08003bf6:    f7feff43    ..C.    BL       LL_ADC_INJ_Init ; 0x8002a80
        0x08003bfa:    68e8        .h      LDR      r0,[r5,#0xc]
        0x08003bfc:    f4201000     ...    BIC      r0,r0,#0x200000
        0x08003c00:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x08003c04:    f0404000    @..@    ORR      r0,r0,#0x80000000
        0x08003c08:    60e8        .`      STR      r0,[r5,#0xc]
        0x08003c0a:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08003c0c:    f42070c0     ..p    BIC      r0,r0,#0x180
        0x08003c10:    f0400080    @...    ORR      r0,r0,#0x80
        0x08003c14:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08003c16:    68a8        .h      LDR      r0,[r5,#8]
        0x08003c18:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x08003c1c:    f0204020     . @    BIC      r0,r0,#0xa0000000
        0x08003c20:    60a8        .`      STR      r0,[r5,#8]
        0x08003c22:    68a8        .h      LDR      r0,[r5,#8]
        0x08003c24:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x08003c28:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x08003c2c:    f0405080    @..P    ORR      r0,r0,#0x10000000
        0x08003c30:    60a8        .`      STR      r0,[r5,#8]
        0x08003c32:    483f        ?H      LDR      r0,[pc,#252] ; [0x8003d30] = 0x20000004
        0x08003c34:    493f        ?I      LDR      r1,[pc,#252] ; [0x8003d34] = 0x30d40
        0x08003c36:    6800        .h      LDR      r0,[r0,#0]
        0x08003c38:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08003c3c:    eb000080    ....    ADD      r0,r0,r0,LSL #2
        0x08003c40:    493d        =I      LDR      r1,[pc,#244] ; [0x8003d38] = 0xcccccccd
        0x08003c42:    0080        ..      LSLS     r0,r0,#2
        0x08003c44:    fba11000    ....    UMULL    r1,r0,r1,r0
        0x08003c48:    08c1        ..      LSRS     r1,r0,#3
        0x08003c4a:    d002        ..      BEQ      0x8003c52 ; MX_ADC1_Init + 446
        0x08003c4c:    f1b14f00    ...O    CMP      r1,#0x80000000
        0x08003c50:    d25e        ^.      BCS      0x8003d10 ; MX_ADC1_Init + 636
        0x08003c52:    493a        :I      LDR      r1,[pc,#232] ; [0x8003d3c] = 0x50000030
        0x08003c54:    6808        .h      LDR      r0,[r1,#0]
        0x08003c56:    f42060f8     ..`    BIC      r0,r0,#0x7c0
        0x08003c5a:    f4407040    @.@p    ORR      r0,r0,#0x300
        0x08003c5e:    6008        .`      STR      r0,[r1,#0]
        0x08003c60:    4837        7H      LDR      r0,[pc,#220] ; [0x8003d40] = 0x50000018
        0x08003c62:    6802        .h      LDR      r2,[r0,#0]
        0x08003c64:    f42272e0    "..r    BIC      r2,r2,#0x1c0
        0x08003c68:    f0420240    B.@.    ORR      r2,r2,#0x40
        0x08003c6c:    6002        .`      STR      r2,[r0,#0]
        0x08003c6e:    f8d520b0    ...     LDR      r2,[r5,#0xb0]
        0x08003c72:    f4225280    "..R    BIC      r2,r2,#0x1000
        0x08003c76:    f8c520b0    ...     STR      r2,[r5,#0xb0]
        0x08003c7a:    6cea        .l      LDR      r2,[r5,#0x4c]
        0x08003c7c:    f4225278    ".xR    BIC      r2,r2,#0x3e00
        0x08003c80:    f4426260    B.`b    ORR      r2,r2,#0xe00
        0x08003c84:    64ea        .d      STR      r2,[r5,#0x4c]
        0x08003c86:    1f02        ..      SUBS     r2,r0,#4
        0x08003c88:    6813        .h      LDR      r3,[r2,#0]
        0x08003c8a:    f4230360    #.`.    BIC      r3,r3,#0xe00000
        0x08003c8e:    6013        .`      STR      r3,[r2,#0]
        0x08003c90:    f8d530b0    ...0    LDR      r3,[r5,#0xb0]
        0x08003c94:    f0230380    #...    BIC      r3,r3,#0x80
        0x08003c98:    f8c530b0    ...0    STR      r3,[r5,#0xb0]
        0x08003c9c:    680b        .h      LDR      r3,[r1,#0]
        0x08003c9e:    f42333f8    #..3    BIC      r3,r3,#0x1f000
        0x08003ca2:    f4433390    C..3    ORR      r3,r3,#0x12000
        0x08003ca6:    600b        .`      STR      r3,[r1,#0]
        0x08003ca8:    6801        .h      LDR      r1,[r0,#0]
        0x08003caa:    f02161e0    !..a    BIC      r1,r1,#0x7000000
        0x08003cae:    6001        .`      STR      r1,[r0,#0]
        0x08003cb0:    f8d510b0    ....    LDR      r1,[r5,#0xb0]
        0x08003cb4:    f4212180    !..!    BIC      r1,r1,#0x40000
        0x08003cb8:    f8c510b0    ....    STR      r1,[r5,#0xb0]
        0x08003cbc:    68b1        .h      LDR      r1,[r6,#8]
        0x08003cbe:    4b1b        .K      LDR      r3,[pc,#108] ; [0x8003d2c] = 0x50000300
        0x08003cc0:    f02171e0    !..q    BIC      r1,r1,#0x1c00000
        0x08003cc4:    f4410180    A...    ORR      r1,r1,#0x400000
        0x08003cc8:    6099        .`      STR      r1,[r3,#8]
        0x08003cca:    6ce9        .l      LDR      r1,[r5,#0x4c]
        0x08003ccc:    f4212178    !.x!    BIC      r1,r1,#0xf8000
        0x08003cd0:    f4412180    A..!    ORR      r1,r1,#0x40000
        0x08003cd4:    64e9        .d      STR      r1,[r5,#0x4c]
        0x08003cd6:    6811        .h      LDR      r1,[r2,#0]
        0x08003cd8:    f02161e0    !..a    BIC      r1,r1,#0x7000000
        0x08003cdc:    6011        .`      STR      r1,[r2,#0]
        0x08003cde:    f8d510b0    ....    LDR      r1,[r5,#0xb0]
        0x08003ce2:    f4217180    !..q    BIC      r1,r1,#0x100
        0x08003ce6:    f8c510b0    ....    STR      r1,[r5,#0xb0]
        0x08003cea:    6ce9        .l      LDR      r1,[r5,#0x4c]
        0x08003cec:    f0217178    !.xq    BIC      r1,r1,#0x3e00000
        0x08003cf0:    f04171f0    A..q    ORR      r1,r1,#0x1e00000
        0x08003cf4:    64e9        .d      STR      r1,[r5,#0x4c]
        0x08003cf6:    6801        .h      LDR      r1,[r0,#0]
        0x08003cf8:    f4213160    !.`1    BIC      r1,r1,#0x38000
        0x08003cfc:    6001        .`      STR      r1,[r0,#0]
        0x08003cfe:    f8d500b0    ....    LDR      r0,[r5,#0xb0]
        0x08003d02:    f4204000     ..@    BIC      r0,r0,#0x8000
        0x08003d06:    f8c500b0    ....    STR      r0,[r5,#0xb0]
        0x08003d0a:    b018        ..      ADD      sp,sp,#0x60
        0x08003d0c:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08003d10:    1e49        I.      SUBS     r1,r1,#1
        0x08003d12:    d1fd        ..      BNE      0x8003d10 ; MX_ADC1_Init + 636
        0x08003d14:    e79d        ..      B        0x8003c52 ; MX_ADC1_Init + 446
    $d
        0x08003d16:    0000        ..      DCW    0
        0x08003d18:    40021000    ...@    DCD    1073876992
        0x08003d1c:    48000800    ...H    DCD    1207961600
        0x08003d20:    48000400    ...H    DCD    1207960576
        0x08003d24:    e000ed0c    ....    DCD    3758157068
        0x08003d28:    e000e012    ....    DCD    3758153746
        0x08003d2c:    50000300    ...P    DCD    1342178048
        0x08003d30:    20000004    ...     DCD    536870916
        0x08003d34:    00030d40    @...    DCD    200000
        0x08003d38:    cccccccd    ....    DCD    3435973837
        0x08003d3c:    50000030    0..P    DCD    1342177328
        0x08003d40:    50000018    ...P    DCD    1342177304
    $t
    i.MX_TIM1_Init
    MX_TIM1_Init
        0x08003d44:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08003d48:    b0a1        ..      SUB      sp,sp,#0x84
        0x08003d4a:    2400        .$      MOVS     r4,#0
        0x08003d4c:    941c        ..      STR      r4,[sp,#0x70]
        0x08003d4e:    940a        ..      STR      r4,[sp,#0x28]
        0x08003d50:    9406        ..      STR      r4,[sp,#0x18]
        0x08003d52:    9407        ..      STR      r4,[sp,#0x1c]
        0x08003d54:    9408        ..      STR      r4,[sp,#0x20]
        0x08003d56:    9409        ..      STR      r4,[sp,#0x24]
        0x08003d58:    940f        ..      STR      r4,[sp,#0x3c]
        0x08003d5a:    940b        ..      STR      r4,[sp,#0x2c]
        0x08003d5c:    940c        ..      STR      r4,[sp,#0x30]
        0x08003d5e:    940d        ..      STR      r4,[sp,#0x34]
        0x08003d60:    940e        ..      STR      r4,[sp,#0x38]
        0x08003d62:    9414        ..      STR      r4,[sp,#0x50]
        0x08003d64:    9410        ..      STR      r4,[sp,#0x40]
        0x08003d66:    9411        ..      STR      r4,[sp,#0x44]
        0x08003d68:    9412        ..      STR      r4,[sp,#0x48]
        0x08003d6a:    9413        ..      STR      r4,[sp,#0x4c]
        0x08003d6c:    9419        ..      STR      r4,[sp,#0x64]
        0x08003d6e:    4eaa        .N      LDR      r6,[pc,#680] ; [0x8004018] = 0x40021000
        0x08003d70:    9415        ..      STR      r4,[sp,#0x54]
        0x08003d72:    9416        ..      STR      r4,[sp,#0x58]
        0x08003d74:    9417        ..      STR      r4,[sp,#0x5c]
        0x08003d76:    9418        ..      STR      r4,[sp,#0x60]
        0x08003d78:    9400        ..      STR      r4,[sp,#0]
        0x08003d7a:    9401        ..      STR      r4,[sp,#4]
        0x08003d7c:    9402        ..      STR      r4,[sp,#8]
        0x08003d7e:    9403        ..      STR      r4,[sp,#0xc]
        0x08003d80:    9404        ..      STR      r4,[sp,#0x10]
        0x08003d82:    9405        ..      STR      r4,[sp,#0x14]
        0x08003d84:    6e30        0n      LDR      r0,[r6,#0x60]
        0x08003d86:    f4406000    @..`    ORR      r0,r0,#0x800
        0x08003d8a:    6630        0f      STR      r0,[r6,#0x60]
        0x08003d8c:    6e30        0n      LDR      r0,[r6,#0x60]
        0x08003d8e:    4da3        .M      LDR      r5,[pc,#652] ; [0x800401c] = 0x40012c00
        0x08003d90:    f4006000    ...`    AND      r0,r0,#0x800
        0x08003d94:    901a        ..      STR      r0,[sp,#0x68]
        0x08003d96:    2040        @       MOVS     r0,#0x40
        0x08003d98:    901d        ..      STR      r0,[sp,#0x74]
        0x08003d9a:    f2421033    B.3.    MOV      r0,#0x2133
        0x08003d9e:    901e        ..      STR      r0,[sp,#0x78]
        0x08003da0:    15b0        ..      ASRS     r0,r6,#22
        0x08003da2:    901f        ..      STR      r0,[sp,#0x7c]
        0x08003da4:    2001        .       MOVS     r0,#1
        0x08003da6:    9020         .      STR      r0,[sp,#0x80]
        0x08003da8:    f8ad4070    ..p@    STRH     r4,[sp,#0x70]
        0x08003dac:    a91c        ..      ADD      r1,sp,#0x70
        0x08003dae:    4628        (F      MOV      r0,r5
        0x08003db0:    f7fffa7c    ..|.    BL       LL_TIM_Init ; 0x80032ac
        0x08003db4:    6828        (h      LDR      r0,[r5,#0]
        0x08003db6:    f0200080     ...    BIC      r0,r0,#0x80
        0x08003dba:    6028        (`      STR      r0,[r5,#0]
        0x08003dbc:    68a8        .h      LDR      r0,[r5,#8]
        0x08003dbe:    f0200007     ...    BIC      r0,r0,#7
        0x08003dc2:    f42030a0     ..0    BIC      r0,r0,#0x14000
        0x08003dc6:    60a8        .`      STR      r0,[r5,#8]
        0x08003dc8:    f8dfb254    ..T.    LDR      r11,[pc,#596] ; [0x8004020] = 0x80089dc
        0x08003dcc:    4895        .H      LDR      r0,[pc,#596] ; [0x8004024] = 0x40012c18
        0x08003dce:    f89b1000    ....    LDRB     r1,[r11,#0]
        0x08003dd2:    180f        ..      ADDS     r7,r1,r0
        0x08003dd4:    6838        8h      LDR      r0,[r7,#0]
        0x08003dd6:    f10b090a    ....    ADD      r9,r11,#0xa
        0x08003dda:    f04f0a08    O...    MOV      r10,#8
        0x08003dde:    f8991000    ....    LDRB     r1,[r9,#0]
        0x08003de2:    fa0af101    ....    LSL      r1,r10,r1
