ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08003de6:    4308        .C      ORRS     r0,r0,r1
        0x08003de8:    6038        8`      STR      r0,[r7,#0]
        0x08003dea:    2070        p       MOVS     r0,#0x70
        0x08003dec:    e9cd0406    ....    STRD     r0,r4,[sp,#0x18]
        0x08003df0:    9408        ..      STR      r4,[sp,#0x20]
        0x08003df2:    9409        ..      STR      r4,[sp,#0x24]
        0x08003df4:    940a        ..      STR      r4,[sp,#0x28]
        0x08003df6:    940b        ..      STR      r4,[sp,#0x2c]
        0x08003df8:    940c        ..      STR      r4,[sp,#0x30]
        0x08003dfa:    aa06        ..      ADD      r2,sp,#0x18
        0x08003dfc:    2101        .!      MOVS     r1,#1
        0x08003dfe:    4628        (F      MOV      r0,r5
        0x08003e00:    940d        ..      STR      r4,[sp,#0x34]
        0x08003e02:    f7fffaab    ....    BL       LL_TIM_OC_Init ; 0x800335c
        0x08003e06:    6838        8h      LDR      r0,[r7,#0]
        0x08003e08:    f8991000    ....    LDRB     r1,[r9,#0]
        0x08003e0c:    f04f0804    O...    MOV      r8,#4
        0x08003e10:    fa08f101    ....    LSL      r1,r8,r1
        0x08003e14:    4388        .C      BICS     r0,r0,r1
        0x08003e16:    6038        8`      STR      r0,[r7,#0]
        0x08003e18:    f89b1002    ....    LDRB     r1,[r11,#2]
        0x08003e1c:    4881        .H      LDR      r0,[pc,#516] ; [0x8004024] = 0x40012c18
        0x08003e1e:    180f        ..      ADDS     r7,r1,r0
        0x08003e20:    6838        8h      LDR      r0,[r7,#0]
        0x08003e22:    f8991002    ....    LDRB     r1,[r9,#2]
        0x08003e26:    fa0af101    ....    LSL      r1,r10,r1
        0x08003e2a:    4308        .C      ORRS     r0,r0,r1
        0x08003e2c:    6038        8`      STR      r0,[r7,#0]
        0x08003e2e:    aa06        ..      ADD      r2,sp,#0x18
        0x08003e30:    2110        .!      MOVS     r1,#0x10
        0x08003e32:    4628        (F      MOV      r0,r5
        0x08003e34:    f7fffa92    ....    BL       LL_TIM_OC_Init ; 0x800335c
        0x08003e38:    6838        8h      LDR      r0,[r7,#0]
        0x08003e3a:    f8991002    ....    LDRB     r1,[r9,#2]
        0x08003e3e:    fa08f101    ....    LSL      r1,r8,r1
        0x08003e42:    4388        .C      BICS     r0,r0,r1
        0x08003e44:    6038        8`      STR      r0,[r7,#0]
        0x08003e46:    f89b1004    ....    LDRB     r1,[r11,#4]
        0x08003e4a:    4876        vH      LDR      r0,[pc,#472] ; [0x8004024] = 0x40012c18
        0x08003e4c:    180f        ..      ADDS     r7,r1,r0
        0x08003e4e:    6838        8h      LDR      r0,[r7,#0]
        0x08003e50:    f8991004    ....    LDRB     r1,[r9,#4]
        0x08003e54:    fa0af101    ....    LSL      r1,r10,r1
        0x08003e58:    4308        .C      ORRS     r0,r0,r1
        0x08003e5a:    6038        8`      STR      r0,[r7,#0]
        0x08003e5c:    aa06        ..      ADD      r2,sp,#0x18
        0x08003e5e:    15a9        ..      ASRS     r1,r5,#22
        0x08003e60:    4628        (F      MOV      r0,r5
        0x08003e62:    f7fffa7b    ..{.    BL       LL_TIM_OC_Init ; 0x800335c
        0x08003e66:    6838        8h      LDR      r0,[r7,#0]
        0x08003e68:    f8991004    ....    LDRB     r1,[r9,#4]
        0x08003e6c:    fa08f101    ....    LSL      r1,r8,r1
        0x08003e70:    4388        .C      BICS     r0,r0,r1
        0x08003e72:    6038        8`      STR      r0,[r7,#0]
        0x08003e74:    6868        hh      LDR      r0,[r5,#4]
        0x08003e76:    f0200070     .p.    BIC      r0,r0,#0x70
        0x08003e7a:    f0207000     ..p    BIC      r0,r0,#0x2000000
        0x08003e7e:    f0400020    @. .    ORR      r0,r0,#0x20
        0x08003e82:    6068        h`      STR      r0,[r5,#4]
        0x08003e84:    6868        hh      LDR      r0,[r5,#4]
        0x08003e86:    f4200070     .p.    BIC      r0,r0,#0xf00000
        0x08003e8a:    6068        h`      STR      r0,[r5,#4]
        0x08003e8c:    68a8        .h      LDR      r0,[r5,#8]
        0x08003e8e:    f0200080     ...    BIC      r0,r0,#0x80
        0x08003e92:    60a8        .`      STR      r0,[r5,#8]
        0x08003e94:    4964        dI      LDR      r1,[pc,#400] ; [0x8004028] = 0x40012c60
        0x08003e96:    6808        .h      LDR      r0,[r1,#0]
        0x08003e98:    fa98f2a8    ....    RBIT     r2,r8
        0x08003e9c:    fab2f282    ....    CLZ      r2,r2
        0x08003ea0:    f002021f    ....    AND      r2,r2,#0x1f
        0x08003ea4:    154f        O.      ASRS     r7,r1,#21
        0x08003ea6:    fa07f202    ....    LSL      r2,r7,r2
        0x08003eaa:    4390        .C      BICS     r0,r0,r2
        0x08003eac:    fa98f2a8    ....    RBIT     r2,r8
        0x08003eb0:    fab2f282    ....    CLZ      r2,r2
        0x08003eb4:    f002021f    ....    AND      r2,r2,#0x1f
        0x08003eb8:    fa04f202    ....    LSL      r2,r4,r2
        0x08003ebc:    4310        .C      ORRS     r0,r0,r2
        0x08003ebe:    6008        .`      STR      r0,[r1,#0]
        0x08003ec0:    6808        .h      LDR      r0,[r1,#0]
        0x08003ec2:    f0400004    @...    ORR      r0,r0,#4
        0x08003ec6:    6008        .`      STR      r0,[r1,#0]
        0x08003ec8:    6808        .h      LDR      r0,[r1,#0]
        0x08003eca:    fa9af2aa    ....    RBIT     r2,r10
        0x08003ece:    fab2f282    ....    CLZ      r2,r2
        0x08003ed2:    f002021f    ....    AND      r2,r2,#0x1f
        0x08003ed6:    fa07f202    ....    LSL      r2,r7,r2
        0x08003eda:    4390        .C      BICS     r0,r0,r2
        0x08003edc:    fa9af2aa    ....    RBIT     r2,r10
        0x08003ee0:    fab2f282    ....    CLZ      r2,r2
        0x08003ee4:    f002021f    ....    AND      r2,r2,#0x1f
        0x08003ee8:    fa04f202    ....    LSL      r2,r4,r2
        0x08003eec:    4310        .C      ORRS     r0,r0,r2
        0x08003eee:    6008        .`      STR      r0,[r1,#0]
        0x08003ef0:    6808        .h      LDR      r0,[r1,#0]
        0x08003ef2:    f0400008    @...    ORR      r0,r0,#8
        0x08003ef6:    6008        .`      STR      r0,[r1,#0]
        0x08003ef8:    680a        .h      LDR      r2,[r1,#0]
        0x08003efa:    2010        .       MOVS     r0,#0x10
        0x08003efc:    fa90f3a0    ....    RBIT     r3,r0
        0x08003f00:    fab3f383    ....    CLZ      r3,r3
        0x08003f04:    fa90f0a0    ....    RBIT     r0,r0
        0x08003f08:    f003031f    ....    AND      r3,r3,#0x1f
        0x08003f0c:    fab0f080    ....    CLZ      r0,r0
        0x08003f10:    fa07f303    ....    LSL      r3,r7,r3
        0x08003f14:    f000001f    ....    AND      r0,r0,#0x1f
        0x08003f18:    439a        .C      BICS     r2,r2,r3
        0x08003f1a:    fa04f000    ....    LSL      r0,r4,r0
        0x08003f1e:    4310        .C      ORRS     r0,r0,r2
        0x08003f20:    6008        .`      STR      r0,[r1,#0]
        0x08003f22:    6808        .h      LDR      r0,[r1,#0]
        0x08003f24:    f0400010    @...    ORR      r0,r0,#0x10
        0x08003f28:    6008        .`      STR      r0,[r1,#0]
        0x08003f2a:    20ff        .       MOVS     r0,#0xff
        0x08003f2c:    f88d0044    ..D.    STRB     r0,[sp,#0x44]
        0x08003f30:    1488        ..      ASRS     r0,r1,#18
        0x08003f32:    f8ad0046    ..F.    STRH     r0,[sp,#0x46]
        0x08003f36:    f44f5900    O..Y    MOV      r9,#0x2000
        0x08003f3a:    940e        ..      STR      r4,[sp,#0x38]
        0x08003f3c:    940f        ..      STR      r4,[sp,#0x3c]
        0x08003f3e:    9410        ..      STR      r4,[sp,#0x40]
        0x08003f40:    0180        ..      LSLS     r0,r0,#6
        0x08003f42:    f8cd9048    ..H.    STR      r9,[sp,#0x48]
        0x08003f46:    e9cd0413    ....    STRD     r0,r4,[sp,#0x4c]
        0x08003f4a:    0180        ..      LSLS     r0,r0,#6
        0x08003f4c:    9015        ..      STR      r0,[sp,#0x54]
        0x08003f4e:    0040        @.      LSLS     r0,r0,#1
        0x08003f50:    e9cd0416    ....    STRD     r0,r4,[sp,#0x58]
        0x08003f54:    9418        ..      STR      r4,[sp,#0x60]
        0x08003f56:    a90e        ..      ADD      r1,sp,#0x38
        0x08003f58:    4628        (F      MOV      r0,r5
        0x08003f5a:    9419        ..      STR      r4,[sp,#0x64]
        0x08003f5c:    f7fff96a    ..j.    BL       LL_TIM_BDTR_Init ; 0x8003234
        0x08003f60:    6cf0        .l      LDR      r0,[r6,#0x4c]
        0x08003f62:    f0400002    @...    ORR      r0,r0,#2
        0x08003f66:    64f0        .d      STR      r0,[r6,#0x4c]
        0x08003f68:    6cf0        .l      LDR      r0,[r6,#0x4c]
        0x08003f6a:    f0000002    ....    AND      r0,r0,#2
        0x08003f6e:    901a        ..      STR      r0,[sp,#0x68]
        0x08003f70:    6cf0        .l      LDR      r0,[r6,#0x4c]
        0x08003f72:    f0400001    @...    ORR      r0,r0,#1
        0x08003f76:    64f0        .d      STR      r0,[r6,#0x4c]
        0x08003f78:    6cf0        .l      LDR      r0,[r6,#0x4c]
        0x08003f7a:    f8cd9000    ....    STR      r9,[sp,#0]
        0x08003f7e:    f0000001    ....    AND      r0,r0,#1
        0x08003f82:    901a        ..      STR      r0,[sp,#0x68]
        0x08003f84:    2502        .%      MOVS     r5,#2
        0x08003f86:    e9cd5401    ...T    STRD     r5,r4,[sp,#4]
        0x08003f8a:    2606        .&      MOVS     r6,#6
        0x08003f8c:    f8df909c    ....    LDR      r9,[pc,#156] ; [0x800402c] = 0x48000400
        0x08003f90:    e9cd4604    ...F    STRD     r4,r6,[sp,#0x10]
        0x08003f94:    4669        iF      MOV      r1,sp
        0x08003f96:    4648        HF      MOV      r0,r9
        0x08003f98:    9403        ..      STR      r4,[sp,#0xc]
        0x08003f9a:    f7feff4f    ..O.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003f9e:    0368        h.      LSLS     r0,r5,#13
        0x08003fa0:    9000        ..      STR      r0,[sp,#0]
        0x08003fa2:    e9cd5401    ...T    STRD     r5,r4,[sp,#4]
        0x08003fa6:    e9cd4604    ...F    STRD     r4,r6,[sp,#0x10]
        0x08003faa:    4669        iF      MOV      r1,sp
        0x08003fac:    4648        HF      MOV      r0,r9
        0x08003fae:    9403        ..      STR      r4,[sp,#0xc]
        0x08003fb0:    f7feff44    ..D.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003fb4:    03a8        ..      LSLS     r0,r5,#14
        0x08003fb6:    9000        ..      STR      r0,[sp,#0]
        0x08003fb8:    e9cd5401    ...T    STRD     r5,r4,[sp,#4]
        0x08003fbc:    e9cd4804    ...H    STRD     r4,r8,[sp,#0x10]
        0x08003fc0:    4669        iF      MOV      r1,sp
        0x08003fc2:    4648        HF      MOV      r0,r9
        0x08003fc4:    9403        ..      STR      r4,[sp,#0xc]
        0x08003fc6:    f7feff39    ..9.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003fca:    01e8        ..      LSLS     r0,r5,#7
        0x08003fcc:    9000        ..      STR      r0,[sp,#0]
        0x08003fce:    e9cd5401    ...T    STRD     r5,r4,[sp,#4]
        0x08003fd2:    e9cd4604    ...F    STRD     r4,r6,[sp,#0x10]
        0x08003fd6:    4669        iF      MOV      r1,sp
        0x08003fd8:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08003fdc:    9403        ..      STR      r4,[sp,#0xc]
        0x08003fde:    f7feff2d    ..-.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003fe2:    9700        ..      STR      r7,[sp,#0]
        0x08003fe4:    e9cd5401    ...T    STRD     r5,r4,[sp,#4]
        0x08003fe8:    e9cd4604    ...F    STRD     r4,r6,[sp,#0x10]
        0x08003fec:    4669        iF      MOV      r1,sp
        0x08003fee:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08003ff2:    9403        ..      STR      r4,[sp,#0xc]
        0x08003ff4:    f7feff22    ..".    BL       LL_GPIO_Init ; 0x8002e3c
        0x08003ff8:    0268        h.      LSLS     r0,r5,#9
        0x08003ffa:    9000        ..      STR      r0,[sp,#0]
        0x08003ffc:    e9cd5401    ...T    STRD     r5,r4,[sp,#4]
        0x08004000:    e9cd4604    ...F    STRD     r4,r6,[sp,#0x10]
        0x08004004:    4669        iF      MOV      r1,sp
        0x08004006:    f04f4090    O..@    MOV      r0,#0x48000000
        0x0800400a:    9403        ..      STR      r4,[sp,#0xc]
        0x0800400c:    f7feff16    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08004010:    b021        !.      ADD      sp,sp,#0x84
        0x08004012:    e8bd8ff0    ....    POP      {r4-r11,pc}
    $d
        0x08004016:    0000        ..      DCW    0
        0x08004018:    40021000    ...@    DCD    1073876992
        0x0800401c:    40012c00    .,.@    DCD    1073818624
        0x08004020:    080089dc    ....    DCD    134253020
        0x08004024:    40012c18    .,.@    DCD    1073818648
        0x08004028:    40012c60    `,.@    DCD    1073818720
        0x0800402c:    48000400    ...H    DCD    1207960576
    $t
    i.MX_USB_Device_Init
    MX_USB_Device_Init
        0x08004030:    b510        ..      PUSH     {r4,lr}
        0x08004032:    2200        ."      MOVS     r2,#0
        0x08004034:    4910        .I      LDR      r1,[pc,#64] ; [0x8004078] = 0x200000ec
        0x08004036:    4811        .H      LDR      r0,[pc,#68] ; [0x800407c] = 0x200012a8
        0x08004038:    f001fbdc    ....    BL       USBD_Init ; 0x80057f4
        0x0800403c:    2800        .(      CMP      r0,#0
        0x0800403e:    bf18        ..      IT       NE
        0x08004040:    f7fcfb44    ..D.    BLNE     Error_Handler ; 0x80006cc
        0x08004044:    490e        .I      LDR      r1,[pc,#56] ; [0x8004080] = 0x20000230
        0x08004046:    480d        .H      LDR      r0,[pc,#52] ; [0x800407c] = 0x200012a8
        0x08004048:    f001fe0b    ....    BL       USBD_RegisterClass ; 0x8005c62
        0x0800404c:    2800        .(      CMP      r0,#0
        0x0800404e:    bf18        ..      IT       NE
        0x08004050:    f7fcfb3c    ..<.    BLNE     Error_Handler ; 0x80006cc
        0x08004054:    490b        .I      LDR      r1,[pc,#44] ; [0x8004084] = 0x20000140
        0x08004056:    4809        .H      LDR      r0,[pc,#36] ; [0x800407c] = 0x200012a8
        0x08004058:    f001fa60    ..`.    BL       USBD_CDC_RegisterInterface ; 0x800551c
        0x0800405c:    2800        .(      CMP      r0,#0
        0x0800405e:    bf18        ..      IT       NE
        0x08004060:    f7fcfb34    ..4.    BLNE     Error_Handler ; 0x80006cc
        0x08004064:    4805        .H      LDR      r0,[pc,#20] ; [0x800407c] = 0x200012a8
        0x08004066:    f001fe19    ....    BL       USBD_Start ; 0x8005c9c
        0x0800406a:    2800        .(      CMP      r0,#0
        0x0800406c:    bf08        ..      IT       EQ
        0x0800406e:    bd10        ..      POPEQ    {r4,pc}
        0x08004070:    e8bd4010    ...@    POP      {r4,lr}
        0x08004074:    f7fcbb2a    ..*.    B        Error_Handler ; 0x80006cc
    $d
        0x08004078:    200000ec    ...     DCD    536871148
        0x0800407c:    200012a8    ...     DCD    536875688
        0x08004080:    20000230    0..     DCD    536871472
        0x08004084:    20000140    @..     DCD    536871232
    $t
    i.MedianFilter
    MedianFilter
        0x08004088:    b410        ..      PUSH     {r4}
        0x0800408a:    ed9f0a17    ....    VLDR     s0,[pc,#92] ; [0x80040e8] = 0
        0x0800408e:    2903        .)      CMP      r1,#3
        0x08004090:    bf3c        <.      ITT      CC
        0x08004092:    bc10        ..      POPCC    {r4}
        0x08004094:    4770        pG      BXCC     lr
        0x08004096:    f04f0c00    O...    MOV      r12,#0
        0x0800409a:    1e4c        L.      SUBS     r4,r1,#1
        0x0800409c:    2c00        .,      CMP      r4,#0
        0x0800409e:    dd1b        ..      BLE      0x80040d8 ; MedianFilter + 80
        0x080040a0:    eba1030c    ....    SUB      r3,r1,r12
        0x080040a4:    1e5a        Z.      SUBS     r2,r3,#1
        0x080040a6:    2a00        .*      CMP      r2,#0
        0x080040a8:    bfc4        ..      ITT      GT
        0x080040aa:    4602        .F      MOVGT    r2,r0
        0x080040ac:    1e5b        [.      SUBGT    r3,r3,#1
        0x080040ae:    dd0f        ..      BLE      0x80040d0 ; MedianFilter + 72
        0x080040b0:    ed920a00    ....    VLDR     s0,[r2,#0]
        0x080040b4:    edd20a01    ....    VLDR     s1,[r2,#4]
        0x080040b8:    eeb40ae0    ....    VCMPE.F32 s0,s1
        0x080040bc:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x080040c0:    bfc4        ..      ITT      GT
        0x080040c2:    edc20a00    ....    VSTRGT   s1,[r2,#0]
        0x080040c6:    ed820a01    ....    VSTRGT   s0,[r2,#4]
        0x080040ca:    1d12        ..      ADDS     r2,r2,#4
        0x080040cc:    1e5b        [.      SUBS     r3,r3,#1
        0x080040ce:    d1ef        ..      BNE      0x80040b0 ; MedianFilter + 40
        0x080040d0:    f10c0c01    ....    ADD      r12,r12,#1
        0x080040d4:    4564        dE      CMP      r4,r12
        0x080040d6:    dce3        ..      BGT      0x80040a0 ; MedianFilter + 24
        0x080040d8:    0849        I.      LSRS     r1,r1,#1
        0x080040da:    eb000081    ....    ADD      r0,r0,r1,LSL #2
        0x080040de:    ed900a00    ....    VLDR     s0,[r0,#0]
        0x080040e2:    bc10        ..      POP      {r4}
        0x080040e4:    4770        pG      BX       lr
    $d
        0x080040e6:    0000        ..      DCW    0
        0x080040e8:    00000000    ....    DCD    0
    $t
    i.MemManage_Handler
    MemManage_Handler
        0x080040ec:    e7fe        ..      B        MemManage_Handler ; 0x80040ec
    i.NMI_Handler
    NMI_Handler
        0x080040ee:    e7fe        ..      B        NMI_Handler ; 0x80040ee
    i.NonlinearFluxObsProcess
    NonlinearFluxObsProcess
        0x080040f0:    b510        ..      PUSH     {r4,lr}
        0x080040f2:    4847        GH      LDR      r0,[pc,#284] ; [0x8004210] = 0x20000090
        0x080040f4:    460c        .F      MOV      r4,r1
        0x080040f6:    ed2d8b0c    -...    VPUSH    {d8-d13}
        0x080040fa:    990e        ..      LDR      r1,[sp,#0x38]
        0x080040fc:    6800        .h      LDR      r0,[r0,#0]
        0x080040fe:    ed941a03    ....    VLDR     s2,[r4,#0xc]
        0x08004102:    ed919a00    ....    VLDR     s18,[r1,#0]
        0x08004106:    ed900a04    ....    VLDR     s0,[r0,#0x10]
        0x0800410a:    edd01a06    ....    VLDR     s3,[r0,#0x18]
        0x0800410e:    edd18a01    ....    VLDR     s17,[r1,#4]
        0x08004112:    ee690a00    i...    VMUL.F32 s1,s18,s0
        0x08004116:    ed908a03    ....    VLDR     s16,[r0,#0xc]
        0x0800411a:    ee280a80    (...    VMUL.F32 s0,s17,s0
        0x0800411e:    483d        =H      LDR      r0,[pc,#244] ; [0x8004214] = 0x20000060
        0x08004120:    ee710a60    q.`.    VSUB.F32 s1,s2,s1
        0x08004124:    ed941a04    ....    VLDR     s2,[r4,#0x10]
        0x08004128:    ed942a00    ...*    VLDR     s4,[r4,#0]
        0x0800412c:    6800        .h      LDR      r0,[r0,#0]
        0x0800412e:    ee310a40    1.@.    VSUB.F32 s0,s2,s0
        0x08004132:    ee80caa1    ....    VDIV.F32 s24,s1,s3
        0x08004136:    ee201aa0     ...    VMUL.F32 s2,s1,s1
        0x0800413a:    ee602a82    `..*    VMUL.F32 s5,s1,s4
        0x0800413e:    edd09a06    ....    VLDR     s19,[r0,#0x18]
        0x08004142:    ed93ba00    ....    VLDR     s22,[r3,#0]
        0x08004146:    ee001a00    ....    VMLA.F32 s2,s0,s0
        0x0800414a:    edd3aa01    ....    VLDR     s21,[r3,#4]
        0x0800414e:    ee202a02     ..*    VMUL.F32 s4,s0,s4
        0x08004152:    ee111aa1    ....    VNMLS.F32 s2,s3,s3
        0x08004156:    eec0ca21    ..!.    VDIV.F32 s25,s0,s3
        0x0800415a:    ed84ca06    ....    VSTR     s24,[r4,#0x18]
        0x0800415e:    ee22aa81    "...    VMUL.F32 s20,s5,s2
        0x08004162:    ee62ba01    b...    VMUL.F32 s23,s4,s2
        0x08004166:    edc4ca05    ....    VSTR     s25,[r4,#0x14]
        0x0800416a:    ed90da06    ....    VLDR     s26,[r0,#0x18]
        0x0800416e:    ed940a0d    ....    VLDR     s0,[r4,#0x34]
        0x08004172:    f7fcfa71    ..q.    BL       CalculateSinCosValue ; 0x8000658
        0x08004176:    ee600aac    `...    VMUL.F32 s1,s1,s25
        0x0800417a:    4927        'I      LDR      r1,[pc,#156] ; [0x8004218] = 0x40490fdb
        0x0800417c:    ee4c0a40    L.@.    VMLS.F32 s1,s24,s0
        0x08004180:    edc40a07    ....    VSTR     s1,[r4,#0x1c]
        0x08004184:    ed940a0c    ....    VLDR     s0,[r4,#0x30]
        0x08004188:    ee000a8d    ....    VMLA.F32 s0,s1,s26
        0x0800418c:    ed840a0c    ....    VSTR     s0,[r4,#0x30]
        0x08004190:    ed941a09    ....    VLDR     s2,[r4,#0x24]
        0x08004194:    ee201a01     ...    VMUL.F32 s2,s0,s2
        0x08004198:    ed940a08    ....    VLDR     s0,[r4,#0x20]
        0x0800419c:    ee001a20    .. .    VMLA.F32 s2,s0,s1
        0x080041a0:    ed841a0a    ....    VSTR     s2,[r4,#0x28]
        0x080041a4:    ed940a0d    ....    VLDR     s0,[r4,#0x34]
        0x080041a8:    ee010a0d    ....    VMLA.F32 s0,s2,s26
        0x080041ac:    ee100a10    ....    VMOV     r0,s0
        0x080041b0:    ed840a0d    ....    VSTR     s0,[r4,#0x34]
        0x080041b4:    4288        .B      CMP      r0,r1
        0x080041b6:    dd06        ..      BLE      0x80041c6 ; NonlinearFluxObsProcess + 214
        0x080041b8:    eddf0a18    ....    VLDR     s1,[pc,#96] ; [0x800421c] = 0xc0c90fdb
        0x080041bc:    ee300a20    0. .    VADD.F32 s0,s0,s1
        0x080041c0:    ed840a0d    ....    VSTR     s0,[r4,#0x34]
        0x080041c4:    e00a        ..      B        0x80041dc ; NonlinearFluxObsProcess + 236
        0x080041c6:    ee100a10    ....    VMOV     r0,s0
        0x080041ca:    4915        .I      LDR      r1,[pc,#84] ; [0x8004220] = 0xc0490fdb
        0x080041cc:    4288        .B      CMP      r0,r1
        0x080041ce:    d905        ..      BLS      0x80041dc ; NonlinearFluxObsProcess + 236
        0x080041d0:    eddf0a14    ....    VLDR     s1,[pc,#80] ; [0x8004224] = 0x40c90fdb
        0x080041d4:    ee300a20    0. .    VADD.F32 s0,s0,s1
        0x080041d8:    ed840a0d    ....    VSTR     s0,[r4,#0x34]
        0x080041dc:    ee09aa48    ..H.    VMLS.F32 s20,s18,s16
        0x080041e0:    ed840a0b    ....    VSTR     s0,[r4,#0x2c]
        0x080041e4:    ed940a03    ....    VLDR     s0,[r4,#0xc]
        0x080041e8:    ee48bac8    H...    VMLS.F32 s23,s17,s16
        0x080041ec:    ee7a0a0b    z...    VADD.F32 s1,s20,s22
        0x080041f0:    ee000aa9    ....    VMLA.F32 s0,s1,s19
        0x080041f4:    ee7b0aaa    {...    VADD.F32 s1,s23,s21
        0x080041f8:    ed840a03    ....    VSTR     s0,[r4,#0xc]
        0x080041fc:    ed940a04    ....    VLDR     s0,[r4,#0x10]
        0x08004200:    ee000aa9    ....    VMLA.F32 s0,s1,s19
        0x08004204:    ed840a04    ....    VSTR     s0,[r4,#0x10]
        0x08004208:    ecbd8b0c    ....    VPOP     {d8-d13}
        0x0800420c:    bd10        ..      POP      {r4,pc}
    $d
        0x0800420e:    0000        ..      DCW    0
        0x08004210:    20000090    ...     DCD    536871056
        0x08004214:    20000060    `..     DCD    536871008
        0x08004218:    40490fdb    ..I@    DCD    1078530011
        0x0800421c:    c0c90fdb    ....    DCD    3234402267
        0x08004220:    c0490fdb    ..I.    DCD    3226013659
        0x08004224:    40c90fdb    ...@    DCD    1086918619
    $t
    i.PCD_EP_ISR_Handler
    PCD_EP_ISR_Handler
        0x08004228:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x0800422c:    4605        .F      MOV      r5,r0
        0x0800422e:    6800        .h      LDR      r0,[r0,#0]
        0x08004230:    f8b00044    ..D.    LDRH     r0,[r0,#0x44]
