ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08004234:    f4104f00    ...O    TST      r0,#0x8000
        0x08004238:    f0008424    ..$.    BEQ.W    0x8004a84 ; PCD_EP_ISR_Handler + 2140
        0x0800423c:    f2404902    @..I    MOV      r9,#0x402
        0x08004240:    f2404806    @..H    MOV      r8,#0x406
        0x08004244:    2700        .'      MOVS     r7,#0
        0x08004246:    6828        (h      LDR      r0,[r5,#0]
        0x08004248:    f8b01044    ..D.    LDRH     r1,[r0,#0x44]
        0x0800424c:    f0110a0f    ....    ANDS     r10,r1,#0xf
        0x08004250:    d046        F.      BEQ      0x80042e0 ; PCD_EP_ISR_Handler + 184
        0x08004252:    f830602a    0.*`    LDRH     r6,[r0,r10,LSL #2]
        0x08004256:    f4164f00    ...O    TST      r6,#0x8000
        0x0800425a:    f00081b0    ....    BEQ.W    0x80045be ; PCD_EP_ISR_Handler + 918
        0x0800425e:    f830102a    0.*.    LDRH     r1,[r0,r10,LSL #2]
        0x08004262:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x08004266:    f4214170    !.pA    BIC      r1,r1,#0xf000
        0x0800426a:    f0410180    A...    ORR      r1,r1,#0x80
        0x0800426e:    f820102a     .*.    STRH     r1,[r0,r10,LSL #2]
        0x08004272:    eb0a008a    ....    ADD      r0,r10,r10,LSL #2
        0x08004276:    eb0500c0    ....    ADD      r0,r5,r0,LSL #3
        0x0800427a:    f50074a8    ...t    ADD      r4,r0,#0x150
        0x0800427e:    f890015c    ..\.    LDRB     r0,[r0,#0x15c]
        0x08004282:    2800        .(      CMP      r0,#0
        0x08004284:    f00080f1    ....    BEQ.W    0x800446a ; PCD_EP_ISR_Handler + 578
        0x08004288:    78e0        .x      LDRB     r0,[r4,#3]
        0x0800428a:    2802        .(      CMP      r0,#2
        0x0800428c:    f0008100    ....    BEQ.W    0x8004490 ; PCD_EP_ISR_Handler + 616
        0x08004290:    7821        !x      LDRB     r1,[r4,#0]
        0x08004292:    6828        (h      LDR      r0,[r5,#0]
        0x08004294:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x08004298:    f24803c0    H...    MOV      r3,#0x80c0
        0x0800429c:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x080042a0:    f42242e0    "..B    BIC      r2,r2,#0x7000
        0x080042a4:    431a        .C      ORRS     r2,r2,r3
        0x080042a6:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x080042aa:    7821        !x      LDRB     r1,[r4,#0]
        0x080042ac:    6828        (h      LDR      r0,[r5,#0]
        0x080042ae:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x080042b2:    f4124f80    ...O    TST      r2,#0x4000
        0x080042b6:    f8b02050    ..P     LDRH     r2,[r0,#0x50]
        0x080042ba:    4402        .D      ADD      r2,r2,r0
        0x080042bc:    f000815e    ..^.    BEQ.W    0x800457c ; PCD_EP_ISR_Handler + 852
        0x080042c0:    eb0901c1    ....    ADD      r1,r9,r1,LSL #3
        0x080042c4:    5a51        QZ      LDRH     r1,[r2,r1]
        0x080042c6:    f3c10b09    ....    UBFX     r11,r1,#0,#10
        0x080042ca:    f1bb0f00    ....    CMP      r11,#0
        0x080042ce:    f0008162    ..b.    BEQ.W    0x8004596 ; PCD_EP_ISR_Handler + 878
        0x080042d2:    8922        ".      LDRH     r2,[r4,#8]
        0x080042d4:    465b        [F      MOV      r3,r11
        0x080042d6:    6961        ai      LDR      r1,[r4,#0x14]
        0x080042d8:    f002fd87    ....    BL       USB_ReadPMA ; 0x8006dea
        0x080042dc:    f000b95b    ..[.    B.W      0x8004596 ; PCD_EP_ISR_Handler + 878
        0x080042e0:    f0110f10    ....    TST      r1,#0x10
        0x080042e4:    d023        #.      BEQ      0x800432e ; PCD_EP_ISR_Handler + 262
        0x080042e6:    8801        ..      LDRH     r1,[r0,#0]
        0x080042e8:    f50574a8    ...t    ADD      r4,r5,#0x150
        0x080042ec:    f4116f00    ...o    TST      r1,#0x800
        0x080042f0:    d04a        J.      BEQ      0x8004388 ; PCD_EP_ISR_Handler + 352
        0x080042f2:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080042f6:    4401        .D      ADD      r1,r1,r0
        0x080042f8:    7820         x      LDRB     r0,[r4,#0]
        0x080042fa:    eb0800c0    ....    ADD      r0,r8,r0,LSL #3
        0x080042fe:    5a08        .Z      LDRH     r0,[r1,r0]
        0x08004300:    f5057126    ..&q    ADD      r1,r5,#0x298
        0x08004304:    f3c00309    ....    UBFX     r3,r0,#0,#10
        0x08004308:    61e3        .a      STR      r3,[r4,#0x1c]
        0x0800430a:    88e2        ..      LDRH     r2,[r4,#6]
        0x0800430c:    6828        (h      LDR      r0,[r5,#0]
        0x0800430e:    f002fd6c    ..l.    BL       USB_ReadPMA ; 0x8006dea
        0x08004312:    6829        )h      LDR      r1,[r5,#0]
        0x08004314:    8808        ..      LDRH     r0,[r1,#0]
        0x08004316:    f0200070     .p.    BIC      r0,r0,#0x70
        0x0800431a:    f4204070     .p@    BIC      r0,r0,#0xf000
        0x0800431e:    f0400080    @...    ORR      r0,r0,#0x80
        0x08004322:    8008        ..      STRH     r0,[r1,#0]
        0x08004324:    4628        (F      MOV      r0,r5
        0x08004326:    f7fdfd86    ....    BL       HAL_PCD_SetupStageCallback ; 0x8001e36
        0x0800432a:    f000bba4    ....    B.W      0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x0800432e:    8801        ..      LDRH     r1,[r0,#0]
        0x08004330:    f02101f0    !...    BIC      r1,r1,#0xf0
        0x08004334:    f42141e0    !..A    BIC      r1,r1,#0x7000
        0x08004338:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x0800433c:    8001        ..      STRH     r1,[r0,#0]
        0x0800433e:    6828        (h      LDR      r0,[r5,#0]
        0x08004340:    f1050410    ....    ADD      r4,r5,#0x10
        0x08004344:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004348:    4401        .D      ADD      r1,r1,r0
        0x0800434a:    7c28        (|      LDRB     r0,[r5,#0x10]
        0x0800434c:    eb0900c0    ....    ADD      r0,r9,r0,LSL #3
        0x08004350:    5a08        .Z      LDRH     r0,[r1,r0]
        0x08004352:    f3c00009    ....    UBFX     r0,r0,#0,#10
        0x08004356:    62e8        .b      STR      r0,[r5,#0x2c]
        0x08004358:    6a69        ij      LDR      r1,[r5,#0x24]
        0x0800435a:    4408        .D      ADD      r0,r0,r1
        0x0800435c:    6268        hb      STR      r0,[r5,#0x24]
        0x0800435e:    2100        .!      MOVS     r1,#0
        0x08004360:    4628        (F      MOV      r0,r5
        0x08004362:    f7fdfafd    ....    BL       HAL_PCD_DataInStageCallback ; 0x8001960
        0x08004366:    7b28        ({      LDRB     r0,[r5,#0xc]
        0x08004368:    2800        .(      CMP      r0,#0
        0x0800436a:    f0008384    ....    BEQ.W    0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x0800436e:    69a0        .i      LDR      r0,[r4,#0x18]
        0x08004370:    2800        .(      CMP      r0,#0
        0x08004372:    f0408380    @...    BNE.W    0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x08004376:    7b28        ({      LDRB     r0,[r5,#0xc]
        0x08004378:    6829        )h      LDR      r1,[r5,#0]
        0x0800437a:    f0400080    @...    ORR      r0,r0,#0x80
        0x0800437e:    f8a1004c    ..L.    STRH     r0,[r1,#0x4c]
        0x08004382:    732f        /s      STRB     r7,[r5,#0xc]
        0x08004384:    f000bb77    ..w.    B.W      0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x08004388:    f4114f00    ...O    TST      r1,#0x8000
        0x0800438c:    f0008373    ..s.    BEQ.W    0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x08004390:    8801        ..      LDRH     r1,[r0,#0]
        0x08004392:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x08004396:    f4214170    !.pA    BIC      r1,r1,#0xf000
        0x0800439a:    f0410180    A...    ORR      r1,r1,#0x80
        0x0800439e:    8001        ..      STRH     r1,[r0,#0]
        0x080043a0:    6828        (h      LDR      r0,[r5,#0]
        0x080043a2:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080043a6:    4408        .D      ADD      r0,r0,r1
        0x080043a8:    7821        !x      LDRB     r1,[r4,#0]
        0x080043aa:    eb0801c1    ....    ADD      r1,r8,r1,LSL #3
        0x080043ae:    5a40        @Z      LDRH     r0,[r0,r1]
        0x080043b0:    0583        ..      LSLS     r3,r0,#22
        0x080043b2:    0d9b        ..      LSRS     r3,r3,#22
        0x080043b4:    61e3        .a      STR      r3,[r4,#0x1c]
        0x080043b6:    bf1c        ..      ITT      NE
        0x080043b8:    6961        ai      LDRNE    r1,[r4,#0x14]
        0x080043ba:    2900        .)      CMPNE    r1,#0
        0x080043bc:    d00b        ..      BEQ      0x80043d6 ; PCD_EP_ISR_Handler + 430
        0x080043be:    88e2        ..      LDRH     r2,[r4,#6]
        0x080043c0:    6828        (h      LDR      r0,[r5,#0]
        0x080043c2:    f002fd12    ....    BL       USB_ReadPMA ; 0x8006dea
        0x080043c6:    69e1        .i      LDR      r1,[r4,#0x1c]
        0x080043c8:    6960        `i      LDR      r0,[r4,#0x14]
        0x080043ca:    4408        .D      ADD      r0,r0,r1
        0x080043cc:    6160        `a      STR      r0,[r4,#0x14]
        0x080043ce:    2100        .!      MOVS     r1,#0
        0x080043d0:    4628        (F      MOV      r0,r5
        0x080043d2:    f7fdface    ....    BL       HAL_PCD_DataOutStageCallback ; 0x8001972
        0x080043d6:    6829        )h      LDR      r1,[r5,#0]
        0x080043d8:    8808        ..      LDRH     r0,[r1,#0]
        0x080043da:    f4106f00    ...o    TST      r0,#0x800
        0x080043de:    f040834a    @.J.    BNE.W    0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x080043e2:    f44f5240    O.@R    MOV      r2,#0x3000
        0x080043e6:    ea320000    2...    BICS     r0,r2,r0
        0x080043ea:    f0008344    ..D.    BEQ.W    0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x080043ee:    f8b10050    ..P.    LDRH     r0,[r1,#0x50]
        0x080043f2:    1842        B.      ADDS     r2,r0,r1
        0x080043f4:    f8b20406    ....    LDRH     r0,[r2,#0x406]
        0x080043f8:    f3c00009    ....    UBFX     r0,r0,#0,#10
        0x080043fc:    f8a20406    ....    STRH     r0,[r2,#0x406]
        0x08004400:    6921        !i      LDR      r1,[r4,#0x10]
        0x08004402:    f2024206    ...B    ADD      r2,r2,#0x406
        0x08004406:    293e        >)      CMP      r1,#0x3e
        0x08004408:    d90c        ..      BLS      0x8004424 ; PCD_EP_ISR_Handler + 508
        0x0800440a:    0948        H.      LSRS     r0,r1,#5
        0x0800440c:    f0110f1f    ....    TST      r1,#0x1f
        0x08004410:    bf08        ..      IT       EQ
        0x08004412:    1e40        @.      SUBEQ    r0,r0,#1
        0x08004414:    8813        ..      LDRH     r3,[r2,#0]
        0x08004416:    f44f4100    O..A    MOV      r1,#0x8000
        0x0800441a:    ea412080    A..     ORR      r0,r1,r0,LSL #10
        0x0800441e:    4318        .C      ORRS     r0,r0,r3
        0x08004420:    8010        ..      STRH     r0,[r2,#0]
        0x08004422:    e013        ..      B        0x800444c ; PCD_EP_ISR_Handler + 548
        0x08004424:    2900        .)      CMP      r1,#0
        0x08004426:    bf04        ..      ITT      EQ
        0x08004428:    8810        ..      LDRHEQ   r0,[r2,#0]
        0x0800442a:    f4404000    @..@    ORREQ    r0,r0,#0x8000
        0x0800442e:    d00c        ..      BEQ      0x800444a ; PCD_EP_ISR_Handler + 546
        0x08004430:    ea4f0051    O.Q.    LSR      r0,r1,#1
        0x08004434:    f0110f01    ....    TST      r1,#1
        0x08004438:    bf18        ..      IT       NE
        0x0800443a:    1c40        @.      ADDNE    r0,r0,#1
        0x0800443c:    8813        ..      LDRH     r3,[r2,#0]
        0x0800443e:    f64f71ff    O..q    MOV      r1,#0xffff
        0x08004442:    ea012080    ...     AND      r0,r1,r0,LSL #10
        0x08004446:    ea430000    C...    ORR      r0,r3,r0
        0x0800444a:    8010        ..      STRH     r0,[r2,#0]
        0x0800444c:    6828        (h      LDR      r0,[r5,#0]
        0x0800444e:    8801        ..      LDRH     r1,[r0,#0]
        0x08004450:    f2480280    H...    MOV      r2,#0x8080
        0x08004454:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x08004458:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x0800445c:    f4815140    ..@Q    EOR      r1,r1,#0x3000
        0x08004460:    ea410102    A...    ORR      r1,r1,r2
        0x08004464:    8001        ..      STRH     r1,[r0,#0]
        0x08004466:    f000bb06    ....    B.W      0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x0800446a:    6828        (h      LDR      r0,[r5,#0]
        0x0800446c:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004470:    7822        "x      LDRB     r2,[r4,#0]
        0x08004472:    4401        .D      ADD      r1,r1,r0
        0x08004474:    eb0802c2    ....    ADD      r2,r8,r2,LSL #3
        0x08004478:    5a89        .Z      LDRH     r1,[r1,r2]
        0x0800447a:    f3c10b09    ....    UBFX     r11,r1,#0,#10
        0x0800447e:    f1bb0f00    ....    CMP      r11,#0
        0x08004482:    d043        C.      BEQ      0x800450c ; PCD_EP_ISR_Handler + 740
        0x08004484:    88e2        ..      LDRH     r2,[r4,#6]
        0x08004486:    465b        [F      MOV      r3,r11
        0x08004488:    6961        ai      LDR      r1,[r4,#0x14]
        0x0800448a:    f002fcae    ....    BL       USB_ReadPMA ; 0x8006dea
        0x0800448e:    e082        ..      B        0x8004596 ; PCD_EP_ISR_Handler + 878
        0x08004490:    6828        (h      LDR      r0,[r5,#0]
        0x08004492:    f4164f80    ...O    TST      r6,#0x4000
        0x08004496:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x0800449a:    4408        .D      ADD      r0,r0,r1
        0x0800449c:    7821        !x      LDRB     r1,[r4,#0]
        0x0800449e:    d036        6.      BEQ      0x800450e ; PCD_EP_ISR_Handler + 742
        0x080044a0:    eb0901c1    ....    ADD      r1,r9,r1,LSL #3
        0x080044a4:    5a40        @Z      LDRH     r0,[r0,r1]
        0x080044a6:    f3c00b09    ....    UBFX     r11,r0,#0,#10
        0x080044aa:    69a0        .i      LDR      r0,[r4,#0x18]
        0x080044ac:    4583        .E      CMP      r11,r0
        0x080044ae:    bf88        ..      IT       HI
        0x080044b0:    61a7        .a      STRHI    r7,[r4,#0x18]
        0x080044b2:    d803        ..      BHI      0x80044bc ; PCD_EP_ISR_Handler + 660
        0x080044b4:    ebb0000b    ....    SUBS     r0,r0,r11
        0x080044b8:    61a0        .a      STR      r0,[r4,#0x18]
        0x080044ba:    d10e        ..      BNE      0x80044da ; PCD_EP_ISR_Handler + 690
        0x080044bc:    7820         x      LDRB     r0,[r4,#0]
        0x080044be:    6829        )h      LDR      r1,[r5,#0]
        0x080044c0:    f8312020    1.      LDRH     r2,[r1,r0,LSL #2]
        0x080044c4:    f2480380    H...    MOV      r3,#0x8080
        0x080044c8:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x080044cc:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x080044d0:    f4825200    ...R    EOR      r2,r2,#0x2000
        0x080044d4:    431a        .C      ORRS     r2,r2,r3
        0x080044d6:    f8212020    !.      STRH     r2,[r1,r0,LSL #2]
        0x080044da:    f0160f40    ..@.    TST      r6,#0x40
        0x080044de:    d00c        ..      BEQ      0x80044fa ; PCD_EP_ISR_Handler + 722
        0x080044e0:    7821        !x      LDRB     r1,[r4,#0]
        0x080044e2:    6828        (h      LDR      r0,[r5,#0]
        0x080044e4:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x080044e8:    f24803c0    H...    MOV      r3,#0x80c0
        0x080044ec:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x080044f0:    f42242e0    "..B    BIC      r2,r2,#0x7000
        0x080044f4:    431a        .C      ORRS     r2,r2,r3
        0x080044f6:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x080044fa:    f1bb0f00    ....    CMP      r11,#0
        0x080044fe:    d04a        J.      BEQ      0x8004596 ; PCD_EP_ISR_Handler + 878
        0x08004500:    8922        ".      LDRH     r2,[r4,#8]
        0x08004502:    6961        ai      LDR      r1,[r4,#0x14]
        0x08004504:    465b        [F      MOV      r3,r11
        0x08004506:    6828        (h      LDR      r0,[r5,#0]
        0x08004508:    f002fc6f    ..o.    BL       USB_ReadPMA ; 0x8006dea
        0x0800450c:    e043        C.      B        0x8004596 ; PCD_EP_ISR_Handler + 878
        0x0800450e:    eb0801c1    ....    ADD      r1,r8,r1,LSL #3
        0x08004512:    5a40        @Z      LDRH     r0,[r0,r1]
        0x08004514:    f3c00b09    ....    UBFX     r11,r0,#0,#10
        0x08004518:    69a0        .i      LDR      r0,[r4,#0x18]
        0x0800451a:    4558        XE      CMP      r0,r11
        0x0800451c:    bf38        8.      IT       CC
        0x0800451e:    61a7        .a      STRCC    r7,[r4,#0x18]
        0x08004520:    d303        ..      BCC      0x800452a ; PCD_EP_ISR_Handler + 770
        0x08004522:    ebb0000b    ....    SUBS     r0,r0,r11
        0x08004526:    61a0        .a      STR      r0,[r4,#0x18]
        0x08004528:    d10e        ..      BNE      0x8004548 ; PCD_EP_ISR_Handler + 800
        0x0800452a:    7820         x      LDRB     r0,[r4,#0]
        0x0800452c:    6829        )h      LDR      r1,[r5,#0]
        0x0800452e:    f8312020    1.      LDRH     r2,[r1,r0,LSL #2]
        0x08004532:    f2480380    H...    MOV      r3,#0x8080
        0x08004536:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x0800453a:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x0800453e:    f4825200    ...R    EOR      r2,r2,#0x2000
        0x08004542:    431a        .C      ORRS     r2,r2,r3
        0x08004544:    f8212020    !.      STRH     r2,[r1,r0,LSL #2]
        0x08004548:    f0160f40    ..@.    TST      r6,#0x40
        0x0800454c:    d10c        ..      BNE      0x8004568 ; PCD_EP_ISR_Handler + 832
        0x0800454e:    7822        "x      LDRB     r2,[r4,#0]
        0x08004550:    6828        (h      LDR      r0,[r5,#0]
        0x08004552:    f8301022    0.".    LDRH     r1,[r0,r2,LSL #2]
        0x08004556:    f24803c0    H...    MOV      r3,#0x80c0
        0x0800455a:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x0800455e:    f42141e0    !..A    BIC      r1,r1,#0x7000
        0x08004562:    4319        .C      ORRS     r1,r1,r3
        0x08004564:    f8201022     .".    STRH     r1,[r0,r2,LSL #2]
        0x08004568:    f1bb0f00    ....    CMP      r11,#0
        0x0800456c:    d013        ..      BEQ      0x8004596 ; PCD_EP_ISR_Handler + 878
        0x0800456e:    8962        b.      LDRH     r2,[r4,#0xa]
        0x08004570:    6961        ai      LDR      r1,[r4,#0x14]
        0x08004572:    465b        [F      MOV      r3,r11
        0x08004574:    6828        (h      LDR      r0,[r5,#0]
        0x08004576:    f002fc38    ..8.    BL       USB_ReadPMA ; 0x8006dea
        0x0800457a:    e00c        ..      B        0x8004596 ; PCD_EP_ISR_Handler + 878
        0x0800457c:    eb0801c1    ....    ADD      r1,r8,r1,LSL #3
        0x08004580:    5a51        QZ      LDRH     r1,[r2,r1]
        0x08004582:    f3c10b09    ....    UBFX     r11,r1,#0,#10
        0x08004586:    f1bb0f00    ....    CMP      r11,#0
        0x0800458a:    d004        ..      BEQ      0x8004596 ; PCD_EP_ISR_Handler + 878
        0x0800458c:    8962        b.      LDRH     r2,[r4,#0xa]
        0x0800458e:    465b        [F      MOV      r3,r11
        0x08004590:    6961        ai      LDR      r1,[r4,#0x14]
        0x08004592:    f002fc2a    ..*.    BL       USB_ReadPMA ; 0x8006dea
        0x08004596:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x08004598:    4458        XD      ADD      r0,r0,r11
        0x0800459a:    61e0        .a      STR      r0,[r4,#0x1c]
        0x0800459c:    6960        `i      LDR      r0,[r4,#0x14]
        0x0800459e:    4458        XD      ADD      r0,r0,r11
        0x080045a0:    6160        `a      STR      r0,[r4,#0x14]
        0x080045a2:    69a0        .i      LDR      r0,[r4,#0x18]
        0x080045a4:    b110        ..      CBZ      r0,0x80045ac ; PCD_EP_ISR_Handler + 900
        0x080045a6:    6920         i      LDR      r0,[r4,#0x10]
        0x080045a8:    4558        XE      CMP      r0,r11
        0x080045aa:    d904        ..      BLS      0x80045b6 ; PCD_EP_ISR_Handler + 910
        0x080045ac:    7821        !x      LDRB     r1,[r4,#0]
        0x080045ae:    4628        (F      MOV      r0,r5
        0x080045b0:    f7fdf9df    ....    BL       HAL_PCD_DataOutStageCallback ; 0x8001972
        0x080045b4:    e003        ..      B        0x80045be ; PCD_EP_ISR_Handler + 918
        0x080045b6:    4621        !F      MOV      r1,r4
        0x080045b8:    6828        (h      LDR      r0,[r5,#0]
        0x080045ba:    f002f887    ....    BL       USB_EPStartXfer ; 0x80066cc
        0x080045be:    f0160f80    ....    TST      r6,#0x80
        0x080045c2:    f0008258    ..X.    BEQ.W    0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x080045c6:    eb0a008a    ....    ADD      r0,r10,r10,LSL #2
        0x080045ca:    6829        )h      LDR      r1,[r5,#0]
        0x080045cc:    eb0500c0    ....    ADD      r0,r5,r0,LSL #3
        0x080045d0:    f1000410    ....    ADD      r4,r0,#0x10
        0x080045d4:    f831002a    1.*.    LDRH     r0,[r1,r10,LSL #2]
        0x080045d8:    f02000f0     ...    BIC      r0,r0,#0xf0
        0x080045dc:    f42040e0     ..@    BIC      r0,r0,#0x7000
        0x080045e0:    f4404000    @..@    ORR      r0,r0,#0x8000
        0x080045e4:    f821002a    !.*.    STRH     r0,[r1,r10,LSL #2]
        0x080045e8:    78e0        .x      LDRB     r0,[r4,#3]
        0x080045ea:    2801        .(      CMP      r0,#1
        0x080045ec:    d02f        /.      BEQ      0x800464e ; PCD_EP_ISR_Handler + 1062
        0x080045ee:    f4167f80    ....    TST      r6,#0x100
        0x080045f2:    d078        x.      BEQ      0x80046e6 ; PCD_EP_ISR_Handler + 1214
        0x080045f4:    6828        (h      LDR      r0,[r5,#0]
        0x080045f6:    f0160f40    ..@.    TST      r6,#0x40
        0x080045fa:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080045fe:    f0008152    ..R.    BEQ.W    0x80048a6 ; PCD_EP_ISR_Handler + 1662
        0x08004602:    4401        .D      ADD      r1,r1,r0
        0x08004604:    7820         x      LDRB     r0,[r4,#0]
        0x08004606:    eb0900c0    ....    ADD      r0,r9,r0,LSL #3
        0x0800460a:    5a08        .Z      LDRH     r0,[r1,r0]
        0x0800460c:    f3c00109    ....    UBFX     r1,r0,#0,#10
        0x08004610:    69a0        .i      LDR      r0,[r4,#0x18]
        0x08004612:    4288        .B      CMP      r0,r1
        0x08004614:    bf98        ..      IT       LS
        0x08004616:    61a7        .a      STRLS    r7,[r4,#0x18]
        0x08004618:    d97e        ~.      BLS      0x8004718 ; PCD_EP_ISR_Handler + 1264
        0x0800461a:    1a40        @.      SUBS     r0,r0,r1
        0x0800461c:    61a0        .a      STR      r0,[r4,#0x18]
        0x0800461e:    d07b        {.      BEQ      0x8004718 ; PCD_EP_ISR_Handler + 1264
        0x08004620:    f4164f80    ...O    TST      r6,#0x4000
        0x08004624:    d00d        ..      BEQ      0x8004642 ; PCD_EP_ISR_Handler + 1050
        0x08004626:    7820         x      LDRB     r0,[r4,#0]
        0x08004628:    682a        *h      LDR      r2,[r5,#0]
        0x0800462a:    f8323020    2. 0    LDRH     r3,[r2,r0,LSL #2]
        0x0800462e:    f24c0c80    L...    MOV      r12,#0xc080
        0x08004632:    f0230370    #.p.    BIC      r3,r3,#0x70
        0x08004636:    f42343e0    #..C    BIC      r3,r3,#0x7000
        0x0800463a:    ea43030c    C...    ORR      r3,r3,r12
        0x0800463e:    f8223020    ". 0    STRH     r3,[r2,r0,LSL #2]
