ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08004642:    f8940024    ..$.    LDRB     r0,[r4,#0x24]
        0x08004646:    2801        .(      CMP      r0,#1
        0x08004648:    d067        g.      BEQ      0x800471a ; PCD_EP_ISR_Handler + 1266
        0x0800464a:    f000ba05    ....    B.W      0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x0800464e:    61a7        .a      STR      r7,[r4,#0x18]
        0x08004650:    7b20         {      LDRB     r0,[r4,#0xc]
        0x08004652:    b320         .      CBZ      r0,0x800469e ; PCD_EP_ISR_Handler + 1142
        0x08004654:    f0160f40    ..@.    TST      r6,#0x40
        0x08004658:    d022        ".      BEQ      0x80046a0 ; PCD_EP_ISR_Handler + 1144
        0x0800465a:    7860        `x      LDRB     r0,[r4,#1]
        0x0800465c:    b110        ..      CBZ      r0,0x8004664 ; PCD_EP_ISR_Handler + 1084
        0x0800465e:    2801        .(      CMP      r0,#1
        0x08004660:    d014        ..      BEQ      0x800468c ; PCD_EP_ISR_Handler + 1124
        0x08004662:    e061        a.      B        0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x08004664:    6828        (h      LDR      r0,[r5,#0]
        0x08004666:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x0800466a:    4408        .D      ADD      r0,r0,r1
        0x0800466c:    7821        !x      LDRB     r1,[r4,#0]
        0x0800466e:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08004672:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x08004676:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x0800467a:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x0800467e:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x08004682:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x08004686:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x0800468a:    e04d        M.      B        0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x0800468c:    6828        (h      LDR      r0,[r5,#0]
        0x0800468e:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004692:    4408        .D      ADD      r0,r0,r1
        0x08004694:    7821        !x      LDRB     r1,[r4,#0]
        0x08004696:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x0800469a:    f8a07402    ...t    STRH     r7,[r0,#0x402]
        0x0800469e:    e043        C.      B        0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x080046a0:    7861        ax      LDRB     r1,[r4,#1]
        0x080046a2:    6828        (h      LDR      r0,[r5,#0]
        0x080046a4:    b111        ..      CBZ      r1,0x80046ac ; PCD_EP_ISR_Handler + 1156
        0x080046a6:    2901        .)      CMP      r1,#1
        0x080046a8:    d014        ..      BEQ      0x80046d4 ; PCD_EP_ISR_Handler + 1196
        0x080046aa:    e03d        =.      B        0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x080046ac:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080046b0:    4408        .D      ADD      r0,r0,r1
        0x080046b2:    7821        !x      LDRB     r1,[r4,#0]
        0x080046b4:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x080046b8:    f8b01406    ....    LDRH     r1,[r0,#0x406]
        0x080046bc:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x080046c0:    f8a01406    ....    STRH     r1,[r0,#0x406]
        0x080046c4:    f8b01406    ....    LDRH     r1,[r0,#0x406]
        0x080046c8:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x080046cc:    f8a01406    ....    STRH     r1,[r0,#0x406]
        0x080046d0:    e02a        *.      B        0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x080046d2:    e008        ..      B        0x80046e6 ; PCD_EP_ISR_Handler + 1214
        0x080046d4:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080046d8:    4408        .D      ADD      r0,r0,r1
        0x080046da:    7821        !x      LDRB     r1,[r4,#0]
        0x080046dc:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x080046e0:    f8a07406    ...t    STRH     r7,[r0,#0x406]
        0x080046e4:    e020         .      B        0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x080046e6:    6828        (h      LDR      r0,[r5,#0]
        0x080046e8:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080046ec:    4401        .D      ADD      r1,r1,r0
        0x080046ee:    7820         x      LDRB     r0,[r4,#0]
        0x080046f0:    eb0900c0    ....    ADD      r0,r9,r0,LSL #3
        0x080046f4:    5a08        .Z      LDRH     r0,[r1,r0]
        0x080046f6:    69a1        .i      LDR      r1,[r4,#0x18]
        0x080046f8:    f3c00009    ....    UBFX     r0,r0,#0,#10
        0x080046fc:    4281        .B      CMP      r1,r0
        0x080046fe:    bf98        ..      IT       LS
        0x08004700:    61a7        .a      STRLS    r7,[r4,#0x18]
        0x08004702:    d911        ..      BLS      0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x08004704:    1a09        ..      SUBS     r1,r1,r0
        0x08004706:    61a1        .a      STR      r1,[r4,#0x18]
        0x08004708:    d00e        ..      BEQ      0x8004728 ; PCD_EP_ISR_Handler + 1280
        0x0800470a:    6961        ai      LDR      r1,[r4,#0x14]
        0x0800470c:    4401        .D      ADD      r1,r1,r0
        0x0800470e:    6161        aa      STR      r1,[r4,#0x14]
        0x08004710:    69e1        .i      LDR      r1,[r4,#0x1c]
        0x08004712:    4408        .D      ADD      r0,r0,r1
        0x08004714:    61e0        .a      STR      r0,[r4,#0x1c]
        0x08004716:    e001        ..      B        0x800471c ; PCD_EP_ISR_Handler + 1268
        0x08004718:    e00c        ..      B        0x8004734 ; PCD_EP_ISR_Handler + 1292
        0x0800471a:    e065        e.      B        0x80047e8 ; PCD_EP_ISR_Handler + 1472
        0x0800471c:    4621        !F      MOV      r1,r4
        0x0800471e:    6828        (h      LDR      r0,[r5,#0]
        0x08004720:    f001ffd4    ....    BL       USB_EPStartXfer ; 0x80066cc
        0x08004724:    f000b9a7    ....    B.W      0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x08004728:    7821        !x      LDRB     r1,[r4,#0]
        0x0800472a:    4628        (F      MOV      r0,r5
        0x0800472c:    f7fdf918    ....    BL       HAL_PCD_DataInStageCallback ; 0x8001960
        0x08004730:    f000b9a1    ....    B.W      0x8004a76 ; PCD_EP_ISR_Handler + 2126
        0x08004734:    7860        `x      LDRB     r0,[r4,#1]
        0x08004736:    b110        ..      CBZ      r0,0x800473e ; PCD_EP_ISR_Handler + 1302
        0x08004738:    2801        .(      CMP      r0,#1
        0x0800473a:    d014        ..      BEQ      0x8004766 ; PCD_EP_ISR_Handler + 1342
        0x0800473c:    e01c        ..      B        0x8004778 ; PCD_EP_ISR_Handler + 1360
        0x0800473e:    6828        (h      LDR      r0,[r5,#0]
        0x08004740:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004744:    4408        .D      ADD      r0,r0,r1
        0x08004746:    7821        !x      LDRB     r1,[r4,#0]
        0x08004748:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x0800474c:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x08004750:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x08004754:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x08004758:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x0800475c:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x08004760:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x08004764:    e008        ..      B        0x8004778 ; PCD_EP_ISR_Handler + 1360
        0x08004766:    6828        (h      LDR      r0,[r5,#0]
        0x08004768:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x0800476c:    4408        .D      ADD      r0,r0,r1
        0x0800476e:    7821        !x      LDRB     r1,[r4,#0]
        0x08004770:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08004774:    f8a07402    ...t    STRH     r7,[r0,#0x402]
        0x08004778:    7861        ax      LDRB     r1,[r4,#1]
        0x0800477a:    6828        (h      LDR      r0,[r5,#0]
        0x0800477c:    b111        ..      CBZ      r1,0x8004784 ; PCD_EP_ISR_Handler + 1372
        0x0800477e:    2901        .)      CMP      r1,#1
        0x08004780:    d013        ..      BEQ      0x80047aa ; PCD_EP_ISR_Handler + 1410
        0x08004782:    e01a        ..      B        0x80047ba ; PCD_EP_ISR_Handler + 1426
        0x08004784:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004788:    4408        .D      ADD      r0,r0,r1
        0x0800478a:    7821        !x      LDRB     r1,[r4,#0]
        0x0800478c:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08004790:    f8b01406    ....    LDRH     r1,[r0,#0x406]
        0x08004794:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x08004798:    f8a01406    ....    STRH     r1,[r0,#0x406]
        0x0800479c:    f8b01406    ....    LDRH     r1,[r0,#0x406]
        0x080047a0:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x080047a4:    f8a01406    ....    STRH     r1,[r0,#0x406]
        0x080047a8:    e007        ..      B        0x80047ba ; PCD_EP_ISR_Handler + 1426
        0x080047aa:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080047ae:    4408        .D      ADD      r0,r0,r1
        0x080047b0:    7821        !x      LDRB     r1,[r4,#0]
        0x080047b2:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x080047b6:    f8a07406    ...t    STRH     r7,[r0,#0x406]
        0x080047ba:    7821        !x      LDRB     r1,[r4,#0]
        0x080047bc:    4628        (F      MOV      r0,r5
        0x080047be:    f7fdf8cf    ....    BL       HAL_PCD_DataInStageCallback ; 0x8001960
        0x080047c2:    f4164f80    ...O    TST      r6,#0x4000
        0x080047c6:    f0008147    ..G.    BEQ.W    0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x080047ca:    7821        !x      LDRB     r1,[r4,#0]
        0x080047cc:    6828        (h      LDR      r0,[r5,#0]
        0x080047ce:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x080047d2:    f0220370    ".p.    BIC      r3,r2,#0x70
        0x080047d6:    f42343e0    #..C    BIC      r3,r3,#0x7000
        0x080047da:    f24c0280    L...    MOV      r2,#0xc080
        0x080047de:    431a        .C      ORRS     r2,r2,r3
        0x080047e0:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x080047e4:    f000b938    ..8.    B.W      0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x080047e8:    6960        `i      LDR      r0,[r4,#0x14]
        0x080047ea:    4408        .D      ADD      r0,r0,r1
        0x080047ec:    6160        `a      STR      r0,[r4,#0x14]
        0x080047ee:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x080047f0:    4408        .D      ADD      r0,r0,r1
        0x080047f2:    61e0        .a      STR      r0,[r4,#0x1c]
        0x080047f4:    6923        #i      LDR      r3,[r4,#0x10]
        0x080047f6:    6a20         j      LDR      r0,[r4,#0x20]
        0x080047f8:    4298        .B      CMP      r0,r3
        0x080047fa:    bf24        $.      ITT      CS
        0x080047fc:    1ac0        ..      SUBCS    r0,r0,r3
        0x080047fe:    6220         b      STRCS    r0,[r4,#0x20]
        0x08004800:    d207        ..      BCS      0x8004812 ; PCD_EP_ISR_Handler + 1514
        0x08004802:    2800        .(      CMP      r0,#0
        0x08004804:    bf08        ..      IT       EQ
        0x08004806:    460b        .F      MOVEQ    r3,r1
        0x08004808:    f8847024    ..$p    STRB     r7,[r4,#0x24]
        0x0800480c:    bf1c        ..      ITT      NE
        0x0800480e:    4603        .F      MOVNE    r3,r0
        0x08004810:    6227        'b      STRNE    r7,[r4,#0x20]
        0x08004812:    7860        `x      LDRB     r0,[r4,#1]
        0x08004814:    b110        ..      CBZ      r0,0x800481c ; PCD_EP_ISR_Handler + 1524
        0x08004816:    2801        .(      CMP      r0,#1
        0x08004818:    d035        5.      BEQ      0x8004886 ; PCD_EP_ISR_Handler + 1630
        0x0800481a:    e03d        =.      B        0x8004898 ; PCD_EP_ISR_Handler + 1648
        0x0800481c:    6828        (h      LDR      r0,[r5,#0]
        0x0800481e:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004822:    4408        .D      ADD      r0,r0,r1
        0x08004824:    7821        !x      LDRB     r1,[r4,#0]
        0x08004826:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x0800482a:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x0800482e:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x08004832:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x08004836:    f2004002    ...@    ADD      r0,r0,#0x402
        0x0800483a:    2b3e        >+      CMP      r3,#0x3e
        0x0800483c:    d90e        ..      BLS      0x800485c ; PCD_EP_ISR_Handler + 1588
        0x0800483e:    0959        Y.      LSRS     r1,r3,#5
        0x08004840:    f0130f1f    ....    TST      r3,#0x1f
        0x08004844:    bf08        ..      IT       EQ
        0x08004846:    1e49        I.      SUBEQ    r1,r1,#1
        0x08004848:    f8b0c000    ....    LDRH     r12,[r0,#0]
        0x0800484c:    f44f4200    O..B    MOV      r2,#0x8000
        0x08004850:    ea422181    B..!    ORR      r1,r2,r1,LSL #10
        0x08004854:    ea4c0101    L...    ORR      r1,r12,r1
        0x08004858:    8001        ..      STRH     r1,[r0,#0]
        0x0800485a:    e01d        ..      B        0x8004898 ; PCD_EP_ISR_Handler + 1648
        0x0800485c:    2b00        .+      CMP      r3,#0
        0x0800485e:    bf04        ..      ITT      EQ
        0x08004860:    8801        ..      LDRHEQ   r1,[r0,#0]
        0x08004862:    f4414100    A..A    ORREQ    r1,r1,#0x8000
        0x08004866:    d0f7        ..      BEQ      0x8004858 ; PCD_EP_ISR_Handler + 1584
        0x08004868:    085a        Z.      LSRS     r2,r3,#1
        0x0800486a:    f0130f01    ....    TST      r3,#1
        0x0800486e:    bf18        ..      IT       NE
        0x08004870:    1c52        R.      ADDNE    r2,r2,#1
        0x08004872:    f8b0c000    ....    LDRH     r12,[r0,#0]
        0x08004876:    f64f71ff    O..q    MOV      r1,#0xffff
        0x0800487a:    ea012182    ...!    AND      r1,r1,r2,LSL #10
        0x0800487e:    ea4c0101    L...    ORR      r1,r12,r1
        0x08004882:    8001        ..      STRH     r1,[r0,#0]
        0x08004884:    e008        ..      B        0x8004898 ; PCD_EP_ISR_Handler + 1648
        0x08004886:    6828        (h      LDR      r0,[r5,#0]
        0x08004888:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x0800488c:    4408        .D      ADD      r0,r0,r1
        0x0800488e:    7821        !x      LDRB     r1,[r4,#0]
        0x08004890:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08004894:    f8a03402    ...4    STRH     r3,[r0,#0x402]
        0x08004898:    b29b        ..      UXTH     r3,r3
        0x0800489a:    8922        ".      LDRH     r2,[r4,#8]
        0x0800489c:    6961        ai      LDR      r1,[r4,#0x14]
        0x0800489e:    6828        (h      LDR      r0,[r5,#0]
        0x080048a0:    f002fac0    ....    BL       USB_WritePMA ; 0x8006e24
        0x080048a4:    e0d8        ..      B        0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x080048a6:    4408        .D      ADD      r0,r0,r1
        0x080048a8:    7821        !x      LDRB     r1,[r4,#0]
        0x080048aa:    eb0801c1    ....    ADD      r1,r8,r1,LSL #3
        0x080048ae:    5a40        @Z      LDRH     r0,[r0,r1]
        0x080048b0:    69a1        .i      LDR      r1,[r4,#0x18]
        0x080048b2:    f3c00009    ....    UBFX     r0,r0,#0,#10
        0x080048b6:    4281        .B      CMP      r1,r0
        0x080048b8:    bf38        8.      IT       CC
        0x080048ba:    61a7        .a      STRCC    r7,[r4,#0x18]
        0x080048bc:    d306        ..      BCC      0x80048cc ; PCD_EP_ISR_Handler + 1700
        0x080048be:    1a09        ..      SUBS     r1,r1,r0
        0x080048c0:    61a1        .a      STR      r1,[r4,#0x18]
        0x080048c2:    d003        ..      BEQ      0x80048cc ; PCD_EP_ISR_Handler + 1700
        0x080048c4:    f4164f80    ...O    TST      r6,#0x4000
        0x080048c8:    d058        X.      BEQ      0x800497c ; PCD_EP_ISR_Handler + 1876
        0x080048ca:    e065        e.      B        0x8004998 ; PCD_EP_ISR_Handler + 1904
        0x080048cc:    7860        `x      LDRB     r0,[r4,#1]
        0x080048ce:    b110        ..      CBZ      r0,0x80048d6 ; PCD_EP_ISR_Handler + 1710
        0x080048d0:    2801        .(      CMP      r0,#1
        0x080048d2:    d014        ..      BEQ      0x80048fe ; PCD_EP_ISR_Handler + 1750
        0x080048d4:    e01c        ..      B        0x8004910 ; PCD_EP_ISR_Handler + 1768
        0x080048d6:    6828        (h      LDR      r0,[r5,#0]
        0x080048d8:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x080048dc:    4408        .D      ADD      r0,r0,r1
        0x080048de:    7821        !x      LDRB     r1,[r4,#0]
        0x080048e0:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x080048e4:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x080048e8:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x080048ec:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x080048f0:    f8b01402    ....    LDRH     r1,[r0,#0x402]
        0x080048f4:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x080048f8:    f8a01402    ....    STRH     r1,[r0,#0x402]
        0x080048fc:    e008        ..      B        0x8004910 ; PCD_EP_ISR_Handler + 1768
        0x080048fe:    6828        (h      LDR      r0,[r5,#0]
        0x08004900:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004904:    4408        .D      ADD      r0,r0,r1
        0x08004906:    7821        !x      LDRB     r1,[r4,#0]
        0x08004908:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x0800490c:    f8a07402    ...t    STRH     r7,[r0,#0x402]
        0x08004910:    7861        ax      LDRB     r1,[r4,#1]
        0x08004912:    6828        (h      LDR      r0,[r5,#0]
        0x08004914:    b111        ..      CBZ      r1,0x800491c ; PCD_EP_ISR_Handler + 1780
        0x08004916:    2901        .)      CMP      r1,#1
        0x08004918:    d013        ..      BEQ      0x8004942 ; PCD_EP_ISR_Handler + 1818
        0x0800491a:    e01a        ..      B        0x8004952 ; PCD_EP_ISR_Handler + 1834
        0x0800491c:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004920:    4408        .D      ADD      r0,r0,r1
        0x08004922:    7821        !x      LDRB     r1,[r4,#0]
        0x08004924:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08004928:    f8b01406    ....    LDRH     r1,[r0,#0x406]
        0x0800492c:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x08004930:    f8a01406    ....    STRH     r1,[r0,#0x406]
        0x08004934:    f8b01406    ....    LDRH     r1,[r0,#0x406]
        0x08004938:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x0800493c:    f8a01406    ....    STRH     r1,[r0,#0x406]
        0x08004940:    e007        ..      B        0x8004952 ; PCD_EP_ISR_Handler + 1834
        0x08004942:    f8b01050    ..P.    LDRH     r1,[r0,#0x50]
        0x08004946:    4408        .D      ADD      r0,r0,r1
        0x08004948:    7821        !x      LDRB     r1,[r4,#0]
        0x0800494a:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x0800494e:    f8a07406    ...t    STRH     r7,[r0,#0x406]
        0x08004952:    7821        !x      LDRB     r1,[r4,#0]
        0x08004954:    4628        (F      MOV      r0,r5
        0x08004956:    f7fdf803    ....    BL       HAL_PCD_DataInStageCallback ; 0x8001960
        0x0800495a:    f4164f80    ...O    TST      r6,#0x4000
        0x0800495e:    d17b        {.      BNE      0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x08004960:    7820         x      LDRB     r0,[r4,#0]
        0x08004962:    682a        *h      LDR      r2,[r5,#0]
        0x08004964:    f8321020    2. .    LDRH     r1,[r2,r0,LSL #2]
        0x08004968:    f24c0380    L...    MOV      r3,#0xc080
        0x0800496c:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x08004970:    f42141e0    !..A    BIC      r1,r1,#0x7000
        0x08004974:    4319        .C      ORRS     r1,r1,r3
        0x08004976:    f8221020    ". .    STRH     r1,[r2,r0,LSL #2]
        0x0800497a:    e06d        m.      B        0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x0800497c:    7822        "x      LDRB     r2,[r4,#0]
        0x0800497e:    6829        )h      LDR      r1,[r5,#0]
        0x08004980:    f8313022    1."0    LDRH     r3,[r1,r2,LSL #2]
        0x08004984:    f0230c70    #.p.    BIC      r12,r3,#0x70
        0x08004988:    f42c4ce0    ,..L    BIC      r12,r12,#0x7000
        0x0800498c:    f24c0380    L...    MOV      r3,#0xc080
        0x08004990:    ea4c0303    L...    ORR      r3,r12,r3
        0x08004994:    f8213022    !."0    STRH     r3,[r1,r2,LSL #2]
        0x08004998:    f8941024    ..$.    LDRB     r1,[r4,#0x24]
        0x0800499c:    2901        .)      CMP      r1,#1
        0x0800499e:    d15b        [.      BNE      0x8004a58 ; PCD_EP_ISR_Handler + 2096
        0x080049a0:    6961        ai      LDR      r1,[r4,#0x14]
        0x080049a2:    4401        .D      ADD      r1,r1,r0
        0x080049a4:    6161        aa      STR      r1,[r4,#0x14]
        0x080049a6:    69e1        .i      LDR      r1,[r4,#0x1c]
        0x080049a8:    4401        .D      ADD      r1,r1,r0
        0x080049aa:    61e1        .a      STR      r1,[r4,#0x1c]
        0x080049ac:    6922        "i      LDR      r2,[r4,#0x10]
        0x080049ae:    6a21        !j      LDR      r1,[r4,#0x20]
        0x080049b0:    4291        .B      CMP      r1,r2
        0x080049b2:    d308        ..      BCC      0x80049c6 ; PCD_EP_ISR_Handler + 1950
        0x080049b4:    4610        .F      MOV      r0,r2
        0x080049b6:    1a09        ..      SUBS     r1,r1,r0
        0x080049b8:    6221        !b      STR      r1,[r4,#0x20]
        0x080049ba:    7862        bx      LDRB     r2,[r4,#1]
        0x080049bc:    6829        )h      LDR      r1,[r5,#0]
        0x080049be:    b14a        J.      CBZ      r2,0x80049d4 ; PCD_EP_ISR_Handler + 1964
        0x080049c0:    2a01        .*      CMP      r2,#1
        0x080049c2:    d03b        ;.      BEQ      0x8004a3c ; PCD_EP_ISR_Handler + 2068
        0x080049c4:    e042        B.      B        0x8004a4c ; PCD_EP_ISR_Handler + 2084
        0x080049c6:    2900        .)      CMP      r1,#0
        0x080049c8:    bf1c        ..      ITT      NE
        0x080049ca:    4608        .F      MOVNE    r0,r1
        0x080049cc:    6227        'b      STRNE    r7,[r4,#0x20]
        0x080049ce:    f8847024    ..$p    STRB     r7,[r4,#0x24]
        0x080049d2:    e7f2        ..      B        0x80049ba ; PCD_EP_ISR_Handler + 1938
        0x080049d4:    f8b12050    ..P     LDRH     r2,[r1,#0x50]
        0x080049d8:    4411        .D      ADD      r1,r1,r2
        0x080049da:    7822        "x      LDRB     r2,[r4,#0]
        0x080049dc:    eb0102c2    ....    ADD      r2,r1,r2,LSL #3
        0x080049e0:    f8b21406    ....    LDRH     r1,[r2,#0x406]
        0x080049e4:    f3c10109    ....    UBFX     r1,r1,#0,#10
        0x080049e8:    f8a21406    ....    STRH     r1,[r2,#0x406]
        0x080049ec:    f2024206    ...B    ADD      r2,r2,#0x406
        0x080049f0:    283e        >(      CMP      r0,#0x3e
        0x080049f2:    d90e        ..      BLS      0x8004a12 ; PCD_EP_ISR_Handler + 2026
        0x080049f4:    0941        A.      LSRS     r1,r0,#5
        0x080049f6:    f0100f1f    ....    TST      r0,#0x1f
        0x080049fa:    bf08        ..      IT       EQ
        0x080049fc:    1e49        I.      SUBEQ    r1,r1,#1
        0x080049fe:    f8b2c000    ....    LDRH     r12,[r2,#0]
        0x08004a02:    f44f4300    O..C    MOV      r3,#0x8000
