ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08004a06:    ea432181    C..!    ORR      r1,r3,r1,LSL #10
        0x08004a0a:    ea4c0101    L...    ORR      r1,r12,r1
        0x08004a0e:    8011        ..      STRH     r1,[r2,#0]
        0x08004a10:    e01c        ..      B        0x8004a4c ; PCD_EP_ISR_Handler + 2084
        0x08004a12:    2800        .(      CMP      r0,#0
        0x08004a14:    bf04        ..      ITT      EQ
        0x08004a16:    8811        ..      LDRHEQ   r1,[r2,#0]
        0x08004a18:    f4414100    A..A    ORREQ    r1,r1,#0x8000
        0x08004a1c:    d0f7        ..      BEQ      0x8004a0e ; PCD_EP_ISR_Handler + 2022
        0x08004a1e:    0841        A.      LSRS     r1,r0,#1
        0x08004a20:    f0100f01    ....    TST      r0,#1
        0x08004a24:    bf18        ..      IT       NE
        0x08004a26:    1c49        I.      ADDNE    r1,r1,#1
        0x08004a28:    f8b2c000    ....    LDRH     r12,[r2,#0]
        0x08004a2c:    f64f73ff    O..s    MOV      r3,#0xffff
        0x08004a30:    ea032181    ...!    AND      r1,r3,r1,LSL #10
        0x08004a34:    ea4c0101    L...    ORR      r1,r12,r1
        0x08004a38:    8011        ..      STRH     r1,[r2,#0]
        0x08004a3a:    e007        ..      B        0x8004a4c ; PCD_EP_ISR_Handler + 2084
        0x08004a3c:    f8b12050    ..P     LDRH     r2,[r1,#0x50]
        0x08004a40:    4411        .D      ADD      r1,r1,r2
        0x08004a42:    7822        "x      LDRB     r2,[r4,#0]
        0x08004a44:    eb0101c2    ....    ADD      r1,r1,r2,LSL #3
        0x08004a48:    f8a10406    ....    STRH     r0,[r1,#0x406]
        0x08004a4c:    b283        ..      UXTH     r3,r0
        0x08004a4e:    8962        b.      LDRH     r2,[r4,#0xa]
        0x08004a50:    6961        ai      LDR      r1,[r4,#0x14]
        0x08004a52:    6828        (h      LDR      r0,[r5,#0]
        0x08004a54:    f002f9e6    ....    BL       USB_WritePMA ; 0x8006e24
        0x08004a58:    7821        !x      LDRB     r1,[r4,#0]
        0x08004a5a:    682a        *h      LDR      r2,[r5,#0]
        0x08004a5c:    f8320021    2.!.    LDRH     r0,[r2,r1,LSL #2]
        0x08004a60:    f4205041     .AP    BIC      r0,r0,#0x3040
        0x08004a64:    f4204080     ..@    BIC      r0,r0,#0x4000
        0x08004a68:    f0800330    ..0.    EOR      r3,r0,#0x30
        0x08004a6c:    f2480080    H...    MOV      r0,#0x8080
        0x08004a70:    4318        .C      ORRS     r0,r0,r3
        0x08004a72:    f8220021    ".!.    STRH     r0,[r2,r1,LSL #2]
        0x08004a76:    6828        (h      LDR      r0,[r5,#0]
        0x08004a78:    f8b00044    ..D.    LDRH     r0,[r0,#0x44]
        0x08004a7c:    f4104f00    ...O    TST      r0,#0x8000
        0x08004a80:    f47fabe1    ....    BNE      0x8004246 ; PCD_EP_ISR_Handler + 30
        0x08004a84:    2000        .       MOVS     r0,#0
        0x08004a86:    e8bd9ff0    ....    POP      {r4-r12,pc}
    i.PendSV_Handler
    PendSV_Handler
        0x08004a8a:    4770        pG      BX       lr
    i.PerformanceCriticalTask
    PerformanceCriticalTask
        0x08004a8c:    b530        0.      PUSH     {r4,r5,lr}
        0x08004a8e:    b083        ..      SUB      sp,sp,#0xc
        0x08004a90:    f7fdfe3e    ..>.    BL       Harware_GetCurrentAB ; 0x8002710
        0x08004a94:    4d56        VM      LDR      r5,[pc,#344] ; [0x8004bf0] = 0x20000098
        0x08004a96:    6828        (h      LDR      r0,[r5,#0]
        0x08004a98:    ed800a0f    ....    VSTR     s0,[r0,#0x3c]
        0x08004a9c:    edc00a10    ....    VSTR     s1,[r0,#0x40]
        0x08004aa0:    f7fdfc72    ..r.    BL       Hardware_GetPhaseVoltage ; 0x8002388
        0x08004aa4:    682c        ,h      LDR      r4,[r5,#0]
        0x08004aa6:    ed940a01    ....    VLDR     s0,[r4,#4]
        0x08004aaa:    ed941a02    ....    VLDR     s2,[r4,#8]
        0x08004aae:    edd40a03    ....    VLDR     s1,[r4,#0xc]
        0x08004ab2:    ee701a01    p...    VADD.F32 s3,s0,s2
        0x08004ab6:    ee711aa0    q...    VADD.F32 s3,s3,s1
        0x08004aba:    ed9f2a4e    ..N*    VLDR     s4,[pc,#312] ; [0x8004bf4] = 0x3eaaaaab
        0x08004abe:    f1040010    ....    ADD      r0,r4,#0x10
        0x08004ac2:    ee611a82    a...    VMUL.F32 s3,s3,s4
        0x08004ac6:    ee300a61    0.a.    VSUB.F32 s0,s0,s3
        0x08004aca:    ed840a04    ....    VSTR     s0,[r4,#0x10]
        0x08004ace:    ee310a61    1.a.    VSUB.F32 s0,s2,s3
        0x08004ad2:    ed840a05    ....    VSTR     s0,[r4,#0x14]
        0x08004ad6:    ee300ae1    0...    VSUB.F32 s0,s1,s3
        0x08004ada:    ed840a06    ....    VSTR     s0,[r4,#0x18]
        0x08004ade:    f7fbfcf7    ....    BL       Abc_AlphaBeta_Trans ; 0x80004d0
        0x08004ae2:    ed8d0a00    ....    VSTR     s0,[sp,#0]
        0x08004ae6:    edcd0a01    ....    VSTR     s1,[sp,#4]
        0x08004aea:    6828        (h      LDR      r0,[r5,#0]
        0x08004aec:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08004af0:    4668        hF      MOV      r0,sp
        0x08004af2:    f7fbfd37    ..7.    BL       AlphaBeta_Dq_Trans ; 0x8000564
        0x08004af6:    4840        @H      LDR      r0,[pc,#256] ; [0x8004bf8] = 0x20000060
        0x08004af8:    ed840a07    ....    VSTR     s0,[r4,#0x1c]
        0x08004afc:    edc40a08    ....    VSTR     s1,[r4,#0x20]
        0x08004b00:    6800        .h      LDR      r0,[r0,#0]
        0x08004b02:    f9901008    ....    LDRSB    r1,[r0,#8]
        0x08004b06:    2904        .)      CMP      r1,#4
        0x08004b08:    d006        ..      BEQ      0x8004b18 ; PerformanceCriticalTask + 140
        0x08004b0a:    2902        .)      CMP      r1,#2
        0x08004b0c:    bf04        ..      ITT      EQ
        0x08004b0e:    f8901020    .. .    LDRBEQ   r1,[r0,#0x20]
        0x08004b12:    2900        .)      CMPEQ    r1,#0
        0x08004b14:    d04b        K.      BEQ      0x8004bae ; PerformanceCriticalTask + 290
        0x08004b16:    e066        f.      B        0x8004be6 ; PerformanceCriticalTask + 346
        0x08004b18:    6829        )h      LDR      r1,[r5,#0]
        0x08004b1a:    ed910a0f    ....    VLDR     s0,[r1,#0x3c]
        0x08004b1e:    edd10a0d    ....    VLDR     s1,[r1,#0x34]
        0x08004b22:    ee300a60    0.`.    VSUB.F32 s0,s0,s1
        0x08004b26:    ed810a0f    ....    VSTR     s0,[r1,#0x3c]
        0x08004b2a:    ed910a10    ....    VLDR     s0,[r1,#0x40]
        0x08004b2e:    edd10a0e    ....    VLDR     s1,[r1,#0x38]
        0x08004b32:    ee300a60    0.`.    VSUB.F32 s0,s0,s1
        0x08004b36:    ed810a10    ....    VSTR     s0,[r1,#0x40]
        0x08004b3a:    7c00        .|      LDRB     r0,[r0,#0x10]
        0x08004b3c:    2809        .(      CMP      r0,#9
        0x08004b3e:    d21d        ..      BCS      0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b40:    e8dff000    ....    TBB      [pc,r0]
    $d
        0x08004b44:    0b081c05    ....    DCD    185080837
        0x08004b48:    1714110e    ....    DCD    387191054
        0x08004b4c:    001a        ..      DCW    26
    $t
        0x08004b4e:    f7fcfa6b    ..k.    BL       FOC_Method_IncABZ ; 0x8001028
        0x08004b52:    e013        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b54:    f7fcfd50    ..P.    BL       FOC_Method_ParIdentify ; 0x80015f8
        0x08004b58:    e010        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b5a:    f7fcfb6b    ..k.    BL       FOC_Method_NonlinearFlux ; 0x8001234
        0x08004b5e:    e00d        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b60:    f7fcfc18    ....    BL       FOC_Method_NonlinearFlux_Debug ; 0x8001394
        0x08004b64:    e00a        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b66:    f7fbffb9    ....    BL       FOC_Method_IF_Luenberger ; 0x8000adc
        0x08004b6a:    e007        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b6c:    f7fcf8fe    ....    BL       FOC_Method_IF_Luenberger_Debug ; 0x8000d6c
        0x08004b70:    e004        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b72:    f7fbfdad    ....    BL       FOC_Method_HFPI_WithoutNS ; 0x80006d0
        0x08004b76:    e001        ..      B        0x8004b7c ; PerformanceCriticalTask + 240
        0x08004b78:    f7fbfeca    ....    BL       FOC_Method_HFSI_WithoutNS ; 0x8000910
        0x08004b7c:    6828        (h      LDR      r0,[r5,#0]
        0x08004b7e:    4c1f        .L      LDR      r4,[pc,#124] ; [0x8004bfc] = 0x2000008c
        0x08004b80:    f1000124    ..$.    ADD      r1,r0,#0x24
        0x08004b84:    6820         h      LDR      r0,[r4,#0]
        0x08004b86:    3008        .0      ADDS     r0,r0,#8
        0x08004b88:    f7fbfd6d    ..m.    BL       Dq_AlphaBeta_Trans ; 0x8000666
        0x08004b8c:    6820         h      LDR      r0,[r4,#0]
        0x08004b8e:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x08004b92:    edc00a05    ....    VSTR     s1,[r0,#0x14]
        0x08004b96:    6829        )h      LDR      r1,[r5,#0]
        0x08004b98:    ed910a0b    ....    VLDR     s0,[r1,#0x2c]
        0x08004b9c:    f000f954    ..T.    BL       SectorCalModeSvpwm ; 0x8004e48
        0x08004ba0:    6820         h      LDR      r0,[r4,#0]
        0x08004ba2:    8c82        ..      LDRH     r2,[r0,#0x24]
        0x08004ba4:    8c41        A.      LDRH     r1,[r0,#0x22]
        0x08004ba6:    8c00        ..      LDRH     r0,[r0,#0x20]
        0x08004ba8:    f7fdfd58    ..X.    BL       Hardware_SetCCR ; 0x800265c
        0x08004bac:    e01b        ..      B        0x8004be6 ; PerformanceCriticalTask + 346
        0x08004bae:    6841        Ah      LDR      r1,[r0,#4]
        0x08004bb0:    1c49        I.      ADDS     r1,r1,#1
        0x08004bb2:    6041        A`      STR      r1,[r0,#4]
        0x08004bb4:    2965        e)      CMP      r1,#0x65
        0x08004bb6:    d011        ..      BEQ      0x8004bdc ; PerformanceCriticalTask + 336
        0x08004bb8:    682a        *h      LDR      r2,[r5,#0]
        0x08004bba:    4b11        .K      LDR      r3,[pc,#68] ; [0x8004c00] = 0x200002f4
        0x08004bbc:    ed920a0f    ....    VLDR     s0,[r2,#0x3c]
        0x08004bc0:    eb030181    ....    ADD      r1,r3,r1,LSL #2
        0x08004bc4:    ed810a00    ....    VSTR     s0,[r1,#0]
        0x08004bc8:    6840        @h      LDR      r0,[r0,#4]
        0x08004bca:    f50371c8    ...q    ADD      r1,r3,#0x190
        0x08004bce:    ed920a10    ....    VLDR     s0,[r2,#0x40]
        0x08004bd2:    eb010080    ....    ADD      r0,r1,r0,LSL #2
        0x08004bd6:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08004bda:    e004        ..      B        0x8004be6 ; PerformanceCriticalTask + 346
        0x08004bdc:    2100        .!      MOVS     r1,#0
        0x08004bde:    6041        A`      STR      r1,[r0,#4]
        0x08004be0:    2101        .!      MOVS     r1,#1
        0x08004be2:    f8801020    .. .    STRB     r1,[r0,#0x20]
        0x08004be6:    b003        ..      ADD      sp,sp,#0xc
        0x08004be8:    e8bd4030    ..0@    POP      {r4,r5,lr}
        0x08004bec:    f7fdbc54    ..T.    B        Hardware_PerformanceTaskEvent ; 0x8002498
    $d
        0x08004bf0:    20000098    ...     DCD    536871064
        0x08004bf4:    3eaaaaab    ...>    DCD    1051372203
        0x08004bf8:    20000060    `..     DCD    536871008
        0x08004bfc:    2000008c    ...     DCD    536871052
        0x08004c00:    200002f4    ...     DCD    536871668
    $t
    i.RCC_GetSystemClockFreq
    RCC_GetSystemClockFreq
        0x08004c04:    4915        .I      LDR      r1,[pc,#84] ; [0x8004c5c] = 0x40021000
        0x08004c06:    6888        .h      LDR      r0,[r1,#8]
        0x08004c08:    f000030c    ....    AND      r3,r0,#0xc
        0x08004c0c:    4814        .H      LDR      r0,[pc,#80] ; [0x8004c60] = 0xf42400
        0x08004c0e:    2b04        .+      CMP      r3,#4
        0x08004c10:    bf08        ..      IT       EQ
        0x08004c12:    4770        pG      BXEQ     lr
        0x08004c14:    4a13        .J      LDR      r2,[pc,#76] ; [0x8004c64] = 0x7a1200
        0x08004c16:    2b08        .+      CMP      r3,#8
        0x08004c18:    bf04        ..      ITT      EQ
        0x08004c1a:    4610        .F      MOVEQ    r0,r2
        0x08004c1c:    4770        pG      BXEQ     lr
        0x08004c1e:    2b0c        .+      CMP      r3,#0xc
        0x08004c20:    bf18        ..      IT       NE
        0x08004c22:    4770        pG      BXNE     lr
        0x08004c24:    68cb        .h      LDR      r3,[r1,#0xc]
        0x08004c26:    f0030303    ....    AND      r3,r3,#3
        0x08004c2a:    2b02        .+      CMP      r3,#2
        0x08004c2c:    d002        ..      BEQ      0x8004c34 ; RCC_GetSystemClockFreq + 48
        0x08004c2e:    2b03        .+      CMP      r3,#3
        0x08004c30:    bf08        ..      IT       EQ
        0x08004c32:    4610        .F      MOVEQ    r0,r2
        0x08004c34:    68ca        .h      LDR      r2,[r1,#0xc]
        0x08004c36:    f3c22206    ..."    UBFX     r2,r2,#8,#7
        0x08004c3a:    4342        BC      MULS     r2,r0,r2
        0x08004c3c:    68c8        .h      LDR      r0,[r1,#0xc]
        0x08004c3e:    2301        .#      MOVS     r3,#1
        0x08004c40:    f00000f0    ....    AND      r0,r0,#0xf0
        0x08004c44:    eb031010    ....    ADD      r0,r3,r0,LSR #4
        0x08004c48:    fbb2f0f0    ....    UDIV     r0,r2,r0
        0x08004c4c:    68c9        .h      LDR      r1,[r1,#0xc]
        0x08004c4e:    f3c16141    ..Aa    UBFX     r1,r1,#25,#2
        0x08004c52:    1c49        I.      ADDS     r1,r1,#1
        0x08004c54:    0049        I.      LSLS     r1,r1,#1
        0x08004c56:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08004c5a:    4770        pG      BX       lr
    $d
        0x08004c5c:    40021000    ...@    DCD    1073876992
        0x08004c60:    00f42400    .$..    DCD    16000000
        0x08004c64:    007a1200    ..z.    DCD    8000000
    $t
    i.SEGGER_RTT_Init
    SEGGER_RTT_Init
        0x08004c68:    f002b8f0    ....    B.W      _DoInit ; 0x8006e4c
    i.SVC_Handler
    SVC_Handler
        0x08004c6c:    4770        pG      BX       lr
        0x08004c6e:    0000        ..      MOVS     r0,r0
    i.SafetyTask
    SafetyTask
        0x08004c70:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x08004c74:    4c69        iL      LDR      r4,[pc,#420] ; [0x8004e1c] = 0x20000060
        0x08004c76:    f8dfa1a8    ....    LDR      r10,[pc,#424] ; [0x8004e20] = 0x20000614
        0x08004c7a:    2500        .%      MOVS     r5,#0
        0x08004c7c:    ed2d8b02    -...    VPUSH    {d8}
        0x08004c80:    f04f0802    O...    MOV      r8,#2
        0x08004c84:    6820         h      LDR      r0,[r4,#0]
        0x08004c86:    4f67        gO      LDR      r7,[pc,#412] ; [0x8004e24] = 0x20000050
        0x08004c88:    4e67        gN      LDR      r6,[pc,#412] ; [0x8004e28] = 0x20000098
        0x08004c8a:    f9901008    ....    LDRSB    r1,[r0,#8]
        0x08004c8e:    f04f0901    O...    MOV      r9,#1
        0x08004c92:    1c49        I.      ADDS     r1,r1,#1
        0x08004c94:    2905        .)      CMP      r1,#5
        0x08004c96:    d26a        j.      BCS      0x8004d6e ; SafetyTask + 254
        0x08004c98:    e8dff001    ....    TBB      [pc,r1]
    $d
        0x08004c9c:    49330a03    ..3I    DCD    1228081667
        0x08004ca0:    0060        `.      DCW    96
    $t
        0x08004ca2:    f7fdfd0f    ....    BL       Hardware_StopPWM ; 0x80026c4
        0x08004ca6:    f003fc89    ....    BL       reset_All ; 0x80085bc
        0x08004caa:    6820         h      LDR      r0,[r4,#0]
        0x08004cac:    7205        .r      STRB     r5,[r0,#8]
        0x08004cae:    e0a7        ..      B        0x8004e00 ; SafetyTask + 400
        0x08004cb0:    f7fdfb2a    ..*.    BL       Hardware_GetBusVoltage ; 0x8002308
        0x08004cb4:    e9d70102    ....    LDRD     r0,r1,[r7,#8]
        0x08004cb8:    eeb08a40    ..@.    VMOV.F32 s16,s0
        0x08004cbc:    220a        ."      MOVS     r2,#0xa
        0x08004cbe:    2300        .#      MOVS     r3,#0
        0x08004cc0:    f7fbfb1a    ....    BL       __aeabi_uldivmod ; 0x80002f8
        0x08004cc4:    eb0a0082    ....    ADD      r0,r10,r2,LSL #2
        0x08004cc8:    210a        .!      MOVS     r1,#0xa
        0x08004cca:    ed808a00    ....    VSTR     s16,[r0,#0]
        0x08004cce:    4854        TH      LDR      r0,[pc,#336] ; [0x8004e20] = 0x20000614
        0x08004cd0:    f7fff9da    ....    BL       MedianFilter ; 0x8004088
        0x08004cd4:    6830        0h      LDR      r0,[r6,#0]
        0x08004cd6:    4955        UI      LDR      r1,[pc,#340] ; [0x8004e2c] = 0xbe0b3332
        0x08004cd8:    ed800a0b    ....    VSTR     s0,[r0,#0x2c]
        0x08004cdc:    ee100a10    ....    VMOV     r0,s0
        0x08004ce0:    4408        .D      ADD      r0,r0,r1
        0x08004ce2:    4953        SI      LDR      r1,[pc,#332] ; [0x8004e30] = 0x30cccb
        0x08004ce4:    4281        .B      CMP      r1,r0
        0x08004ce6:    6820         h      LDR      r0,[r4,#0]
        0x08004ce8:    bf98        ..      IT       LS
        0x08004cea:    6005        .`      STRLS    r5,[r0,#0]
        0x08004cec:    d93f        ?.      BLS      0x8004d6e ; SafetyTask + 254
        0x08004cee:    6801        .h      LDR      r1,[r0,#0]
        0x08004cf0:    1c4a        J.      ADDS     r2,r1,#1
        0x08004cf2:    6002        .`      STR      r2,[r0,#0]
        0x08004cf4:    2932        2)      CMP      r1,#0x32
        0x08004cf6:    bf84        ..      ITT      HI
        0x08004cf8:    6005        .`      STRHI    r5,[r0,#0]
        0x08004cfa:    f8809008    ....    STRBHI   r9,[r0,#8]
        0x08004cfe:    d936        6.      BLS      0x8004d6e ; SafetyTask + 254
        0x08004d00:    e07e        ~.      B        0x8004e00 ; SafetyTask + 400
        0x08004d02:    6801        .h      LDR      r1,[r0,#0]
        0x08004d04:    1c4a        J.      ADDS     r2,r1,#1
        0x08004d06:    6002        .`      STR      r2,[r0,#0]
        0x08004d08:    2932        2)      CMP      r1,#0x32
        0x08004d0a:    d904        ..      BLS      0x8004d16 ; SafetyTask + 166
        0x08004d0c:    6045        E`      STR      r5,[r0,#4]
        0x08004d0e:    6005        .`      STR      r5,[r0,#0]
        0x08004d10:    f8808008    ....    STRB     r8,[r0,#8]
        0x08004d14:    e074        t.      B        0x8004e00 ; SafetyTask + 400
        0x08004d16:    2a2d        -*      CMP      r2,#0x2d
        0x08004d18:    d972        r.      BLS      0x8004e00 ; SafetyTask + 400
        0x08004d1a:    4846        FH      LDR      r0,[pc,#280] ; [0x8004e34] = 0x2000008c
        0x08004d1c:    6800        .h      LDR      r0,[r0,#0]
        0x08004d1e:    69c0        .i      LDR      r0,[r0,#0x1c]
        0x08004d20:    4602        .F      MOV      r2,r0
        0x08004d22:    4611        .F      MOV      r1,r2
        0x08004d24:    f7fdfc9a    ....    BL       Hardware_SetCCR ; 0x800265c
        0x08004d28:    f7fdfca6    ....    BL       Hardware_StartPWM ; 0x8002678
        0x08004d2c:    e01f        ..      B        0x8004d6e ; SafetyTask + 254
        0x08004d2e:    f8900020    .. .    LDRB     r0,[r0,#0x20]
        0x08004d32:    2800        .(      CMP      r0,#0
        0x08004d34:    d064        d.      BEQ      0x8004e00 ; SafetyTask + 400
        0x08004d36:    2164        d!      MOVS     r1,#0x64
        0x08004d38:    483f        ?H      LDR      r0,[pc,#252] ; [0x8004e38] = 0x200002f4
        0x08004d3a:    f7fff9a5    ....    BL       MedianFilter ; 0x8004088
        0x08004d3e:    6830        0h      LDR      r0,[r6,#0]
        0x08004d40:    2164        d!      MOVS     r1,#0x64
        0x08004d42:    ed800a0d    ....    VSTR     s0,[r0,#0x34]
        0x08004d46:    483d        =H      LDR      r0,[pc,#244] ; [0x8004e3c] = 0x20000484
        0x08004d48:    f7fff99e    ....    BL       MedianFilter ; 0x8004088
        0x08004d4c:    6830        0h      LDR      r0,[r6,#0]
        0x08004d4e:    2103        .!      MOVS     r1,#3
        0x08004d50:    ed800a0e    ....    VSTR     s0,[r0,#0x38]
        0x08004d54:    6820         h      LDR      r0,[r4,#0]
        0x08004d56:    6005        .`      STR      r5,[r0,#0]
        0x08004d58:    7201        .r      STRB     r1,[r0,#8]
        0x08004d5a:    e051        Q.      B        0x8004e00 ; SafetyTask + 400
        0x08004d5c:    f7fdfb80    ....    BL       Hardware_MCStartOrStop ; 0x8002460
        0x08004d60:    b128        (.      CBZ      r0,0x8004d6e ; SafetyTask + 254
        0x08004d62:    f7fdfc89    ....    BL       Hardware_StartPWM ; 0x8002678
        0x08004d66:    6821        !h      LDR      r1,[r4,#0]
        0x08004d68:    2004        .       MOVS     r0,#4
        0x08004d6a:    7208        .r      STRB     r0,[r1,#8]
        0x08004d6c:    e003        ..      B        0x8004d76 ; SafetyTask + 262
        0x08004d6e:    6820         h      LDR      r0,[r4,#0]
        0x08004d70:    7a00        .z      LDRB     r0,[r0,#8]
        0x08004d72:    2804        .(      CMP      r0,#4
        0x08004d74:    d144        D.      BNE      0x8004e00 ; SafetyTask + 400
        0x08004d76:    f7fdfb73    ..s.    BL       Hardware_MCStartOrStop ; 0x8002460
        0x08004d7a:    f04f3bff    O..;    MOV      r11,#0xffffffff
        0x08004d7e:    2800        .(      CMP      r0,#0
        0x08004d80:    bf04        ..      ITT      EQ
        0x08004d82:    6820         h      LDREQ    r0,[r4,#0]
        0x08004d84:    f880b008    ....    STRBEQ   r11,[r0,#8]
        0x08004d88:    f7fdfabe    ....    BL       Hardware_GetBusVoltage ; 0x8002308
        0x08004d8c:    e9d70102    ....    LDRD     r0,r1,[r7,#8]
        0x08004d90:    eeb08a40    ..@.    VMOV.F32 s16,s0
        0x08004d94:    220a        ."      MOVS     r2,#0xa
        0x08004d96:    2300        .#      MOVS     r3,#0
        0x08004d98:    f7fbfaae    ....    BL       __aeabi_uldivmod ; 0x80002f8
        0x08004d9c:    eb0a0082    ....    ADD      r0,r10,r2,LSL #2
        0x08004da0:    210a        .!      MOVS     r1,#0xa
        0x08004da2:    ed808a00    ....    VSTR     s16,[r0,#0]
        0x08004da6:    481e        .H      LDR      r0,[pc,#120] ; [0x8004e20] = 0x20000614
        0x08004da8:    f7fff96e    ..n.    BL       MedianFilter ; 0x8004088
        0x08004dac:    6830        0h      LDR      r0,[r6,#0]
        0x08004dae:    4924        $I      LDR      r1,[pc,#144] ; [0x8004e40] = 0x41f4cccd
        0x08004db0:    ed800a0b    ....    VSTR     s0,[r0,#0x2c]
        0x08004db4:    ee100a10    ....    VMOV     r0,s0
        0x08004db8:    4288        .B      CMP      r0,r1
        0x08004dba:    da0c        ..      BGE      0x8004dd6 ; SafetyTask + 358
        0x08004dbc:    6820         h      LDR      r0,[r4,#0]
        0x08004dbe:    6801        .h      LDR      r1,[r0,#0]
        0x08004dc0:    1c4a        J.      ADDS     r2,r1,#1
        0x08004dc2:    6002        .`      STR      r2,[r0,#0]
        0x08004dc4:    298c        .)      CMP      r1,#0x8c
        0x08004dc6:    d91b        ..      BLS      0x8004e00 ; SafetyTask + 400
        0x08004dc8:    f7fdfc7c    ..|.    BL       Hardware_StopPWM ; 0x80026c4
        0x08004dcc:    6820         h      LDR      r0,[r4,#0]
        0x08004dce:    6005        .`      STR      r5,[r0,#0]
        0x08004dd0:    f8808009    ....    STRB     r8,[r0,#9]
        0x08004dd4:    e012        ..      B        0x8004dfc ; SafetyTask + 396
        0x08004dd6:    ee100a10    ....    VMOV     r0,s0
        0x08004dda:    491a        .I      LDR      r1,[pc,#104] ; [0x8004e44] = 0x42666667
        0x08004ddc:    4288        .B      CMP      r0,r1
