ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08004dde:    6820         h      LDR      r0,[r4,#0]
        0x08004de0:    bfd8        ..      IT       LE
        0x08004de2:    6005        .`      STRLE    r5,[r0,#0]
        0x08004de4:    dd0c        ..      BLE      0x8004e00 ; SafetyTask + 400
        0x08004de6:    6801        .h      LDR      r1,[r0,#0]
        0x08004de8:    1c4a        J.      ADDS     r2,r1,#1
        0x08004dea:    6002        .`      STR      r2,[r0,#0]
        0x08004dec:    298c        .)      CMP      r1,#0x8c
        0x08004dee:    d907        ..      BLS      0x8004e00 ; SafetyTask + 400
        0x08004df0:    f7fdfc68    ..h.    BL       Hardware_StopPWM ; 0x80026c4
        0x08004df4:    6820         h      LDR      r0,[r4,#0]
        0x08004df6:    6005        .`      STR      r5,[r0,#0]
        0x08004df8:    f8809009    ....    STRB     r9,[r0,#9]
        0x08004dfc:    f880b008    ....    STRB     r11,[r0,#8]
        0x08004e00:    e9d70102    ....    LDRD     r0,r1,[r7,#8]
        0x08004e04:    1c40        @.      ADDS     r0,r0,#1
        0x08004e06:    f1410100    A...    ADC      r1,r1,#0
        0x08004e0a:    e9c70102    ....    STRD     r0,r1,[r7,#8]
        0x08004e0e:    ecbd8b02    ....    VPOP     {d8}
        0x08004e12:    e8bd5ff0    ..._    POP      {r4-r12,lr}
        0x08004e16:    f7fdbb61    ..a.    B        Hardware_SafatyTaskEvent ; 0x80024dc
    $d
        0x08004e1a:    0000        ..      DCW    0
        0x08004e1c:    20000060    `..     DCD    536871008
        0x08004e20:    20000614    ...     DCD    536872468
        0x08004e24:    20000050    P..     DCD    536870992
        0x08004e28:    20000098    ...     DCD    536871064
        0x08004e2c:    be0b3332    23..    DCD    3188405042
        0x08004e30:    0030cccb    ..0.    DCD    3198155
        0x08004e34:    2000008c    ...     DCD    536871052
        0x08004e38:    200002f4    ...     DCD    536871668
        0x08004e3c:    20000484    ...     DCD    536872068
        0x08004e40:    41f4cccd    ...A    DCD    1106562253
        0x08004e44:    42666667    gffB    DCD    1114007143
    $t
    i.SectorCalModeSvpwm
    SectorCalModeSvpwm
        0x08004e48:    4988        .I      LDR      r1,[pc,#544] ; [0x800506c] = 0x20000060
        0x08004e4a:    ed902a04    ...*    VLDR     s4,[r0,#0x10]
        0x08004e4e:    edd00a05    ....    VLDR     s1,[r0,#0x14]
        0x08004e52:    6809        .h      LDR      r1,[r1,#0]
        0x08004e54:    edd12a06    ...*    VLDR     s5,[r1,#0x18]
        0x08004e58:    2100        .!      MOVS     r1,#0
        0x08004e5a:    ed9f1a85    ....    VLDR     s2,[pc,#532] ; [0x8005070] = 0x3f5db3d7
        0x08004e5e:    eeb63a00    ...:    VMOV.F32 s6,#0.50000000
        0x08004e62:    ee221a01    "...    VMUL.F32 s2,s4,s2
        0x08004e66:    eef01a41    ..A.    VMOV.F32 s3,s2
        0x08004e6a:    ee001ac3    ....    VMLS.F32 s2,s1,s6
        0x08004e6e:    eeb04a41    ..AJ    VMOV.F32 s8,s2
        0x08004e72:    ed9f1a80    ....    VLDR     s2,[pc,#512] ; [0x8005074] = 0xbf5db3d7
        0x08004e76:    ee222a01    "..*    VMUL.F32 s4,s4,s2
        0x08004e7a:    eef03a42    ..B:    VMOV.F32 s7,s4
        0x08004e7e:    ee002ac3    ...*    VMLS.F32 s4,s1,s6
        0x08004e82:    ed9f1a7d    ..}.    VLDR     s2,[pc,#500] ; [0x8005078] = 0x3fddb3d7
        0x08004e86:    eef50ac0    ....    VCMPE.F32 s1,#0.0
        0x08004e8a:    2201        ."      MOVS     r2,#1
        0x08004e8c:    ee624a81    b..J    VMUL.F32 s9,s5,s2
        0x08004e90:    ee841a80    ....    VDIV.F32 s2,s9,s0
        0x08004e94:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08004e98:    bfc8        ..      IT       GT
        0x08004e9a:    2101        .!      MOVGT    r1,#1
        0x08004e9c:    eeb00a44    ..D.    VMOV.F32 s0,s8
        0x08004ea0:    eeb50ac0    ....    VCMPE.F32 s0,#0.0
        0x08004ea4:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08004ea8:    bfc8        ..      IT       GT
        0x08004eaa:    1c89        ..      ADDGT    r1,r1,#2
        0x08004eac:    eeb52ac0    ...*    VCMPE.F32 s4,#0.0
        0x08004eb0:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08004eb4:    bfc8        ..      IT       GT
        0x08004eb6:    1d09        ..      ADDGT    r1,r1,#4
        0x08004eb8:    eeb52a00    ...*    VMOV.F32 s4,#0.25000000
        0x08004ebc:    2907        .)      CMP      r1,#7
        0x08004ebe:    d27c        |.      BCS      0x8004fba ; SectorCalModeSvpwm + 370
        0x08004ec0:    e8dff001    ....    TBB      [pc,r1]
    $d
        0x08004ec4:    341e049b    ...4    DCD    874382491
        0x08004ec8:    007f6349    Ic..    DCD    8348489
    $t
        0x08004ecc:    ee403a83    @..:    VMLA.F32 s7,s1,s6
        0x08004ed0:    ee401a83    @...    VMLA.F32 s3,s1,s6
        0x08004ed4:    2102        .!      MOVS     r1,#2
        0x08004ed6:    f8801026    ..&.    STRB     r1,[r0,#0x26]
        0x08004eda:    ee230a81    #...    VMUL.F32 s0,s7,s2
        0x08004ede:    ee211a81    !...    VMUL.F32 s2,s3,s2
        0x08004ee2:    ee721ac0    r...    VSUB.F32 s3,s5,s0
        0x08004ee6:    ee320a80    2...    VADD.F32 s0,s5,s0
        0x08004eea:    ee710a81    q...    VADD.F32 s1,s3,s2
        0x08004eee:    ee300a01    0...    VADD.F32 s0,s0,s2
        0x08004ef2:    ee311ac1    1...    VSUB.F32 s2,s3,s2
        0x08004ef6:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x08004efa:    ee200a02     ...    VMUL.F32 s0,s0,s4
        0x08004efe:    e041        A.      B        0x8004f84 ; SectorCalModeSvpwm + 316
        0x08004f00:    ee401a83    @...    VMLA.F32 s3,s1,s6
        0x08004f04:    2106        .!      MOVS     r1,#6
        0x08004f06:    f8801026    ..&.    STRB     r1,[r0,#0x26]
        0x08004f0a:    ee210a81    !...    VMUL.F32 s0,s3,s2
        0x08004f0e:    ee211a60    !.`.    VNMUL.F32 s2,s2,s1
        0x08004f12:    ee720a80    r...    VADD.F32 s1,s5,s0
        0x08004f16:    ee721ac0    r...    VSUB.F32 s3,s5,s0
        0x08004f1a:    ee700a81    p...    VADD.F32 s1,s1,s2
        0x08004f1e:    ee310ac1    1...    VSUB.F32 s0,s3,s2
        0x08004f22:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x08004f26:    ee200a02     ...    VMUL.F32 s0,s0,s4
        0x08004f2a:    e029        ).      B        0x8004f80 ; SectorCalModeSvpwm + 312
        0x08004f2c:    ee240a01    $...    VMUL.F32 s0,s8,s2
        0x08004f30:    ee211a20    !. .    VMUL.F32 s2,s2,s1
        0x08004f34:    f8802026    ..&     STRB     r2,[r0,#0x26]
        0x08004f38:    ee720a80    r...    VADD.F32 s1,s5,s0
        0x08004f3c:    ee721ac0    r...    VSUB.F32 s3,s5,s0
        0x08004f40:    ee700a81    p...    VADD.F32 s1,s1,s2
        0x08004f44:    ee310a81    1...    VADD.F32 s0,s3,s2
        0x08004f48:    ee311ac1    1...    VSUB.F32 s2,s3,s2
        0x08004f4c:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x08004f50:    ee200a02     ...    VMUL.F32 s0,s0,s4
        0x08004f54:    e016        ..      B        0x8004f84 ; SectorCalModeSvpwm + 316
        0x08004f56:    ee403a83    @..:    VMLA.F32 s7,s1,s6
        0x08004f5a:    ee611a60    a.`.    VNMUL.F32 s3,s2,s1
        0x08004f5e:    2104        .!      MOVS     r1,#4
        0x08004f60:    f8801026    ..&.    STRB     r1,[r0,#0x26]
        0x08004f64:    ee320ae1    2...    VSUB.F32 s0,s5,s3
        0x08004f68:    ee231a81    #...    VMUL.F32 s2,s7,s2
        0x08004f6c:    ee721aa1    r...    VADD.F32 s3,s5,s3
        0x08004f70:    ee700a41    p.A.    VSUB.F32 s1,s0,s2
        0x08004f74:    ee300a01    0...    VADD.F32 s0,s0,s2
        0x08004f78:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x08004f7c:    ee200a02     ...    VMUL.F32 s0,s0,s4
        0x08004f80:    ee311a81    1...    VADD.F32 s2,s3,s2
        0x08004f84:    ee211a02    !...    VMUL.F32 s2,s2,s4
        0x08004f88:    e03d        =.      B        0x8005006 ; SectorCalModeSvpwm + 446
        0x08004f8a:    ee401a83    @...    VMLA.F32 s3,s1,s6
        0x08004f8e:    ee210a20    !. .    VMUL.F32 s0,s2,s1
        0x08004f92:    2103        .!      MOVS     r1,#3
        0x08004f94:    f8801026    ..&.    STRB     r1,[r0,#0x26]
        0x08004f98:    ee211a61    !.a.    VNMUL.F32 s2,s2,s3
        0x08004f9c:    ee721ac0    r...    VSUB.F32 s3,s5,s0
        0x08004fa0:    ee320a80    2...    VADD.F32 s0,s5,s0
        0x08004fa4:    ee710ac1    q...    VSUB.F32 s1,s3,s2
        0x08004fa8:    ee300a01    0...    VADD.F32 s0,s0,s2
        0x08004fac:    ee311a81    1...    VADD.F32 s2,s3,s2
        0x08004fb0:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x08004fb4:    ee200a02     ...    VMUL.F32 s0,s0,s4
        0x08004fb8:    e000        ..      B        0x8004fbc ; SectorCalModeSvpwm + 372
        0x08004fba:    e01e        ..      B        0x8004ffa ; SectorCalModeSvpwm + 434
        0x08004fbc:    ee211a02    !...    VMUL.F32 s2,s2,s4
        0x08004fc0:    e021        !.      B        0x8005006 ; SectorCalModeSvpwm + 446
        0x08004fc2:    ee401a83    @...    VMLA.F32 s3,s1,s6
        0x08004fc6:    ee403a83    @..:    VMLA.F32 s7,s1,s6
        0x08004fca:    2105        .!      MOVS     r1,#5
        0x08004fcc:    f8801026    ..&.    STRB     r1,[r0,#0x26]
        0x08004fd0:    ee611a61    a.a.    VNMUL.F32 s3,s2,s3
        0x08004fd4:    ee211a63    !.c.    VNMUL.F32 s2,s2,s7
        0x08004fd8:    ee320ae1    2...    VSUB.F32 s0,s5,s3
        0x08004fdc:    ee721aa1    r...    VADD.F32 s3,s5,s3
        0x08004fe0:    ee700a01    p...    VADD.F32 s1,s0,s2
        0x08004fe4:    ee300a41    0.A.    VSUB.F32 s0,s0,s2
        0x08004fe8:    ee311a81    1...    VADD.F32 s2,s3,s2
        0x08004fec:    ee600a82    `...    VMUL.F32 s1,s1,s4
        0x08004ff0:    ee200a02     ...    VMUL.F32 s0,s0,s4
        0x08004ff4:    ee211a02    !...    VMUL.F32 s2,s2,s4
        0x08004ff8:    e005        ..      B        0x8005006 ; SectorCalModeSvpwm + 446
        0x08004ffa:    ee220a82    "...    VMUL.F32 s0,s5,s4
        0x08004ffe:    eef00a40    ..@.    VMOV.F32 s1,s0
        0x08005002:    eeb01a40    ..@.    VMOV.F32 s2,s0
        0x08005006:    edd01a06    ....    VLDR     s3,[r0,#0x18]
        0x0800500a:    ee210a80    !...    VMUL.F32 s0,s3,s0
        0x0800500e:    ee610aa0    a...    VMUL.F32 s1,s3,s1
        0x08005012:    eebd0ac0    ....    VCVT.S32.F32 s0,s0
        0x08005016:    eefd0ae0    ....    VCVT.S32.F32 s1,s1
        0x0800501a:    ee102a10    ...*    VMOV     r2,s0
        0x0800501e:    ee210a81    !...    VMUL.F32 s0,s3,s2
        0x08005022:    ee103a90    ...:    VMOV     r3,s1
        0x08005026:    eebd0ac0    ....    VCVT.S32.F32 s0,s0
        0x0800502a:    2b00        .+      CMP      r3,#0
        0x0800502c:    ee101a10    ....    VMOV     r1,s0
        0x08005030:    bfb8        ..      IT       LT
        0x08005032:    2300        .#      MOVLT    r3,#0
        0x08005034:    db04        ..      BLT      0x8005040 ; SectorCalModeSvpwm + 504
        0x08005036:    f8d0c01c    ....    LDR      r12,[r0,#0x1c]
        0x0800503a:    459c        .E      CMP      r12,r3
        0x0800503c:    bf38        8.      IT       CC
        0x0800503e:    4663        cF      MOVCC    r3,r12
        0x08005040:    2a00        .*      CMP      r2,#0
        0x08005042:    bfb8        ..      IT       LT
        0x08005044:    2200        ."      MOVLT    r2,#0
        0x08005046:    db04        ..      BLT      0x8005052 ; SectorCalModeSvpwm + 522
        0x08005048:    f8d0c01c    ....    LDR      r12,[r0,#0x1c]
        0x0800504c:    4594        .E      CMP      r12,r2
        0x0800504e:    bf38        8.      IT       CC
        0x08005050:    4662        bF      MOVCC    r2,r12
        0x08005052:    2900        .)      CMP      r1,#0
        0x08005054:    bfb8        ..      IT       LT
        0x08005056:    2100        .!      MOVLT    r1,#0
        0x08005058:    db04        ..      BLT      0x8005064 ; SectorCalModeSvpwm + 540
        0x0800505a:    f8d0c01c    ....    LDR      r12,[r0,#0x1c]
        0x0800505e:    458c        .E      CMP      r12,r1
        0x08005060:    bf38        8.      IT       CC
        0x08005062:    4661        aF      MOVCC    r1,r12
        0x08005064:    8403        ..      STRH     r3,[r0,#0x20]
        0x08005066:    8442        B.      STRH     r2,[r0,#0x22]
        0x08005068:    8481        ..      STRH     r1,[r0,#0x24]
        0x0800506a:    4770        pG      BX       lr
    $d
        0x0800506c:    20000060    `..     DCD    536871008
        0x08005070:    3f5db3d7    ..]?    DCD    1063105495
        0x08005074:    bf5db3d7    ..].    DCD    3210589143
        0x08005078:    3fddb3d7    ...?    DCD    1071494103
    $t
    i.SpeedPIController
    SpeedPIController
        0x0800507c:    491d        .I      LDR      r1,[pc,#116] ; [0x80050f4] = 0x20000060
        0x0800507e:    edd00a00    ....    VLDR     s1,[r0,#0]
        0x08005082:    4a1d        .J      LDR      r2,[pc,#116] ; [0x80050f8] = 0x428a0000
        0x08005084:    6809        .h      LDR      r1,[r1,#0]
        0x08005086:    ee700ac0    p...    VSUB.F32 s1,s1,s0
        0x0800508a:    ed900a03    ....    VLDR     s0,[r0,#0xc]
        0x0800508e:    ed911a05    ....    VLDR     s2,[r1,#0x14]
        0x08005092:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x08005096:    ee101a10    ....    VMOV     r1,s0
        0x0800509a:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x0800509e:    4291        .B      CMP      r1,r2
        0x080050a0:    bfc4        ..      ITT      GT
        0x080050a2:    ed9f0a16    ....    VLDRGT   s0,[pc,#88] ; [0x80050fc] = 0x428a0000
        0x080050a6:    ed800a03    ....    VSTRGT   s0,[r0,#0xc]
        0x080050aa:    dc08        ..      BGT      0x80050be ; SpeedPIController + 66
        0x080050ac:    ee101a10    ....    VMOV     r1,s0
        0x080050b0:    4a13        .J      LDR      r2,[pc,#76] ; [0x8005100] = 0xc28a0000
        0x080050b2:    4291        .B      CMP      r1,r2
        0x080050b4:    bf28        (.      IT       CS
        0x080050b6:    ed9f0a13    ....    VLDRCS   s0,[pc,#76] ; [0x8005104] = 0xc28a0000
        0x080050ba:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080050be:    ed9f1a12    ....    VLDR     s2,[pc,#72] ; [0x8005108] = 0x3dcccccd
        0x080050c2:    4a13        .J      LDR      r2,[pc,#76] ; [0x8005110] = 0x40dccccd
        0x080050c4:    ee200a01     ...    VMUL.F32 s0,s0,s2
        0x080050c8:    ed9f1a10    ....    VLDR     s2,[pc,#64] ; [0x800510c] = 0x3c23d70a
        0x080050cc:    ee000a81    ....    VMLA.F32 s0,s1,s2
        0x080050d0:    ee101a10    ....    VMOV     r1,s0
        0x080050d4:    4291        .B      CMP      r1,r2
        0x080050d6:    bfc8        ..      IT       GT
        0x080050d8:    ed9f0a0e    ....    VLDRGT   s0,[pc,#56] ; [0x8005114] = 0x40dccccd
        0x080050dc:    dc04        ..      BGT      0x80050e8 ; SpeedPIController + 108
        0x080050de:    ee101a10    ....    VMOV     r1,s0
        0x080050e2:    4a0d        .J      LDR      r2,[pc,#52] ; [0x8005118] = 0xc0dccccd
        0x080050e4:    4291        .B      CMP      r1,r2
        0x080050e6:    d802        ..      BHI      0x80050ee ; SpeedPIController + 114
        0x080050e8:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x080050ec:    4770        pG      BX       lr
        0x080050ee:    ed9f0a0b    ....    VLDR     s0,[pc,#44] ; [0x800511c] = 0xc0dccccd
        0x080050f2:    e7f9        ..      B        0x80050e8 ; SpeedPIController + 108
    $d
        0x080050f4:    20000060    `..     DCD    536871008
        0x080050f8:    428a0000    ...B    DCD    1116340224
        0x080050fc:    428a0000    ...B    DCD    1116340224
        0x08005100:    c28a0000    ....    DCD    3263823872
        0x08005104:    c28a0000    ....    DCD    3263823872
        0x08005108:    3dcccccd    ...=    DCD    1036831949
        0x0800510c:    3c23d70a    ..#<    DCD    1008981770
        0x08005110:    40dccccd    ...@    DCD    1088212173
        0x08005114:    40dccccd    ...@    DCD    1088212173
        0x08005118:    c0dccccd    ....    DCD    3235695821
        0x0800511c:    c0dccccd    ....    DCD    3235695821
    $t
    i.SysTick_Handler
    SysTick_Handler
        0x08005120:    b510        ..      PUSH     {r4,lr}
        0x08005122:    f7fffda5    ....    BL       SafetyTask ; 0x8004c70
        0x08005126:    e8bd4010    ...@    POP      {r4,lr}
        0x0800512a:    f7fcbb19    ....    B        HAL_IncTick ; 0x8001760
        0x0800512e:    0000        ..      MOVS     r0,r0
    i.SystemClock_Config
    SystemClock_Config
        0x08005130:    4838        8H      LDR      r0,[pc,#224] ; [0x8005214] = 0x40022000
        0x08005132:    b510        ..      PUSH     {r4,lr}
        0x08005134:    6801        .h      LDR      r1,[r0,#0]
        0x08005136:    f021010f    !...    BIC      r1,r1,#0xf
        0x0800513a:    f0410104    A...    ORR      r1,r1,#4
        0x0800513e:    6001        .`      STR      r1,[r0,#0]
        0x08005140:    6801        .h      LDR      r1,[r0,#0]
        0x08005142:    f001010f    ....    AND      r1,r1,#0xf
        0x08005146:    2904        .)      CMP      r1,#4
        0x08005148:    d1fa        ..      BNE      0x8005140 ; SystemClock_Config + 16
        0x0800514a:    4833        3H      LDR      r0,[pc,#204] ; [0x8005218] = 0x40007000
        0x0800514c:    f8501f80    P...    LDR      r1,[r0,#0x80]!
        0x08005150:    f4217180    !..q    BIC      r1,r1,#0x100
        0x08005154:    6001        .`      STR      r1,[r0,#0]
        0x08005156:    4831        1H      LDR      r0,[pc,#196] ; [0x800521c] = 0x40021000
        0x08005158:    6801        .h      LDR      r1,[r0,#0]
        0x0800515a:    f4413180    A..1    ORR      r1,r1,#0x10000
        0x0800515e:    6001        .`      STR      r1,[r0,#0]
        0x08005160:    6801        .h      LDR      r1,[r0,#0]
        0x08005162:    f3c14140    ..@A    UBFX     r1,r1,#17,#1
        0x08005166:    2900        .)      CMP      r1,#0
        0x08005168:    d0fa        ..      BEQ      0x8005160 ; SystemClock_Config + 48
        0x0800516a:    f8d01098    ....    LDR      r1,[r0,#0x98]
        0x0800516e:    f0410101    A...    ORR      r1,r1,#1
        0x08005172:    f8c01098    ....    STR      r1,[r0,#0x98]
        0x08005176:    bf00        ..      NOP      
        0x08005178:    f8d01098    ....    LDR      r1,[r0,#0x98]
        0x0800517c:    f0110f02    ....    TST      r1,#2
        0x08005180:    d0fa        ..      BEQ      0x8005178 ; SystemClock_Config + 72
        0x08005182:    68c2        .h      LDR      r2,[r0,#0xc]
        0x08005184:    f2455113    E..Q    MOV      r1,#0x5513
        0x08005188:    4b25        %K      LDR      r3,[pc,#148] ; [0x8005220] = 0xf9ff800c
        0x0800518a:    401a        .@      ANDS     r2,r2,r3
        0x0800518c:    4311        .C      ORRS     r1,r1,r2
        0x0800518e:    60c1        .`      STR      r1,[r0,#0xc]
        0x08005190:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08005192:    f0417180    A..q    ORR      r1,r1,#0x1000000
        0x08005196:    60c1        .`      STR      r1,[r0,#0xc]
        0x08005198:    6801        .h      LDR      r1,[r0,#0]
        0x0800519a:    f0417180    A..q    ORR      r1,r1,#0x1000000
        0x0800519e:    6001        .`      STR      r1,[r0,#0]
        0x080051a0:    6801        .h      LDR      r1,[r0,#0]
        0x080051a2:    f3c16140    ..@a    UBFX     r1,r1,#25,#1
        0x080051a6:    2900        .)      CMP      r1,#0
        0x080051a8:    d0fa        ..      BEQ      0x80051a0 ; SystemClock_Config + 112
        0x080051aa:    6881        .h      LDR      r1,[r0,#8]
        0x080051ac:    f0410103    A...    ORR      r1,r1,#3
        0x080051b0:    6081        .`      STR      r1,[r0,#8]
        0x080051b2:    6881        .h      LDR      r1,[r0,#8]
        0x080051b4:    f02101f0    !...    BIC      r1,r1,#0xf0
        0x080051b8:    f0410180    A...    ORR      r1,r1,#0x80
        0x080051bc:    6081        .`      STR      r1,[r0,#8]
        0x080051be:    6881        .h      LDR      r1,[r0,#8]
        0x080051c0:    f001010c    ....    AND      r1,r1,#0xc
        0x080051c4:    290c        .)      CMP      r1,#0xc
        0x080051c6:    d1fa        ..      BNE      0x80051be ; SystemClock_Config + 142
        0x080051c8:    4916        .I      LDR      r1,[pc,#88] ; [0x8005224] = 0xe000edfc
        0x080051ca:    680a        .h      LDR      r2,[r1,#0]
        0x080051cc:    f0427280    B..r    ORR      r2,r2,#0x1000000
        0x080051d0:    600a        .`      STR      r2,[r1,#0]
        0x080051d2:    4915        .I      LDR      r1,[pc,#84] ; [0x8005228] = 0xe0001000
        0x080051d4:    680a        .h      LDR      r2,[r1,#0]
        0x080051d6:    f0420201    B...    ORR      r2,r2,#1
        0x080051da:    600a        .`      STR      r2,[r1,#0]
        0x080051dc:    2200        ."      MOVS     r2,#0
        0x080051de:    604a        J`      STR      r2,[r1,#4]
        0x080051e0:    684a        Jh      LDR      r2,[r1,#4]
        0x080051e2:    2a64        d*      CMP      r2,#0x64
        0x080051e4:    d3fc        ..      BCC      0x80051e0 ; SystemClock_Config + 176
        0x080051e6:    6881        .h      LDR      r1,[r0,#8]
        0x080051e8:    f02101f0    !...    BIC      r1,r1,#0xf0
        0x080051ec:    6081        .`      STR      r1,[r0,#8]
        0x080051ee:    6881        .h      LDR      r1,[r0,#8]
        0x080051f0:    f42161e0    !..a    BIC      r1,r1,#0x700
        0x080051f4:    6081        .`      STR      r1,[r0,#8]
        0x080051f6:    6881        .h      LDR      r1,[r0,#8]
        0x080051f8:    f4215160    !.`Q    BIC      r1,r1,#0x3800
        0x080051fc:    6081        .`      STR      r1,[r0,#8]
        0x080051fe:    480b        .H      LDR      r0,[pc,#44] ; [0x800522c] = 0xa21fe80
        0x08005200:    f7fef812    ....    BL       LL_SetSystemCoreClock ; 0x8003228
        0x08005204:    2006        .       MOVS     r0,#6
        0x08005206:    f7fcfac3    ....    BL       HAL_InitTick ; 0x8001790
        0x0800520a:    2800        .(      CMP      r0,#0
        0x0800520c:    bf08        ..      IT       EQ
        0x0800520e:    bd10        ..      POPEQ    {r4,pc}
        0x08005210:    b672        r.      CPSID    i
        0x08005212:    e7fe        ..      B        0x8005212 ; SystemClock_Config + 226
    $d
        0x08005214:    40022000    . .@    DCD    1073881088
        0x08005218:    40007000    .p.@    DCD    1073770496
        0x0800521c:    40021000    ...@    DCD    1073876992
        0x08005220:    f9ff800c    ....    DCD    4194271244
        0x08005224:    e000edfc    ....    DCD    3758157308
        0x08005228:    e0001000    ....    DCD    3758100480
        0x0800522c:    0a21fe80    ..!.    DCD    170000000
    $t
    i.SystemInit
    SystemInit
        0x08005230:    4802        .H      LDR      r0,[pc,#8] ; [0x800523c] = 0xe000ed88
        0x08005232:    6801        .h      LDR      r1,[r0,#0]
        0x08005234:    f4410170    A.p.    ORR      r1,r1,#0xf00000
        0x08005238:    6001        .`      STR      r1,[r0,#0]
        0x0800523a:    4770        pG      BX       lr
    $d
        0x0800523c:    e000ed88    ....    DCD    3758157192
    $t
    i.USBD_CDC_ConfigStrDescriptor
    USBD_CDC_ConfigStrDescriptor
        0x08005240:    b510        ..      PUSH     {r4,lr}
        0x08005242:    460a        .F      MOV      r2,r1
        0x08005244:    4902        .I      LDR      r1,[pc,#8] ; [0x8005250] = 0x20001578
        0x08005246:    a003        ..      ADR      r0,{pc}+0xe ; 0x8005254
        0x08005248:    f000faa0    ....    BL       USBD_GetString ; 0x800578c
        0x0800524c:    4800        .H      LDR      r0,[pc,#0] ; [0x8005250] = 0x20001578
