ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800524e:    bd10        ..      POP      {r4,pc}
    $d
        0x08005250:    20001578    x..     DCD    536876408
        0x08005254:    20434443    CDC     DCD    541279299
        0x08005258:    666e6f43    Conf    DCD    1718513475
        0x0800525c:    00006769    ig..    DCD    26473
    $t
    i.USBD_CDC_DataIn
    USBD_CDC_DataIn
        0x08005260:    f8d032bc    ...2    LDR      r3,[r0,#0x2bc]
        0x08005264:    f8d022c4    ..."    LDR      r2,[r0,#0x2c4]
        0x08005268:    2b00        .+      CMP      r3,#0
        0x0800526a:    bf04        ..      ITT      EQ
        0x0800526c:    2003        .       MOVEQ    r0,#3
        0x0800526e:    4770        pG      BXEQ     lr
        0x08005270:    b570        p.      PUSH     {r4-r6,lr}
        0x08005272:    eb010581    ....    ADD      r5,r1,r1,LSL #2
        0x08005276:    eb000485    ....    ADD      r4,r0,r5,LSL #2
        0x0800527a:    2600        .&      MOVS     r6,#0
        0x0800527c:    f8d4c018    ....    LDR      r12,[r4,#0x18]
        0x08005280:    f1bc0f00    ....    CMP      r12,#0
        0x08005284:    d007        ..      BEQ      0x8005296 ; USBD_CDC_DataIn + 54
        0x08005286:    eb0202c5    ....    ADD      r2,r2,r5,LSL #3
        0x0800528a:    6a12        .j      LDR      r2,[r2,#0x20]
        0x0800528c:    fbbcf5f2    ....    UDIV     r5,r12,r2
        0x08005290:    fb02c215    ....    MLS      r2,r2,r5,r12
        0x08005294:    b182        ..      CBZ      r2,0x80052b8 ; USBD_CDC_DataIn + 88
        0x08005296:    f8c36214    ...b    STR      r6,[r3,#0x214]
        0x0800529a:    f8d002c0    ....    LDR      r0,[r0,#0x2c0]
        0x0800529e:    f8d0c010    ....    LDR      r12,[r0,#0x10]
        0x080052a2:    f1bc0f00    ....    CMP      r12,#0
        0x080052a6:    d005        ..      BEQ      0x80052b4 ; USBD_CDC_DataIn + 84
        0x080052a8:    460a        .F      MOV      r2,r1
        0x080052aa:    f5037104    ...q    ADD      r1,r3,#0x210
        0x080052ae:    f8d30208    ....    LDR      r0,[r3,#0x208]
        0x080052b2:    47e0        .G      BLX      r12
        0x080052b4:    2000        .       MOVS     r0,#0
        0x080052b6:    bd70        p.      POP      {r4-r6,pc}
        0x080052b8:    2300        .#      MOVS     r3,#0
        0x080052ba:    461a        .F      MOV      r2,r3
        0x080052bc:    61a6        .a      STR      r6,[r4,#0x18]
        0x080052be:    f000fca7    ....    BL       USBD_LL_Transmit ; 0x8005c10
        0x080052c2:    e7f7        ..      B        0x80052b4 ; USBD_CDC_DataIn + 84
    i.USBD_CDC_DataOut
    USBD_CDC_DataOut
        0x080052c4:    b570        p.      PUSH     {r4-r6,lr}
        0x080052c6:    f8d042bc    ...B    LDR      r4,[r0,#0x2bc]
        0x080052ca:    4605        .F      MOV      r5,r0
        0x080052cc:    2c00        .,      CMP      r4,#0
        0x080052ce:    bf04        ..      ITT      EQ
        0x080052d0:    2003        .       MOVEQ    r0,#3
        0x080052d2:    bd70        p.      POPEQ    {r4-r6,pc}
        0x080052d4:    f000fb5b    ..[.    BL       USBD_LL_GetRxDataSize ; 0x800598e
        0x080052d8:    f8c4020c    ....    STR      r0,[r4,#0x20c]
        0x080052dc:    f8d512c0    ....    LDR      r1,[r5,#0x2c0]
        0x080052e0:    f8d40204    ....    LDR      r0,[r4,#0x204]
        0x080052e4:    68ca        .h      LDR      r2,[r1,#0xc]
        0x080052e6:    f5047103    ...q    ADD      r1,r4,#0x20c
        0x080052ea:    4790        .G      BLX      r2
        0x080052ec:    2000        .       MOVS     r0,#0
        0x080052ee:    bd70        p.      POP      {r4-r6,pc}
    i.USBD_CDC_DeInit
    USBD_CDC_DeInit
        0x080052f0:    b570        p.      PUSH     {r4-r6,lr}
        0x080052f2:    4604        .F      MOV      r4,r0
        0x080052f4:    2181        .!      MOVS     r1,#0x81
        0x080052f6:    f000faa4    ....    BL       USBD_LL_CloseEP ; 0x8005842
        0x080052fa:    2500        .%      MOVS     r5,#0
        0x080052fc:    8725        %.      STRH     r5,[r4,#0x38]
        0x080052fe:    2101        .!      MOVS     r1,#1
        0x08005300:    4620         F      MOV      r0,r4
        0x08005302:    f000fa9e    ....    BL       USBD_LL_CloseEP ; 0x8005842
        0x08005306:    f8a45178    ..xQ    STRH     r5,[r4,#0x178]
        0x0800530a:    2182        .!      MOVS     r1,#0x82
        0x0800530c:    4620         F      MOV      r0,r4
        0x0800530e:    f000fa98    ....    BL       USBD_LL_CloseEP ; 0x8005842
        0x08005312:    f8a4504c    ..LP    STRH     r5,[r4,#0x4c]
        0x08005316:    f8a4504e    ..NP    STRH     r5,[r4,#0x4e]
        0x0800531a:    f8d402bc    ....    LDR      r0,[r4,#0x2bc]
        0x0800531e:    b148        H.      CBZ      r0,0x8005334 ; USBD_CDC_DeInit + 68
        0x08005320:    f8d402c0    ....    LDR      r0,[r4,#0x2c0]
        0x08005324:    6840        @h      LDR      r0,[r0,#4]
        0x08005326:    4780        .G      BLX      r0
        0x08005328:    f8d402bc    ....    LDR      r0,[r4,#0x2bc]
        0x0800532c:    f000ff16    ....    BL       USBD_static_free ; 0x800615c
        0x08005330:    f8c452bc    ...R    STR      r5,[r4,#0x2bc]
        0x08005334:    2000        .       MOVS     r0,#0
        0x08005336:    bd70        p.      POP      {r4-r6,pc}
    i.USBD_CDC_DeviceDescriptor
    USBD_CDC_DeviceDescriptor
        0x08005338:    2012        .       MOVS     r0,#0x12
        0x0800533a:    8008        ..      STRH     r0,[r1,#0]
        0x0800533c:    4800        .H      LDR      r0,[pc,#0] ; [0x8005340] = 0x20000110
        0x0800533e:    4770        pG      BX       lr
    $d
        0x08005340:    20000110    ...     DCD    536871184
    $t
    i.USBD_CDC_EP0_RxReady
    USBD_CDC_EP0_RxReady
        0x08005344:    b510        ..      PUSH     {r4,lr}
        0x08005346:    f8d042bc    ...B    LDR      r4,[r0,#0x2bc]
        0x0800534a:    2c00        .,      CMP      r4,#0
        0x0800534c:    bf04        ..      ITT      EQ
        0x0800534e:    2003        .       MOVEQ    r0,#3
        0x08005350:    bd10        ..      POPEQ    {r4,pc}
        0x08005352:    f8d012c0    ....    LDR      r1,[r0,#0x2c0]
        0x08005356:    2900        .)      CMP      r1,#0
        0x08005358:    bf1c        ..      ITT      NE
        0x0800535a:    f8940200    ....    LDRBNE   r0,[r4,#0x200]
        0x0800535e:    28ff        .(      CMPNE    r0,#0xff
        0x08005360:    d007        ..      BEQ      0x8005372 ; USBD_CDC_EP0_RxReady + 46
        0x08005362:    688b        .h      LDR      r3,[r1,#8]
        0x08005364:    f8942201    ..."    LDRB     r2,[r4,#0x201]
        0x08005368:    4621        !F      MOV      r1,r4
        0x0800536a:    4798        .G      BLX      r3
        0x0800536c:    20ff        .       MOVS     r0,#0xff
        0x0800536e:    f8840200    ....    STRB     r0,[r4,#0x200]
        0x08005372:    2000        .       MOVS     r0,#0
        0x08005374:    bd10        ..      POP      {r4,pc}
        0x08005376:    0000        ..      MOVS     r0,r0
    i.USBD_CDC_GetDeviceQualifierDescriptor
    USBD_CDC_GetDeviceQualifierDescriptor
        0x08005378:    210a        .!      MOVS     r1,#0xa
        0x0800537a:    8001        ..      STRH     r1,[r0,#0]
        0x0800537c:    4800        .H      LDR      r0,[pc,#0] ; [0x8005380] = 0x20000158
        0x0800537e:    4770        pG      BX       lr
    $d
        0x08005380:    20000158    X..     DCD    536871256
    $t
    i.USBD_CDC_GetFSCfgDesc
    USBD_CDC_GetFSCfgDesc
        0x08005384:    2143        C!      MOVS     r1,#0x43
        0x08005386:    8001        ..      STRH     r1,[r0,#0]
        0x08005388:    4800        .H      LDR      r0,[pc,#0] ; [0x800538c] = 0x200001a8
        0x0800538a:    4770        pG      BX       lr
    $d
        0x0800538c:    200001a8    ...     DCD    536871336
    $t
    i.USBD_CDC_GetHSCfgDesc
    USBD_CDC_GetHSCfgDesc
        0x08005390:    2143        C!      MOVS     r1,#0x43
        0x08005392:    8001        ..      STRH     r1,[r0,#0]
        0x08005394:    4800        .H      LDR      r0,[pc,#0] ; [0x8005398] = 0x20000164
        0x08005396:    4770        pG      BX       lr
    $d
        0x08005398:    20000164    d..     DCD    536871268
    $t
    i.USBD_CDC_GetOtherSpeedCfgDesc
    USBD_CDC_GetOtherSpeedCfgDesc
        0x0800539c:    2143        C!      MOVS     r1,#0x43
        0x0800539e:    8001        ..      STRH     r1,[r0,#0]
        0x080053a0:    4800        .H      LDR      r0,[pc,#0] ; [0x80053a4] = 0x200001ec
        0x080053a2:    4770        pG      BX       lr
    $d
        0x080053a4:    200001ec    ...     DCD    536871404
    $t
    i.USBD_CDC_Init
    USBD_CDC_Init
        0x080053a8:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x080053ac:    4604        .F      MOV      r4,r0
        0x080053ae:    f44f7007    O..p    MOV      r0,#0x21c
        0x080053b2:    f000fed5    ....    BL       USBD_static_malloc ; 0x8006160
        0x080053b6:    0005        ..      MOVS     r5,r0
        0x080053b8:    f04f0700    O...    MOV      r7,#0
        0x080053bc:    bf02        ..      ITTT     EQ
        0x080053be:    f8c472bc    ...r    STREQ    r7,[r4,#0x2bc]
        0x080053c2:    2002        .       MOVEQ    r0,#2
        0x080053c4:    e8bd81f0    ....    POPEQ    {r4-r8,pc}
        0x080053c8:    f8c452bc    ...R    STR      r5,[r4,#0x2bc]
        0x080053cc:    7c20         |      LDRB     r0,[r4,#0x10]
        0x080053ce:    f04f0810    O...    MOV      r8,#0x10
        0x080053d2:    2601        .&      MOVS     r6,#1
        0x080053d4:    b360        `.      CBZ      r0,0x8005430 ; USBD_CDC_Init + 136
        0x080053d6:    2340        @#      MOVS     r3,#0x40
        0x080053d8:    2202        ."      MOVS     r2,#2
        0x080053da:    2181        .!      MOVS     r1,#0x81
        0x080053dc:    4620         F      MOV      r0,r4
        0x080053de:    f000fb30    ..0.    BL       USBD_LL_OpenEP ; 0x8005a42
        0x080053e2:    8726        &.      STRH     r6,[r4,#0x38]
        0x080053e4:    2340        @#      MOVS     r3,#0x40
        0x080053e6:    2202        ."      MOVS     r2,#2
        0x080053e8:    2101        .!      MOVS     r1,#1
        0x080053ea:    4620         F      MOV      r0,r4
        0x080053ec:    f000fb29    ..).    BL       USBD_LL_OpenEP ; 0x8005a42
        0x080053f0:    f8a46178    ..xa    STRH     r6,[r4,#0x178]
        0x080053f4:    f8a4804e    ..N.    STRH     r8,[r4,#0x4e]
        0x080053f8:    2308        .#      MOVS     r3,#8
        0x080053fa:    2203        ."      MOVS     r2,#3
        0x080053fc:    2182        .!      MOVS     r1,#0x82
        0x080053fe:    4620         F      MOV      r0,r4
        0x08005400:    f000fb1f    ....    BL       USBD_LL_OpenEP ; 0x8005a42
        0x08005404:    f8a4604c    ..L`    STRH     r6,[r4,#0x4c]
        0x08005408:    f8d402c0    ....    LDR      r0,[r4,#0x2c0]
        0x0800540c:    6800        .h      LDR      r0,[r0,#0]
        0x0800540e:    4780        .G      BLX      r0
        0x08005410:    f8c57214    ...r    STR      r7,[r5,#0x214]
        0x08005414:    f8c57218    ...r    STR      r7,[r5,#0x218]
        0x08005418:    7c20         |      LDRB     r0,[r4,#0x10]
        0x0800541a:    f8d52204    ..."    LDR      r2,[r5,#0x204]
        0x0800541e:    b1d8        ..      CBZ      r0,0x8005458 ; USBD_CDC_Init + 176
        0x08005420:    2340        @#      MOVS     r3,#0x40
        0x08005422:    2101        .!      MOVS     r1,#1
        0x08005424:    4620         F      MOV      r0,r4
        0x08005426:    f000fb21    ..!.    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x0800542a:    2000        .       MOVS     r0,#0
        0x0800542c:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08005430:    f44f7300    O..s    MOV      r3,#0x200
        0x08005434:    2202        ."      MOVS     r2,#2
        0x08005436:    2181        .!      MOVS     r1,#0x81
        0x08005438:    4620         F      MOV      r0,r4
        0x0800543a:    f000fb02    ....    BL       USBD_LL_OpenEP ; 0x8005a42
        0x0800543e:    8726        &.      STRH     r6,[r4,#0x38]
        0x08005440:    f44f7300    O..s    MOV      r3,#0x200
        0x08005444:    2202        ."      MOVS     r2,#2
        0x08005446:    2101        .!      MOVS     r1,#1
        0x08005448:    4620         F      MOV      r0,r4
        0x0800544a:    f000fafa    ....    BL       USBD_LL_OpenEP ; 0x8005a42
        0x0800544e:    f8a46178    ..xa    STRH     r6,[r4,#0x178]
        0x08005452:    f8a4804e    ..N.    STRH     r8,[r4,#0x4e]
        0x08005456:    e7cf        ..      B        0x80053f8 ; USBD_CDC_Init + 80
        0x08005458:    f44f7300    O..s    MOV      r3,#0x200
        0x0800545c:    2101        .!      MOVS     r1,#1
        0x0800545e:    4620         F      MOV      r0,r4
        0x08005460:    f000fb04    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x08005464:    e7e1        ..      B        0x800542a ; USBD_CDC_Init + 130
        0x08005466:    0000        ..      MOVS     r0,r0
    i.USBD_CDC_InterfaceStrDescriptor
    USBD_CDC_InterfaceStrDescriptor
        0x08005468:    b510        ..      PUSH     {r4,lr}
        0x0800546a:    460a        .F      MOV      r2,r1
        0x0800546c:    4902        .I      LDR      r1,[pc,#8] ; [0x8005478] = 0x20001578
        0x0800546e:    a003        ..      ADR      r0,{pc}+0xe ; 0x800547c
        0x08005470:    f000f98c    ....    BL       USBD_GetString ; 0x800578c
        0x08005474:    4800        .H      LDR      r0,[pc,#0] ; [0x8005478] = 0x20001578
        0x08005476:    bd10        ..      POP      {r4,pc}
    $d
        0x08005478:    20001578    x..     DCD    536876408
        0x0800547c:    20434443    CDC     DCD    541279299
        0x08005480:    65746e49    Inte    DCD    1702129225
        0x08005484:    63616672    rfac    DCD    1667327602
        0x08005488:    00000065    e...    DCD    101
    $t
    i.USBD_CDC_LangIDStrDescriptor
    USBD_CDC_LangIDStrDescriptor
        0x0800548c:    2004        .       MOVS     r0,#4
        0x0800548e:    8008        ..      STRH     r0,[r1,#0]
        0x08005490:    4800        .H      LDR      r0,[pc,#0] ; [0x8005494] = 0x2000010c
        0x08005492:    4770        pG      BX       lr
    $d
        0x08005494:    2000010c    ...     DCD    536871180
    $t
    i.USBD_CDC_ManufacturerStrDescriptor
    USBD_CDC_ManufacturerStrDescriptor
        0x08005498:    b510        ..      PUSH     {r4,lr}
        0x0800549a:    460a        .F      MOV      r2,r1
        0x0800549c:    4902        .I      LDR      r1,[pc,#8] ; [0x80054a8] = 0x20001578
        0x0800549e:    a003        ..      ADR      r0,{pc}+0xe ; 0x80054ac
        0x080054a0:    f000f974    ..t.    BL       USBD_GetString ; 0x800578c
        0x080054a4:    4800        .H      LDR      r0,[pc,#0] ; [0x80054a8] = 0x20001578
        0x080054a6:    bd10        ..      POP      {r4,pc}
    $d
        0x080054a8:    20001578    x..     DCD    536876408
        0x080054ac:    694d5453    STMi    DCD    1766675539
        0x080054b0:    656f7263    croe    DCD    1701802595
        0x080054b4:    7463656c    lect    DCD    1952671084
        0x080054b8:    696e6f72    roni    DCD    1768845170
        0x080054bc:    00007363    cs..    DCD    29539
    $t
    i.USBD_CDC_ProductStrDescriptor
    USBD_CDC_ProductStrDescriptor
        0x080054c0:    b510        ..      PUSH     {r4,lr}
        0x080054c2:    460a        .F      MOV      r2,r1
        0x080054c4:    4902        .I      LDR      r1,[pc,#8] ; [0x80054d0] = 0x20001578
        0x080054c6:    a003        ..      ADR      r0,{pc}+0xe ; 0x80054d4
        0x080054c8:    f000f960    ..`.    BL       USBD_GetString ; 0x800578c
        0x080054cc:    4800        .H      LDR      r0,[pc,#0] ; [0x80054d0] = 0x20001578
        0x080054ce:    bd10        ..      POP      {r4,pc}
    $d
        0x080054d0:    20001578    x..     DCD    536876408
        0x080054d4:    334d5453    STM3    DCD    860705875
        0x080054d8:    69562032    2 Vi    DCD    1767252018
        0x080054dc:    61757472    rtua    DCD    1635087474
        0x080054e0:    6f43206c    l Co    DCD    1866670188
        0x080054e4:    726f506d    mPor    DCD    1919897709
        0x080054e8:    00000074    t...    DCD    116
    $t
    i.USBD_CDC_ReceivePacket
    USBD_CDC_ReceivePacket
        0x080054ec:    b510        ..      PUSH     {r4,lr}
        0x080054ee:    f8d012bc    ....    LDR      r1,[r0,#0x2bc]
        0x080054f2:    2900        .)      CMP      r1,#0
        0x080054f4:    bf04        ..      ITT      EQ
        0x080054f6:    2003        .       MOVEQ    r0,#3
        0x080054f8:    bd10        ..      POPEQ    {r4,pc}
        0x080054fa:    7c02        .|      LDRB     r2,[r0,#0x10]
        0x080054fc:    2a00        .*      CMP      r2,#0
        0x080054fe:    f8d12204    ..."    LDR      r2,[r1,#0x204]
        0x08005502:    d005        ..      BEQ      0x8005510 ; USBD_CDC_ReceivePacket + 36
        0x08005504:    2340        @#      MOVS     r3,#0x40
        0x08005506:    2101        .!      MOVS     r1,#1
        0x08005508:    f000fab0    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x0800550c:    2000        .       MOVS     r0,#0
        0x0800550e:    bd10        ..      POP      {r4,pc}
        0x08005510:    f44f7300    O..s    MOV      r3,#0x200
        0x08005514:    2101        .!      MOVS     r1,#1
        0x08005516:    f000faa9    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x0800551a:    e7f7        ..      B        0x800550c ; USBD_CDC_ReceivePacket + 32
    i.USBD_CDC_RegisterInterface
    USBD_CDC_RegisterInterface
        0x0800551c:    2900        .)      CMP      r1,#0
        0x0800551e:    bf0e        ..      ITEE     EQ
        0x08005520:    2003        .       MOVEQ    r0,#3
        0x08005522:    f8c012c0    ....    STRNE    r1,[r0,#0x2c0]
        0x08005526:    2000        .       MOVNE    r0,#0
        0x08005528:    4770        pG      BX       lr
        0x0800552a:    0000        ..      MOVS     r0,r0
    i.USBD_CDC_SerialStrDescriptor
    USBD_CDC_SerialStrDescriptor
        0x0800552c:    e92d01f0    -...    PUSH     {r4-r8}
        0x08005530:    201a        .       MOVS     r0,#0x1a
        0x08005532:    8008        ..      STRH     r0,[r1,#0]
        0x08005534:    481a        .H      LDR      r0,[pc,#104] ; [0x80055a0] = 0x1fff7590
        0x08005536:    4a1c        .J      LDR      r2,[pc,#112] ; [0x80055a8] = 0x1fff7598
        0x08005538:    491a        .I      LDR      r1,[pc,#104] ; [0x80055a4] = 0x1fff7594
        0x0800553a:    6800        .h      LDR      r0,[r0,#0]
        0x0800553c:    6812        .h      LDR      r2,[r2,#0]
        0x0800553e:    6809        .h      LDR      r1,[r1,#0]
        0x08005540:    1880        ..      ADDS     r0,r0,r2
        0x08005542:    d029        ).      BEQ      0x8005598 ; USBD_CDC_SerialStrDescriptor + 108
        0x08005544:    4f19        .O      LDR      r7,[pc,#100] ; [0x80055ac] = 0x20000124
        0x08005546:    2308        .#      MOVS     r3,#8
        0x08005548:    1cba        ..      ADDS     r2,r7,#2
        0x0800554a:    240a        .$      MOVS     r4,#0xa
        0x0800554c:    2530        0%      MOVS     r5,#0x30
        0x0800554e:    2637        7&      MOVS     r6,#0x37
        0x08005550:    f04f0c00    O...    MOV      r12,#0
        0x08005554:    ebb47f10    ....    CMP      r4,r0,LSR #28
        0x08005558:    bf8c        ..      ITE      HI
        0x0800555a:    eb057810    ...x    ADDHI    r8,r5,r0,LSR #28
        0x0800555e:    eb067810    ...x    ADDLS    r8,r6,r0,LSR #28
        0x08005562:    f8828000    ....    STRB     r8,[r2,#0]
        0x08005566:    f882c001    ....    STRB     r12,[r2,#1]
        0x0800556a:    0100        ..      LSLS     r0,r0,#4
        0x0800556c:    1c92        ..      ADDS     r2,r2,#2
        0x0800556e:    1e5b        [.      SUBS     r3,r3,#1
        0x08005570:    bf04        ..      ITT      EQ
        0x08005572:    f1070012    ....    ADDEQ    r0,r7,#0x12
        0x08005576:    2204        ."      MOVEQ    r2,#4
        0x08005578:    d1ec        ..      BNE      0x8005554 ; USBD_CDC_SerialStrDescriptor + 40
        0x0800557a:    bf00        ..      NOP      
        0x0800557c:    ebb47f11    ....    CMP      r4,r1,LSR #28
        0x08005580:    bf8c        ..      ITE      HI
        0x08005582:    eb057311    ...s    ADDHI    r3,r5,r1,LSR #28
        0x08005586:    eb067311    ...s    ADDLS    r3,r6,r1,LSR #28
        0x0800558a:    7003        .p      STRB     r3,[r0,#0]
        0x0800558c:    f880c001    ....    STRB     r12,[r0,#1]
        0x08005590:    0109        ..      LSLS     r1,r1,#4
        0x08005592:    1c80        ..      ADDS     r0,r0,#2
        0x08005594:    1e52        R.      SUBS     r2,r2,#1
        0x08005596:    d1f1        ..      BNE      0x800557c ; USBD_CDC_SerialStrDescriptor + 80
        0x08005598:    e8bd01f0    ....    POP      {r4-r8}
        0x0800559c:    4803        .H      LDR      r0,[pc,#12] ; [0x80055ac] = 0x20000124
        0x0800559e:    4770        pG      BX       lr
    $d
        0x080055a0:    1fff7590    .u..    DCD    536835472
        0x080055a4:    1fff7594    .u..    DCD    536835476
        0x080055a8:    1fff7598    .u..    DCD    536835480
        0x080055ac:    20000124    $..     DCD    536871204
    $t
    i.USBD_CDC_SetRxBuffer
    USBD_CDC_SetRxBuffer
        0x080055b0:    f8d002bc    ....    LDR      r0,[r0,#0x2bc]
        0x080055b4:    2800        .(      CMP      r0,#0
        0x080055b6:    bf0e        ..      ITEE     EQ
        0x080055b8:    2003        .       MOVEQ    r0,#3
        0x080055ba:    f8c01204    ....    STRNE    r1,[r0,#0x204]
        0x080055be:    2000        .       MOVNE    r0,#0
        0x080055c0:    4770        pG      BX       lr
    i.USBD_CDC_SetTxBuffer
    USBD_CDC_SetTxBuffer
        0x080055c2:    f8d002bc    ....    LDR      r0,[r0,#0x2bc]
        0x080055c6:    2800        .(      CMP      r0,#0
        0x080055c8:    bf04        ..      ITT      EQ
        0x080055ca:    2003        .       MOVEQ    r0,#3
        0x080055cc:    4770        pG      BXEQ     lr
        0x080055ce:    f8c02210    ..."    STR      r2,[r0,#0x210]
        0x080055d2:    f8c01208    ....    STR      r1,[r0,#0x208]
        0x080055d6:    2000        .       MOVS     r0,#0
        0x080055d8:    4770        pG      BX       lr
    i.USBD_CDC_Setup
    USBD_CDC_Setup
        0x080055da:    b5f0        ..      PUSH     {r4-r7,lr}
        0x080055dc:    4605        .F      MOV      r5,r0
        0x080055de:    f8d072bc    ...r    LDR      r7,[r0,#0x2bc]
        0x080055e2:    2000        .       MOVS     r0,#0
        0x080055e4:    b083        ..      SUB      sp,sp,#0xc
        0x080055e6:    460c        .F      MOV      r4,r1
        0x080055e8:    f88d0000    ....    STRB     r0,[sp,#0]
        0x080055ec:    f8ad0004    ....    STRH     r0,[sp,#4]
        0x080055f0:    4606        .F      MOV      r6,r0
        0x080055f2:    2f00        ./      CMP      r7,#0
        0x080055f4:    bf02        ..      ITTT     EQ
        0x080055f6:    2003        .       MOVEQ    r0,#3
        0x080055f8:    b003        ..      ADDEQ    sp,sp,#0xc
        0x080055fa:    bdf0        ..      POPEQ    {r4-r7,pc}
        0x080055fc:    7820         x      LDRB     r0,[r4,#0]
        0x080055fe:    f0100160    ..`.    ANDS     r1,r0,#0x60
        0x08005602:    d028        (.      BEQ      0x8005656 ; USBD_CDC_Setup + 124
        0x08005604:    2920         )      CMP      r1,#0x20
        0x08005606:    d141        A.      BNE      0x800568c ; USBD_CDC_Setup + 178
