ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08005608:    88e2        ..      LDRH     r2,[r4,#6]
        0x0800560a:    b1e2        ..      CBZ      r2,0x8005646 ; USBD_CDC_Setup + 108
        0x0800560c:    f0100f80    ....    TST      r0,#0x80
        0x08005610:    7860        `x      LDRB     r0,[r4,#1]
        0x08005612:    d00d        ..      BEQ      0x8005630 ; USBD_CDC_Setup + 86
        0x08005614:    f8d512c0    ....    LDR      r1,[r5,#0x2c0]
        0x08005618:    688b        .h      LDR      r3,[r1,#8]
        0x0800561a:    4639        9F      MOV      r1,r7
        0x0800561c:    4798        .G      BLX      r3
        0x0800561e:    88e2        ..      LDRH     r2,[r4,#6]
        0x08005620:    2a07        .*      CMP      r2,#7
        0x08005622:    bf88        ..      IT       HI
        0x08005624:    2207        ."      MOVHI    r2,#7
        0x08005626:    4639        9F      MOV      r1,r7
        0x08005628:    4628        (F      MOV      r0,r5
        0x0800562a:    f000f896    ....    BL       USBD_CtlSendData ; 0x800575a
        0x0800562e:    e032        2.      B        0x8005696 ; USBD_CDC_Setup + 188
        0x08005630:    f8870200    ....    STRB     r0,[r7,#0x200]
        0x08005634:    79a0        .y      LDRB     r0,[r4,#6]
        0x08005636:    f8870201    ....    STRB     r0,[r7,#0x201]
        0x0800563a:    88e2        ..      LDRH     r2,[r4,#6]
        0x0800563c:    4639        9F      MOV      r1,r7
        0x0800563e:    4628        (F      MOV      r0,r5
        0x08005640:    f000f871    ..q.    BL       USBD_CtlPrepareRx ; 0x8005726
        0x08005644:    e027        '.      B        0x8005696 ; USBD_CDC_Setup + 188
        0x08005646:    f8d512c0    ....    LDR      r1,[r5,#0x2c0]
        0x0800564a:    7860        `x      LDRB     r0,[r4,#1]
        0x0800564c:    2200        ."      MOVS     r2,#0
        0x0800564e:    688b        .h      LDR      r3,[r1,#8]
        0x08005650:    4621        !F      MOV      r1,r4
        0x08005652:    4798        .G      BLX      r3
        0x08005654:    e01f        ..      B        0x8005696 ; USBD_CDC_Setup + 188
        0x08005656:    7860        `x      LDRB     r0,[r4,#1]
        0x08005658:    b150        P.      CBZ      r0,0x8005670 ; USBD_CDC_Setup + 150
        0x0800565a:    2801        .(      CMP      r0,#1
        0x0800565c:    d01b        ..      BEQ      0x8005696 ; USBD_CDC_Setup + 188
        0x0800565e:    280a        .(      CMP      r0,#0xa
        0x08005660:    d010        ..      BEQ      0x8005684 ; USBD_CDC_Setup + 170
        0x08005662:    280b        .(      CMP      r0,#0xb
        0x08005664:    bf04        ..      ITT      EQ
        0x08005666:    f895029c    ....    LDRBEQ   r0,[r5,#0x29c]
        0x0800566a:    2803        .(      CMPEQ    r0,#3
        0x0800566c:    d013        ..      BEQ      0x8005696 ; USBD_CDC_Setup + 188
        0x0800566e:    e00d        ..      B        0x800568c ; USBD_CDC_Setup + 178
        0x08005670:    f895029c    ....    LDRB     r0,[r5,#0x29c]
        0x08005674:    2803        .(      CMP      r0,#3
        0x08005676:    d109        ..      BNE      0x800568c ; USBD_CDC_Setup + 178
        0x08005678:    2202        ."      MOVS     r2,#2
        0x0800567a:    a901        ..      ADD      r1,sp,#4
        0x0800567c:    4628        (F      MOV      r0,r5
        0x0800567e:    f000f86c    ..l.    BL       USBD_CtlSendData ; 0x800575a
        0x08005682:    e008        ..      B        0x8005696 ; USBD_CDC_Setup + 188
        0x08005684:    f895029c    ....    LDRB     r0,[r5,#0x29c]
        0x08005688:    2803        .(      CMP      r0,#3
        0x0800568a:    d007        ..      BEQ      0x800569c ; USBD_CDC_Setup + 194
        0x0800568c:    4621        !F      MOV      r1,r4
        0x0800568e:    4628        (F      MOV      r0,r5
        0x08005690:    f000f83e    ..>.    BL       USBD_CtlError ; 0x8005710
        0x08005694:    2603        .&      MOVS     r6,#3
        0x08005696:    b003        ..      ADD      sp,sp,#0xc
        0x08005698:    4630        0F      MOV      r0,r6
        0x0800569a:    bdf0        ..      POP      {r4-r7,pc}
        0x0800569c:    2201        ."      MOVS     r2,#1
        0x0800569e:    4669        iF      MOV      r1,sp
        0x080056a0:    4628        (F      MOV      r0,r5
        0x080056a2:    f000f85a    ..Z.    BL       USBD_CtlSendData ; 0x800575a
        0x080056a6:    e7f6        ..      B        0x8005696 ; USBD_CDC_Setup + 188
    i.USBD_CDC_TransmitPacket
    USBD_CDC_TransmitPacket
        0x080056a8:    b510        ..      PUSH     {r4,lr}
        0x080056aa:    f8d012bc    ....    LDR      r1,[r0,#0x2bc]
        0x080056ae:    2201        ."      MOVS     r2,#1
        0x080056b0:    2900        .)      CMP      r1,#0
        0x080056b2:    bf04        ..      ITT      EQ
        0x080056b4:    2003        .       MOVEQ    r0,#3
        0x080056b6:    bd10        ..      POPEQ    {r4,pc}
        0x080056b8:    f8d13214    ...2    LDR      r3,[r1,#0x214]
        0x080056bc:    b96b        k.      CBNZ     r3,0x80056da ; USBD_CDC_TransmitPacket + 50
        0x080056be:    2201        ."      MOVS     r2,#1
        0x080056c0:    f8c12214    ..."    STR      r2,[r1,#0x214]
        0x080056c4:    f8d12210    ..."    LDR      r2,[r1,#0x210]
        0x080056c8:    62c2        .b      STR      r2,[r0,#0x2c]
        0x080056ca:    f8d13210    ...2    LDR      r3,[r1,#0x210]
        0x080056ce:    f8d12208    ..."    LDR      r2,[r1,#0x208]
        0x080056d2:    2181        .!      MOVS     r1,#0x81
        0x080056d4:    f000fa9c    ....    BL       USBD_LL_Transmit ; 0x8005c10
        0x080056d8:    2200        ."      MOVS     r2,#0
        0x080056da:    4610        .F      MOV      r0,r2
        0x080056dc:    bd10        ..      POP      {r4,pc}
    i.USBD_ClrClassConfig
    USBD_ClrClassConfig
        0x080056de:    b510        ..      PUSH     {r4,lr}
        0x080056e0:    f8d022b8    ..."    LDR      r2,[r0,#0x2b8]
        0x080056e4:    2a00        .*      CMP      r2,#0
        0x080056e6:    bf1c        ..      ITT      NE
        0x080056e8:    6852        Rh      LDRNE    r2,[r2,#4]
        0x080056ea:    4790        .G      BLXNE    r2
        0x080056ec:    2000        .       MOVS     r0,#0
        0x080056ee:    bd10        ..      POP      {r4,pc}
    i.USBD_CtlContinueRx
    USBD_CtlContinueRx
        0x080056f0:    4613        .F      MOV      r3,r2
        0x080056f2:    b510        ..      PUSH     {r4,lr}
        0x080056f4:    460a        .F      MOV      r2,r1
        0x080056f6:    2100        .!      MOVS     r1,#0
        0x080056f8:    f000f9b8    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x080056fc:    2000        .       MOVS     r0,#0
        0x080056fe:    bd10        ..      POP      {r4,pc}
    i.USBD_CtlContinueSendData
    USBD_CtlContinueSendData
        0x08005700:    4613        .F      MOV      r3,r2
        0x08005702:    b510        ..      PUSH     {r4,lr}
        0x08005704:    460a        .F      MOV      r2,r1
        0x08005706:    2100        .!      MOVS     r1,#0
        0x08005708:    f000fa82    ....    BL       USBD_LL_Transmit ; 0x8005c10
        0x0800570c:    2000        .       MOVS     r0,#0
        0x0800570e:    bd10        ..      POP      {r4,pc}
    i.USBD_CtlError
    USBD_CtlError
        0x08005710:    b510        ..      PUSH     {r4,lr}
        0x08005712:    4604        .F      MOV      r4,r0
        0x08005714:    2180        .!      MOVS     r1,#0x80
        0x08005716:    f000fa4e    ..N.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x0800571a:    4620         F      MOV      r0,r4
        0x0800571c:    e8bd4010    ...@    POP      {r4,lr}
        0x08005720:    2100        .!      MOVS     r1,#0
        0x08005722:    f000ba48    ..H.    B.W      USBD_LL_StallEP ; 0x8005bb6
    i.USBD_CtlPrepareRx
    USBD_CtlPrepareRx
        0x08005726:    b510        ..      PUSH     {r4,lr}
        0x08005728:    2303        .#      MOVS     r3,#3
        0x0800572a:    f8c03294    ...2    STR      r3,[r0,#0x294]
        0x0800572e:    f8c02158    ..X!    STR      r2,[r0,#0x158]
        0x08005732:    4613        .F      MOV      r3,r2
        0x08005734:    f8c0215c    ..\!    STR      r2,[r0,#0x15c]
        0x08005738:    460a        .F      MOV      r2,r1
        0x0800573a:    2100        .!      MOVS     r1,#0
        0x0800573c:    f000f996    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x08005740:    2000        .       MOVS     r0,#0
        0x08005742:    bd10        ..      POP      {r4,pc}
    i.USBD_CtlReceiveStatus
    USBD_CtlReceiveStatus
        0x08005744:    b510        ..      PUSH     {r4,lr}
        0x08005746:    2105        .!      MOVS     r1,#5
        0x08005748:    f8c01294    ....    STR      r1,[r0,#0x294]
        0x0800574c:    2300        .#      MOVS     r3,#0
        0x0800574e:    461a        .F      MOV      r2,r3
        0x08005750:    4619        .F      MOV      r1,r3
        0x08005752:    f000f98b    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x08005756:    2000        .       MOVS     r0,#0
        0x08005758:    bd10        ..      POP      {r4,pc}
    i.USBD_CtlSendData
    USBD_CtlSendData
        0x0800575a:    b510        ..      PUSH     {r4,lr}
        0x0800575c:    2302        .#      MOVS     r3,#2
        0x0800575e:    f8c03294    ...2    STR      r3,[r0,#0x294]
        0x08005762:    6182        .a      STR      r2,[r0,#0x18]
        0x08005764:    4613        .F      MOV      r3,r2
        0x08005766:    61c2        .a      STR      r2,[r0,#0x1c]
        0x08005768:    460a        .F      MOV      r2,r1
        0x0800576a:    2100        .!      MOVS     r1,#0
        0x0800576c:    f000fa50    ..P.    BL       USBD_LL_Transmit ; 0x8005c10
        0x08005770:    2000        .       MOVS     r0,#0
        0x08005772:    bd10        ..      POP      {r4,pc}
    i.USBD_CtlSendStatus
    USBD_CtlSendStatus
        0x08005774:    b510        ..      PUSH     {r4,lr}
        0x08005776:    2104        .!      MOVS     r1,#4
        0x08005778:    f8c01294    ....    STR      r1,[r0,#0x294]
        0x0800577c:    2300        .#      MOVS     r3,#0
        0x0800577e:    461a        .F      MOV      r2,r3
        0x08005780:    4619        .F      MOV      r1,r3
        0x08005782:    f000fa45    ..E.    BL       USBD_LL_Transmit ; 0x8005c10
        0x08005786:    2000        .       MOVS     r0,#0
        0x08005788:    bd10        ..      POP      {r4,pc}
        0x0800578a:    0000        ..      MOVS     r0,r0
    i.USBD_GetString
    USBD_GetString
        0x0800578c:    b430        0.      PUSH     {r4,r5}
        0x0800578e:    2500        .%      MOVS     r5,#0
        0x08005790:    2800        .(      CMP      r0,#0
        0x08005792:    bf04        ..      ITT      EQ
        0x08005794:    bc30        0.      POPEQ    {r4,r5}
        0x08005796:    4770        pG      BXEQ     lr
        0x08005798:    f04f0c00    O...    MOV      r12,#0
        0x0800579c:    7804        .x      LDRB     r4,[r0,#0]
        0x0800579e:    4603        .F      MOV      r3,r0
        0x080057a0:    b144        D.      CBZ      r4,0x80057b4 ; USBD_GetString + 40
        0x080057a2:    bf00        ..      NOP      
        0x080057a4:    f8134f01    ...O    LDRB     r4,[r3,#1]!
        0x080057a8:    f10c0c01    ....    ADD      r12,r12,#1
        0x080057ac:    f00c0cff    ....    AND      r12,r12,#0xff
        0x080057b0:    2c00        .,      CMP      r4,#0
        0x080057b2:    d1f7        ..      BNE      0x80057a4 ; USBD_GetString + 24
        0x080057b4:    2302        .#      MOVS     r3,#2
        0x080057b6:    eb03034c    ..L.    ADD      r3,r3,r12,LSL #1
        0x080057ba:    8013        ..      STRH     r3,[r2,#0]
        0x080057bc:    7812        .x      LDRB     r2,[r2,#0]
        0x080057be:    554a        JU      STRB     r2,[r1,r5]
        0x080057c0:    1c6a        j.      ADDS     r2,r5,#1
        0x080057c2:    2303        .#      MOVS     r3,#3
        0x080057c4:    548b        .T      STRB     r3,[r1,r2]
        0x080057c6:    7803        .x      LDRB     r3,[r0,#0]
        0x080057c8:    1caa        ..      ADDS     r2,r5,#2
        0x080057ca:    2b00        .+      CMP      r3,#0
        0x080057cc:    bf12        ..      ITEE     NE
        0x080057ce:    2300        .#      MOVNE    r3,#0
        0x080057d0:    bc30        0.      POPEQ    {r4,r5}
        0x080057d2:    4770        pG      BXEQ     lr
        0x080057d4:    f810cb01    ....    LDRB     r12,[r0],#1
        0x080057d8:    f801c002    ....    STRB     r12,[r1,r2]
        0x080057dc:    1c52        R.      ADDS     r2,r2,#1
        0x080057de:    b2d2        ..      UXTB     r2,r2
        0x080057e0:    548b        .T      STRB     r3,[r1,r2]
        0x080057e2:    1c52        R.      ADDS     r2,r2,#1
        0x080057e4:    f890c000    ....    LDRB     r12,[r0,#0]
        0x080057e8:    b2d2        ..      UXTB     r2,r2
        0x080057ea:    f1bc0f00    ....    CMP      r12,#0
        0x080057ee:    d1f1        ..      BNE      0x80057d4 ; USBD_GetString + 72
        0x080057f0:    bc30        0.      POP      {r4,r5}
        0x080057f2:    4770        pG      BX       lr
    i.USBD_Init
    USBD_Init
        0x080057f4:    2800        .(      CMP      r0,#0
        0x080057f6:    bf04        ..      ITT      EQ
        0x080057f8:    2003        .       MOVEQ    r0,#3
        0x080057fa:    4770        pG      BXEQ     lr
        0x080057fc:    2300        .#      MOVS     r3,#0
        0x080057fe:    f8c032b8    ...2    STR      r3,[r0,#0x2b8]
        0x08005802:    f8c032c0    ...2    STR      r3,[r0,#0x2c0]
        0x08005806:    f8c032cc    ...2    STR      r3,[r0,#0x2cc]
        0x0800580a:    2900        .)      CMP      r1,#0
        0x0800580c:    bf18        ..      IT       NE
        0x0800580e:    f8c012b4    ....    STRNE    r1,[r0,#0x2b4]
        0x08005812:    2101        .!      MOVS     r1,#1
        0x08005814:    f880129c    ....    STRB     r1,[r0,#0x29c]
        0x08005818:    7002        .p      STRB     r2,[r0,#0]
        0x0800581a:    f000b8bd    ....    B.W      USBD_LL_Init ; 0x8005998
    i.USBD_LL_ClearStallEP
    USBD_LL_ClearStallEP
        0x0800581e:    b510        ..      PUSH     {r4,lr}
        0x08005820:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005824:    f7fcf8d5    ....    BL       HAL_PCD_EP_ClrStall ; 0x80019d2
        0x08005828:    0001        ..      MOVS     r1,r0
        0x0800582a:    f04f0000    O...    MOV      r0,#0
        0x0800582e:    bf08        ..      IT       EQ
        0x08005830:    bd10        ..      POPEQ    {r4,pc}
        0x08005832:    2901        .)      CMP      r1,#1
        0x08005834:    d003        ..      BEQ      0x800583e ; USBD_LL_ClearStallEP + 32
        0x08005836:    2902        .)      CMP      r1,#2
        0x08005838:    bf04        ..      ITT      EQ
        0x0800583a:    2001        .       MOVEQ    r0,#1
        0x0800583c:    bd10        ..      POPEQ    {r4,pc}
        0x0800583e:    2003        .       MOVS     r0,#3
        0x08005840:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_CloseEP
    USBD_LL_CloseEP
        0x08005842:    b510        ..      PUSH     {r4,lr}
        0x08005844:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005848:    f7fcf89d    ....    BL       HAL_PCD_EP_Close ; 0x8001986
        0x0800584c:    0001        ..      MOVS     r1,r0
        0x0800584e:    f04f0000    O...    MOV      r0,#0
        0x08005852:    bf08        ..      IT       EQ
        0x08005854:    bd10        ..      POPEQ    {r4,pc}
        0x08005856:    2901        .)      CMP      r1,#1
        0x08005858:    d003        ..      BEQ      0x8005862 ; USBD_LL_CloseEP + 32
        0x0800585a:    2902        .)      CMP      r1,#2
        0x0800585c:    bf04        ..      ITT      EQ
        0x0800585e:    2001        .       MOVEQ    r0,#1
        0x08005860:    bd10        ..      POPEQ    {r4,pc}
        0x08005862:    2003        .       MOVS     r0,#3
        0x08005864:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_DataInStage
    USBD_LL_DataInStage
        0x08005866:    b570        p.      PUSH     {r4-r6,lr}
        0x08005868:    4613        .F      MOV      r3,r2
        0x0800586a:    4604        .F      MOV      r4,r0
        0x0800586c:    b121        !.      CBZ      r1,0x8005878 ; USBD_LL_DataInStage + 18
        0x0800586e:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x08005872:    2803        .(      CMP      r0,#3
        0x08005874:    d048        H.      BEQ      0x8005908 ; USBD_LL_DataInStage + 162
        0x08005876:    e050        P.      B        0x800591a ; USBD_LL_DataInStage + 180
        0x08005878:    f8d41294    ....    LDR      r1,[r4,#0x294]
        0x0800587c:    f1040014    ....    ADD      r0,r4,#0x14
        0x08005880:    2500        .%      MOVS     r5,#0
        0x08005882:    2902        .)      CMP      r1,#2
        0x08005884:    d139        9.      BNE      0x80058fa ; USBD_LL_DataInStage + 148
        0x08005886:    e9d02102    ...!    LDRD     r2,r1,[r0,#8]
        0x0800588a:    4291        .B      CMP      r1,r2
        0x0800588c:    d20d        ..      BCS      0x80058aa ; USBD_LL_DataInStage + 68
        0x0800588e:    eba20201    ....    SUB      r2,r2,r1
        0x08005892:    6082        .`      STR      r2,[r0,#8]
        0x08005894:    4619        .F      MOV      r1,r3
        0x08005896:    4620         F      MOV      r0,r4
        0x08005898:    f7ffff32    ..2.    BL       USBD_CtlContinueSendData ; 0x8005700
        0x0800589c:    2300        .#      MOVS     r3,#0
        0x0800589e:    461a        .F      MOV      r2,r3
        0x080058a0:    4619        .F      MOV      r1,r3
        0x080058a2:    4620         F      MOV      r0,r4
        0x080058a4:    f000f8e2    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x080058a8:    e027        '.      B        0x80058fa ; USBD_LL_DataInStage + 148
        0x080058aa:    d114        ..      BNE      0x80058d6 ; USBD_LL_DataInStage + 112
        0x080058ac:    6840        @h      LDR      r0,[r0,#4]
        0x080058ae:    4288        .B      CMP      r0,r1
        0x080058b0:    d311        ..      BCC      0x80058d6 ; USBD_LL_DataInStage + 112
        0x080058b2:    f8d41298    ....    LDR      r1,[r4,#0x298]
        0x080058b6:    4288        .B      CMP      r0,r1
        0x080058b8:    d20d        ..      BCS      0x80058d6 ; USBD_LL_DataInStage + 112
        0x080058ba:    2200        ."      MOVS     r2,#0
        0x080058bc:    4611        .F      MOV      r1,r2
        0x080058be:    4620         F      MOV      r0,r4
        0x080058c0:    f7ffff1e    ....    BL       USBD_CtlContinueSendData ; 0x8005700
        0x080058c4:    2300        .#      MOVS     r3,#0
        0x080058c6:    461a        .F      MOV      r2,r3
        0x080058c8:    4619        .F      MOV      r1,r3
        0x080058ca:    4620         F      MOV      r0,r4
        0x080058cc:    f8c45298    ...R    STR      r5,[r4,#0x298]
        0x080058d0:    f000f8cc    ....    BL       USBD_LL_PrepareReceive ; 0x8005a6c
        0x080058d4:    e011        ..      B        0x80058fa ; USBD_LL_DataInStage + 148
        0x080058d6:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x080058da:    2803        .(      CMP      r0,#3
        0x080058dc:    d106        ..      BNE      0x80058ec ; USBD_LL_DataInStage + 134
        0x080058de:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x080058e2:    68c1        .h      LDR      r1,[r0,#0xc]
        0x080058e4:    2900        .)      CMP      r1,#0
        0x080058e6:    bf1c        ..      ITT      NE
        0x080058e8:    4620         F      MOVNE    r0,r4
        0x080058ea:    4788        .G      BLXNE    r1
        0x080058ec:    2180        .!      MOVS     r1,#0x80
        0x080058ee:    4620         F      MOV      r0,r4
        0x080058f0:    f000f961    ..a.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x080058f4:    4620         F      MOV      r0,r4
        0x080058f6:    f7ffff25    ..%.    BL       USBD_CtlReceiveStatus ; 0x8005744
        0x080058fa:    f89402a0    ....    LDRB     r0,[r4,#0x2a0]
        0x080058fe:    2801        .(      CMP      r0,#1
        0x08005900:    bf08        ..      IT       EQ
        0x08005902:    f88452a0    ...R    STRBEQ   r5,[r4,#0x2a0]
        0x08005906:    e008        ..      B        0x800591a ; USBD_LL_DataInStage + 180
        0x08005908:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x0800590c:    6942        Bi      LDR      r2,[r0,#0x14]
        0x0800590e:    b122        ".      CBZ      r2,0x800591a ; USBD_LL_DataInStage + 180
        0x08005910:    4620         F      MOV      r0,r4
        0x08005912:    4790        .G      BLX      r2
        0x08005914:    2800        .(      CMP      r0,#0
        0x08005916:    bf18        ..      IT       NE
        0x08005918:    bd70        p.      POPNE    {r4-r6,pc}
        0x0800591a:    2000        .       MOVS     r0,#0
        0x0800591c:    bd70        p.      POP      {r4-r6,pc}
    i.USBD_LL_DataOutStage
    USBD_LL_DataOutStage
        0x0800591e:    b510        ..      PUSH     {r4,lr}
        0x08005920:    4694        .F      MOV      r12,r2
        0x08005922:    4604        .F      MOV      r4,r0
        0x08005924:    b121        !.      CBZ      r1,0x8005930 ; USBD_LL_DataOutStage + 18
        0x08005926:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x0800592a:    2803        .(      CMP      r0,#3
        0x0800592c:    d024        $.      BEQ      0x8005978 ; USBD_LL_DataOutStage + 90
        0x0800592e:    e02c        ,.      B        0x800598a ; USBD_LL_DataOutStage + 108
        0x08005930:    f8d41294    ....    LDR      r1,[r4,#0x294]
        0x08005934:    f50470aa    ...p    ADD      r0,r4,#0x154
        0x08005938:    2903        .)      CMP      r1,#3
        0x0800593a:    d126        &.      BNE      0x800598a ; USBD_LL_DataOutStage + 108
        0x0800593c:    e9d03202    ...2    LDRD     r3,r2,[r0,#8]
        0x08005940:    4293        .B      CMP      r3,r2
        0x08005942:    d90a        ..      BLS      0x800595a ; USBD_LL_DataOutStage + 60
        0x08005944:    1a9a        ..      SUBS     r2,r3,r2
        0x08005946:    6082        .`      STR      r2,[r0,#8]
        0x08005948:    68c0        .h      LDR      r0,[r0,#0xc]
        0x0800594a:    4290        .B      CMP      r0,r2
        0x0800594c:    bf98        ..      IT       LS
        0x0800594e:    4602        .F      MOVLS    r2,r0
        0x08005950:    4661        aF      MOV      r1,r12
        0x08005952:    4620         F      MOV      r0,r4
        0x08005954:    f7fffecc    ....    BL       USBD_CtlContinueRx ; 0x80056f0
        0x08005958:    e017        ..      B        0x800598a ; USBD_LL_DataOutStage + 108
        0x0800595a:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x0800595e:    2803        .(      CMP      r0,#3
        0x08005960:    d106        ..      BNE      0x8005970 ; USBD_LL_DataOutStage + 82
        0x08005962:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08005966:    6901        .i      LDR      r1,[r0,#0x10]
        0x08005968:    2900        .)      CMP      r1,#0
        0x0800596a:    bf1c        ..      ITT      NE
        0x0800596c:    4620         F      MOVNE    r0,r4
        0x0800596e:    4788        .G      BLXNE    r1
        0x08005970:    4620         F      MOV      r0,r4
        0x08005972:    f7fffeff    ....    BL       USBD_CtlSendStatus ; 0x8005774
        0x08005976:    e008        ..      B        0x800598a ; USBD_LL_DataOutStage + 108
        0x08005978:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
