ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800597c:    6982        .i      LDR      r2,[r0,#0x18]
        0x0800597e:    b122        ".      CBZ      r2,0x800598a ; USBD_LL_DataOutStage + 108
        0x08005980:    4620         F      MOV      r0,r4
        0x08005982:    4790        .G      BLX      r2
        0x08005984:    2800        .(      CMP      r0,#0
        0x08005986:    bf18        ..      IT       NE
        0x08005988:    bd10        ..      POPNE    {r4,pc}
        0x0800598a:    2000        .       MOVS     r0,#0
        0x0800598c:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_GetRxDataSize
    USBD_LL_GetRxDataSize
        0x0800598e:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005992:    f7fcb84c    ..L.    B        HAL_PCD_EP_GetRxCount ; 0x8001a2e
        0x08005996:    0000        ..      MOVS     r0,r0
    i.USBD_LL_Init
    USBD_LL_Init
        0x08005998:    b510        ..      PUSH     {r4,lr}
        0x0800599a:    4920         I      LDR      r1,[pc,#128] ; [0x8005a1c] = 0x20000fcc
        0x0800599c:    4604        .F      MOV      r4,r0
        0x0800599e:    f8c102d8    ....    STR      r0,[r1,#0x2d8]
        0x080059a2:    f8c012c4    ....    STR      r1,[r0,#0x2c4]
        0x080059a6:    481e        .H      LDR      r0,[pc,#120] ; [0x8005a20] = 0x40005c00
        0x080059a8:    6008        .`      STR      r0,[r1,#0]
        0x080059aa:    2008        .       MOVS     r0,#8
        0x080059ac:    7108        .q      STRB     r0,[r1,#4]
        0x080059ae:    2002        .       MOVS     r0,#2
        0x080059b0:    7148        Hq      STRB     r0,[r1,#5]
        0x080059b2:    71c8        .q      STRB     r0,[r1,#7]
        0x080059b4:    2000        .       MOVS     r0,#0
        0x080059b6:    7208        .r      STRB     r0,[r1,#8]
        0x080059b8:    7248        Hr      STRB     r0,[r1,#9]
        0x080059ba:    7288        .r      STRB     r0,[r1,#0xa]
        0x080059bc:    72c8        .r      STRB     r0,[r1,#0xb]
        0x080059be:    4608        .F      MOV      r0,r1
        0x080059c0:    f7fcf991    ....    BL       HAL_PCD_Init ; 0x8001ce6
        0x080059c4:    2800        .(      CMP      r0,#0
        0x080059c6:    bf18        ..      IT       NE
        0x080059c8:    f7fafe80    ....    BLNE     Error_Handler ; 0x80006cc
        0x080059cc:    2318        .#      MOVS     r3,#0x18
        0x080059ce:    2200        ."      MOVS     r2,#0
        0x080059d0:    4611        .F      MOV      r1,r2
        0x080059d2:    f8d402c4    ....    LDR      r0,[r4,#0x2c4]
        0x080059d6:    f7fbffa9    ....    BL       HAL_PCDEx_PMAConfig ; 0x800192c
        0x080059da:    2358        X#      MOVS     r3,#0x58
        0x080059dc:    2200        ."      MOVS     r2,#0
        0x080059de:    2180        .!      MOVS     r1,#0x80
        0x080059e0:    f8d402c4    ....    LDR      r0,[r4,#0x2c4]
        0x080059e4:    f7fbffa2    ....    BL       HAL_PCDEx_PMAConfig ; 0x800192c
        0x080059e8:    23c0        .#      MOVS     r3,#0xc0
        0x080059ea:    2200        ."      MOVS     r2,#0
        0x080059ec:    2181        .!      MOVS     r1,#0x81
        0x080059ee:    f8d402c4    ....    LDR      r0,[r4,#0x2c4]
        0x080059f2:    f7fbff9b    ....    BL       HAL_PCDEx_PMAConfig ; 0x800192c
        0x080059f6:    f44f7388    O..s    MOV      r3,#0x110
        0x080059fa:    2200        ."      MOVS     r2,#0
        0x080059fc:    2101        .!      MOVS     r1,#1
        0x080059fe:    f8d402c4    ....    LDR      r0,[r4,#0x2c4]
        0x08005a02:    f7fbff93    ....    BL       HAL_PCDEx_PMAConfig ; 0x800192c
        0x08005a06:    f44f7380    O..s    MOV      r3,#0x100
        0x08005a0a:    2200        ."      MOVS     r2,#0
        0x08005a0c:    2182        .!      MOVS     r1,#0x82
        0x08005a0e:    f8d402c4    ....    LDR      r0,[r4,#0x2c4]
        0x08005a12:    f7fbff8b    ....    BL       HAL_PCDEx_PMAConfig ; 0x800192c
        0x08005a16:    2000        .       MOVS     r0,#0
        0x08005a18:    bd10        ..      POP      {r4,pc}
    $d
        0x08005a1a:    0000        ..      DCW    0
        0x08005a1c:    20000fcc    ...     DCD    536874956
        0x08005a20:    40005c00    .\.@    DCD    1073765376
    $t
    i.USBD_LL_IsStallEP
    USBD_LL_IsStallEP
        0x08005a24:    f0110f80    ....    TST      r1,#0x80
        0x08005a28:    f001017f    ....    AND      r1,r1,#0x7f
        0x08005a2c:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005a30:    eb010181    ....    ADD      r1,r1,r1,LSL #2
        0x08005a34:    eb0000c1    ....    ADD      r0,r0,r1,LSL #3
        0x08005a38:    bf14        ..      ITE      NE
        0x08005a3a:    7c80        .|      LDRBNE   r0,[r0,#0x12]
        0x08005a3c:    f8900152    ..R.    LDRBEQ   r0,[r0,#0x152]
        0x08005a40:    4770        pG      BX       lr
    i.USBD_LL_OpenEP
    USBD_LL_OpenEP
        0x08005a42:    b510        ..      PUSH     {r4,lr}
        0x08005a44:    469c        .F      MOV      r12,r3
        0x08005a46:    4613        .F      MOV      r3,r2
        0x08005a48:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005a4c:    4662        bF      MOV      r2,r12
        0x08005a4e:    f7fbfff7    ....    BL       HAL_PCD_EP_Open ; 0x8001a40
        0x08005a52:    0001        ..      MOVS     r1,r0
        0x08005a54:    f04f0000    O...    MOV      r0,#0
        0x08005a58:    bf08        ..      IT       EQ
        0x08005a5a:    bd10        ..      POPEQ    {r4,pc}
        0x08005a5c:    2901        .)      CMP      r1,#1
        0x08005a5e:    d003        ..      BEQ      0x8005a68 ; USBD_LL_OpenEP + 38
        0x08005a60:    2902        .)      CMP      r1,#2
        0x08005a62:    bf04        ..      ITT      EQ
        0x08005a64:    2001        .       MOVEQ    r0,#1
        0x08005a66:    bd10        ..      POPEQ    {r4,pc}
        0x08005a68:    2003        .       MOVS     r0,#3
        0x08005a6a:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_PrepareReceive
    USBD_LL_PrepareReceive
        0x08005a6c:    b510        ..      PUSH     {r4,lr}
        0x08005a6e:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005a72:    f7fcf814    ....    BL       HAL_PCD_EP_Receive ; 0x8001a9e
        0x08005a76:    0001        ..      MOVS     r1,r0
        0x08005a78:    f04f0000    O...    MOV      r0,#0
        0x08005a7c:    bf08        ..      IT       EQ
        0x08005a7e:    bd10        ..      POPEQ    {r4,pc}
        0x08005a80:    2901        .)      CMP      r1,#1
        0x08005a82:    d003        ..      BEQ      0x8005a8c ; USBD_LL_PrepareReceive + 32
        0x08005a84:    2902        .)      CMP      r1,#2
        0x08005a86:    bf04        ..      ITT      EQ
        0x08005a88:    2001        .       MOVEQ    r0,#1
        0x08005a8a:    bd10        ..      POPEQ    {r4,pc}
        0x08005a8c:    2003        .       MOVS     r0,#3
        0x08005a8e:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_Reset
    USBD_LL_Reset
        0x08005a90:    b570        p.      PUSH     {r4-r6,lr}
        0x08005a92:    2501        .%      MOVS     r5,#1
        0x08005a94:    4604        .F      MOV      r4,r0
        0x08005a96:    f880529c    ...R    STRB     r5,[r0,#0x29c]
        0x08005a9a:    2000        .       MOVS     r0,#0
        0x08005a9c:    f8c40294    ....    STR      r0,[r4,#0x294]
        0x08005aa0:    6060        ``      STR      r0,[r4,#4]
        0x08005aa2:    f8c402a4    ....    STR      r0,[r4,#0x2a4]
        0x08005aa6:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08005aaa:    2800        .(      CMP      r0,#0
        0x08005aac:    bf04        ..      ITT      EQ
        0x08005aae:    2003        .       MOVEQ    r0,#3
        0x08005ab0:    bd70        p.      POPEQ    {r4-r6,pc}
        0x08005ab2:    f8d412bc    ....    LDR      r1,[r4,#0x2bc]
        0x08005ab6:    2900        .)      CMP      r1,#0
        0x08005ab8:    bf1c        ..      ITT      NE
        0x08005aba:    6842        Bh      LDRNE    r2,[r0,#4]
        0x08005abc:    2a00        .*      CMPNE    r2,#0
        0x08005abe:    d003        ..      BEQ      0x8005ac8 ; USBD_LL_Reset + 56
        0x08005ac0:    f04f0100    O...    MOV      r1,#0
        0x08005ac4:    4620         F      MOV      r0,r4
        0x08005ac6:    4790        .G      BLX      r2
        0x08005ac8:    2200        ."      MOVS     r2,#0
        0x08005aca:    2340        @#      MOVS     r3,#0x40
        0x08005acc:    4611        .F      MOV      r1,r2
        0x08005ace:    4620         F      MOV      r0,r4
        0x08005ad0:    f7ffffb7    ....    BL       USBD_LL_OpenEP ; 0x8005a42
        0x08005ad4:    2640        @&      MOVS     r6,#0x40
        0x08005ad6:    f8a45164    ..dQ    STRH     r5,[r4,#0x164]
        0x08005ada:    4633        3F      MOV      r3,r6
        0x08005adc:    2200        ."      MOVS     r2,#0
        0x08005ade:    2180        .!      MOVS     r1,#0x80
        0x08005ae0:    4620         F      MOV      r0,r4
        0x08005ae2:    f8c46160    ..`a    STR      r6,[r4,#0x160]
        0x08005ae6:    f7ffffac    ....    BL       USBD_LL_OpenEP ; 0x8005a42
        0x08005aea:    84a5        ..      STRH     r5,[r4,#0x24]
        0x08005aec:    2000        .       MOVS     r0,#0
        0x08005aee:    6226        &b      STR      r6,[r4,#0x20]
        0x08005af0:    bd70        p.      POP      {r4-r6,pc}
    i.USBD_LL_Resume
    USBD_LL_Resume
        0x08005af2:    f890129c    ....    LDRB     r1,[r0,#0x29c]
        0x08005af6:    2904        .)      CMP      r1,#4
        0x08005af8:    bf04        ..      ITT      EQ
        0x08005afa:    f890129d    ....    LDRBEQ   r1,[r0,#0x29d]
        0x08005afe:    f880129c    ....    STRBEQ   r1,[r0,#0x29c]
        0x08005b02:    2000        .       MOVS     r0,#0
        0x08005b04:    4770        pG      BX       lr
    i.USBD_LL_SOF
    USBD_LL_SOF
        0x08005b06:    b510        ..      PUSH     {r4,lr}
        0x08005b08:    f8d012b8    ....    LDR      r1,[r0,#0x2b8]
        0x08005b0c:    2900        .)      CMP      r1,#0
        0x08005b0e:    bf04        ..      ITT      EQ
        0x08005b10:    2003        .       MOVEQ    r0,#3
        0x08005b12:    bd10        ..      POPEQ    {r4,pc}
        0x08005b14:    f890229c    ..."    LDRB     r2,[r0,#0x29c]
        0x08005b18:    2a03        .*      CMP      r2,#3
        0x08005b1a:    d103        ..      BNE      0x8005b24 ; USBD_LL_SOF + 30
        0x08005b1c:    69c9        .i      LDR      r1,[r1,#0x1c]
        0x08005b1e:    2900        .)      CMP      r1,#0
        0x08005b20:    bf18        ..      IT       NE
        0x08005b22:    4788        .G      BLXNE    r1
        0x08005b24:    2000        .       MOVS     r0,#0
        0x08005b26:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_SetSpeed
    USBD_LL_SetSpeed
        0x08005b28:    7401        .t      STRB     r1,[r0,#0x10]
        0x08005b2a:    2000        .       MOVS     r0,#0
        0x08005b2c:    4770        pG      BX       lr
    i.USBD_LL_SetUSBAddress
    USBD_LL_SetUSBAddress
        0x08005b2e:    b510        ..      PUSH     {r4,lr}
        0x08005b30:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005b34:    f7fcf96c    ..l.    BL       HAL_PCD_SetAddress ; 0x8001e10
        0x08005b38:    0001        ..      MOVS     r1,r0
        0x08005b3a:    f04f0000    O...    MOV      r0,#0
        0x08005b3e:    bf08        ..      IT       EQ
        0x08005b40:    bd10        ..      POPEQ    {r4,pc}
        0x08005b42:    2901        .)      CMP      r1,#1
        0x08005b44:    d003        ..      BEQ      0x8005b4e ; USBD_LL_SetUSBAddress + 32
        0x08005b46:    2902        .)      CMP      r1,#2
        0x08005b48:    bf04        ..      ITT      EQ
        0x08005b4a:    2001        .       MOVEQ    r0,#1
        0x08005b4c:    bd10        ..      POPEQ    {r4,pc}
        0x08005b4e:    2003        .       MOVS     r0,#3
        0x08005b50:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_SetupStage
    USBD_LL_SetupStage
        0x08005b52:    b510        ..      PUSH     {r4,lr}
        0x08005b54:    4604        .F      MOV      r4,r0
        0x08005b56:    f20020aa    ...     ADD      r0,r0,#0x2aa
        0x08005b5a:    f000f86b    ..k.    BL       USBD_ParseSetupRequest ; 0x8005c34
        0x08005b5e:    2001        .       MOVS     r0,#1
        0x08005b60:    f8c40294    ....    STR      r0,[r4,#0x294]
        0x08005b64:    f8b402b0    ....    LDRH     r0,[r4,#0x2b0]
        0x08005b68:    f8c40298    ....    STR      r0,[r4,#0x298]
        0x08005b6c:    f89402aa    ....    LDRB     r0,[r4,#0x2aa]
        0x08005b70:    f010011f    ....    ANDS     r1,r0,#0x1f
        0x08005b74:    d00a        ..      BEQ      0x8005b8c ; USBD_LL_SetupStage + 58
        0x08005b76:    2901        .)      CMP      r1,#1
        0x08005b78:    d00f        ..      BEQ      0x8005b9a ; USBD_LL_SetupStage + 72
        0x08005b7a:    2902        .)      CMP      r1,#2
        0x08005b7c:    d014        ..      BEQ      0x8005ba8 ; USBD_LL_SetupStage + 86
        0x08005b7e:    f0000180    ....    AND      r1,r0,#0x80
        0x08005b82:    4620         F      MOV      r0,r4
        0x08005b84:    e8bd4010    ...@    POP      {r4,lr}
        0x08005b88:    f000b815    ....    B.W      USBD_LL_StallEP ; 0x8005bb6
        0x08005b8c:    f20421aa    ...!    ADD      r1,r4,#0x2aa
        0x08005b90:    4620         F      MOV      r0,r4
        0x08005b92:    e8bd4010    ...@    POP      {r4,lr}
        0x08005b96:    f000b883    ....    B.W      USBD_StdDevReq ; 0x8005ca0
        0x08005b9a:    f20421aa    ...!    ADD      r1,r4,#0x2aa
        0x08005b9e:    4620         F      MOV      r0,r4
        0x08005ba0:    e8bd4010    ...@    POP      {r4,lr}
        0x08005ba4:    f000baae    ....    B.W      USBD_StdItfReq ; 0x8006104
        0x08005ba8:    f20421aa    ...!    ADD      r1,r4,#0x2aa
        0x08005bac:    4620         F      MOV      r0,r4
        0x08005bae:    e8bd4010    ...@    POP      {r4,lr}
        0x08005bb2:    f000b9f1    ....    B.W      USBD_StdEPReq ; 0x8005f98
    i.USBD_LL_StallEP
    USBD_LL_StallEP
        0x08005bb6:    b510        ..      PUSH     {r4,lr}
        0x08005bb8:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005bbc:    f7fbff86    ....    BL       HAL_PCD_EP_SetStall ; 0x8001acc
        0x08005bc0:    0001        ..      MOVS     r1,r0
        0x08005bc2:    f04f0000    O...    MOV      r0,#0
        0x08005bc6:    bf08        ..      IT       EQ
        0x08005bc8:    bd10        ..      POPEQ    {r4,pc}
        0x08005bca:    2901        .)      CMP      r1,#1
        0x08005bcc:    d003        ..      BEQ      0x8005bd6 ; USBD_LL_StallEP + 32
        0x08005bce:    2902        .)      CMP      r1,#2
        0x08005bd0:    bf04        ..      ITT      EQ
        0x08005bd2:    2001        .       MOVEQ    r0,#1
        0x08005bd4:    bd10        ..      POPEQ    {r4,pc}
        0x08005bd6:    2003        .       MOVS     r0,#3
        0x08005bd8:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_Start
    USBD_LL_Start
        0x08005bda:    b510        ..      PUSH     {r4,lr}
        0x08005bdc:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005be0:    f7fcf930    ..0.    BL       HAL_PCD_Start ; 0x8001e44
        0x08005be4:    0001        ..      MOVS     r1,r0
        0x08005be6:    f04f0000    O...    MOV      r0,#0
        0x08005bea:    bf08        ..      IT       EQ
        0x08005bec:    bd10        ..      POPEQ    {r4,pc}
        0x08005bee:    2901        .)      CMP      r1,#1
        0x08005bf0:    d003        ..      BEQ      0x8005bfa ; USBD_LL_Start + 32
        0x08005bf2:    2902        .)      CMP      r1,#2
        0x08005bf4:    bf04        ..      ITT      EQ
        0x08005bf6:    2001        .       MOVEQ    r0,#1
        0x08005bf8:    bd10        ..      POPEQ    {r4,pc}
        0x08005bfa:    2003        .       MOVS     r0,#3
        0x08005bfc:    bd10        ..      POP      {r4,pc}
    i.USBD_LL_Suspend
    USBD_LL_Suspend
        0x08005bfe:    f890129c    ....    LDRB     r1,[r0,#0x29c]
        0x08005c02:    f880129d    ....    STRB     r1,[r0,#0x29d]
        0x08005c06:    2104        .!      MOVS     r1,#4
        0x08005c08:    f880129c    ....    STRB     r1,[r0,#0x29c]
        0x08005c0c:    2000        .       MOVS     r0,#0
        0x08005c0e:    4770        pG      BX       lr
    i.USBD_LL_Transmit
    USBD_LL_Transmit
        0x08005c10:    b510        ..      PUSH     {r4,lr}
        0x08005c12:    f8d002c4    ....    LDR      r0,[r0,#0x2c4]
        0x08005c16:    f7fbff87    ....    BL       HAL_PCD_EP_Transmit ; 0x8001b28
        0x08005c1a:    0001        ..      MOVS     r1,r0
        0x08005c1c:    f04f0000    O...    MOV      r0,#0
        0x08005c20:    bf08        ..      IT       EQ
        0x08005c22:    bd10        ..      POPEQ    {r4,pc}
        0x08005c24:    2901        .)      CMP      r1,#1
        0x08005c26:    d003        ..      BEQ      0x8005c30 ; USBD_LL_Transmit + 32
        0x08005c28:    2902        .)      CMP      r1,#2
        0x08005c2a:    bf04        ..      ITT      EQ
        0x08005c2c:    2001        .       MOVEQ    r0,#1
        0x08005c2e:    bd10        ..      POPEQ    {r4,pc}
        0x08005c30:    2003        .       MOVS     r0,#3
        0x08005c32:    bd10        ..      POP      {r4,pc}
    i.USBD_ParseSetupRequest
    USBD_ParseSetupRequest
        0x08005c34:    f8112b01    ...+    LDRB     r2,[r1],#1
        0x08005c38:    7002        .p      STRB     r2,[r0,#0]
        0x08005c3a:    f8112b01    ...+    LDRB     r2,[r1],#1
        0x08005c3e:    7042        Bp      STRB     r2,[r0,#1]
        0x08005c40:    780b        .x      LDRB     r3,[r1,#0]
        0x08005c42:    784a        Jx      LDRB     r2,[r1,#1]
        0x08005c44:    ea432202    C.."    ORR      r2,r3,r2,LSL #8
        0x08005c48:    8042        B.      STRH     r2,[r0,#2]
        0x08005c4a:    f8113f02    ...?    LDRB     r3,[r1,#2]!
        0x08005c4e:    784a        Jx      LDRB     r2,[r1,#1]
        0x08005c50:    ea432202    C.."    ORR      r2,r3,r2,LSL #8
        0x08005c54:    8082        ..      STRH     r2,[r0,#4]
        0x08005c56:    788a        .x      LDRB     r2,[r1,#2]
        0x08005c58:    78c9        .x      LDRB     r1,[r1,#3]
        0x08005c5a:    ea422101    B..!    ORR      r1,r2,r1,LSL #8
        0x08005c5e:    80c1        ..      STRH     r1,[r0,#6]
        0x08005c60:    4770        pG      BX       lr
    i.USBD_RegisterClass
    USBD_RegisterClass
        0x08005c62:    b538        8.      PUSH     {r3-r5,lr}
        0x08005c64:    4604        .F      MOV      r4,r0
        0x08005c66:    2000        .       MOVS     r0,#0
        0x08005c68:    f8ad0000    ....    STRH     r0,[sp,#0]
        0x08005c6c:    2900        .)      CMP      r1,#0
        0x08005c6e:    bf04        ..      ITT      EQ
        0x08005c70:    2003        .       MOVEQ    r0,#3
        0x08005c72:    bd38        8.      POPEQ    {r3-r5,pc}
        0x08005c74:    f8c412b8    ....    STR      r1,[r4,#0x2b8]
        0x08005c78:    6ac9        .j      LDR      r1,[r1,#0x2c]
        0x08005c7a:    b119        ..      CBZ      r1,0x8005c84 ; USBD_RegisterClass + 34
        0x08005c7c:    4668        hF      MOV      r0,sp
        0x08005c7e:    4788        .G      BLX      r1
        0x08005c80:    f8c402cc    ....    STR      r0,[r4,#0x2cc]
        0x08005c84:    2000        .       MOVS     r0,#0
        0x08005c86:    bd38        8.      POP      {r3-r5,pc}
    i.USBD_SetClassConfig
    USBD_SetClassConfig
        0x08005c88:    4602        .F      MOV      r2,r0
        0x08005c8a:    2003        .       MOVS     r0,#3
        0x08005c8c:    f8d232b8    ...2    LDR      r3,[r2,#0x2b8]
        0x08005c90:    2b00        .+      CMP      r3,#0
        0x08005c92:    bf08        ..      IT       EQ
        0x08005c94:    4770        pG      BXEQ     lr
        0x08005c96:    681b        .h      LDR      r3,[r3,#0]
        0x08005c98:    4610        .F      MOV      r0,r2
        0x08005c9a:    4718        .G      BX       r3
    i.USBD_Start
    USBD_Start
        0x08005c9c:    f7ffbf9d    ....    B.W      USBD_LL_Start ; 0x8005bda
    i.USBD_StdDevReq
    USBD_StdDevReq
        0x08005ca0:    b5f8        ..      PUSH     {r3-r7,lr}
        0x08005ca2:    460d        .F      MOV      r5,r1
        0x08005ca4:    7809        .x      LDRB     r1,[r1,#0]
        0x08005ca6:    2600        .&      MOVS     r6,#0
        0x08005ca8:    f0110160    ..`.    ANDS     r1,r1,#0x60
        0x08005cac:    d00c        ..      BEQ      0x8005cc8 ; USBD_StdDevReq + 40
        0x08005cae:    2920         )      CMP      r1,#0x20
        0x08005cb0:    bf18        ..      IT       NE
        0x08005cb2:    2940        @)      CMPNE    r1,#0x40
        0x08005cb4:    f0408131    @.1.    BNE.W    0x8005f1a ; USBD_StdDevReq + 634
        0x08005cb8:    f8d012b8    ....    LDR      r1,[r0,#0x2b8]
        0x08005cbc:    688a        .h      LDR      r2,[r1,#8]
        0x08005cbe:    4629        )F      MOV      r1,r5
        0x08005cc0:    4790        .G      BLX      r2
        0x08005cc2:    4606        .F      MOV      r6,r0
        0x08005cc4:    f000b931    ..1.    B.W      0x8005f2a ; USBD_StdDevReq + 650
        0x08005cc8:    7869        ix      LDRB     r1,[r5,#1]
        0x08005cca:    290a        .)      CMP      r1,#0xa
        0x08005ccc:    f0808125    ..%.    BCS.W    0x8005f1a ; USBD_StdDevReq + 634
        0x08005cd0:    e8dff001    ....    TBB      [pc,r1]
    $d
        0x08005cd4:    fbfcfdfe    ....    DCD    4227661310
        0x08005cd8:    fc058efc    ....    DCD    4228222716
        0x08005cdc:    aefa        ..      DCW    44794
    $t
        0x08005cde:    4604        .F      MOV      r4,r0
        0x08005ce0:    2000        .       MOVS     r0,#0
        0x08005ce2:    f8ad0000    ....    STRH     r0,[sp,#0]
        0x08005ce6:    8869        i.      LDRH     r1,[r5,#2]
        0x08005ce8:    0a08        ..      LSRS     r0,r1,#8
        0x08005cea:    2806        .(      CMP      r0,#6
        0x08005cec:    d05a        Z.      BEQ      0x8005da4 ; USBD_StdDevReq + 260
        0x08005cee:    dc06        ..      BGT      0x8005cfe ; USBD_StdDevReq + 94
        0x08005cf0:    2801        .(      CMP      r0,#1
        0x08005cf2:    d00d        ..      BEQ      0x8005d10 ; USBD_StdDevReq + 112
        0x08005cf4:    2802        .(      CMP      r0,#2
        0x08005cf6:    d013        ..      BEQ      0x8005d20 ; USBD_StdDevReq + 128
        0x08005cf8:    2803        .(      CMP      r0,#3
        0x08005cfa:    d023        #.      BEQ      0x8005d44 ; USBD_StdDevReq + 164
        0x08005cfc:    e0c3        ..      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005cfe:    2807        .(      CMP      r0,#7
        0x08005d00:    d05a        Z.      BEQ      0x8005db8 ; USBD_StdDevReq + 280
        0x08005d02:    280f        .(      CMP      r0,#0xf
        0x08005d04:    d16f        o.      BNE      0x8005de6 ; USBD_StdDevReq + 326
        0x08005d06:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d0a:    69c2        .i      LDR      r2,[r0,#0x1c]
        0x08005d0c:    bb8a        ..      CBNZ     r2,0x8005d72 ; USBD_StdDevReq + 210
        0x08005d0e:    e0ba        ..      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005d10:    f8d412b4    ....    LDR      r1,[r4,#0x2b4]
        0x08005d14:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08005d16:    680a        .h      LDR      r2,[r1,#0]
        0x08005d18:    4669        iF      MOV      r1,sp
        0x08005d1a:    4790        .G      BLX      r2
