ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08005d1c:    4601        .F      MOV      r1,r0
        0x08005d1e:    e056        V.      B        0x8005dce ; USBD_StdDevReq + 302
        0x08005d20:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08005d22:    2800        .(      CMP      r0,#0
        0x08005d24:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08005d28:    d005        ..      BEQ      0x8005d36 ; USBD_StdDevReq + 150
        0x08005d2a:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x08005d2c:    4668        hF      MOV      r0,sp
        0x08005d2e:    4788        .G      BLX      r1
        0x08005d30:    4601        .F      MOV      r1,r0
        0x08005d32:    2002        .       MOVS     r0,#2
        0x08005d34:    e04a        J.      B        0x8005dcc ; USBD_StdDevReq + 300
        0x08005d36:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08005d38:    4668        hF      MOV      r0,sp
        0x08005d3a:    4788        .G      BLX      r1
        0x08005d3c:    4601        .F      MOV      r1,r0
        0x08005d3e:    2002        .       MOVS     r0,#2
        0x08005d40:    7048        Hp      STRB     r0,[r1,#1]
        0x08005d42:    e044        D.      B        0x8005dce ; USBD_StdDevReq + 302
        0x08005d44:    b2c8        ..      UXTB     r0,r1
        0x08005d46:    2806        .(      CMP      r0,#6
        0x08005d48:    d24d        M.      BCS      0x8005de6 ; USBD_StdDevReq + 326
        0x08005d4a:    e8dff000    ....    TBB      [pc,r0]
    $d
        0x08005d4e:    0803        ..      DCW    2051
        0x08005d50:    2218130d    ..."    DCD    572003085
    $t
        0x08005d54:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d58:    6842        Bh      LDR      r2,[r0,#4]
        0x08005d5a:    b952        R.      CBNZ     r2,0x8005d72 ; USBD_StdDevReq + 210
        0x08005d5c:    e093        ..      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005d5e:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d62:    6882        .h      LDR      r2,[r0,#8]
        0x08005d64:    b92a        *.      CBNZ     r2,0x8005d72 ; USBD_StdDevReq + 210
        0x08005d66:    e08e        ..      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005d68:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d6c:    68c2        .h      LDR      r2,[r0,#0xc]
        0x08005d6e:    b902        ..      CBNZ     r2,0x8005d72 ; USBD_StdDevReq + 210
        0x08005d70:    e089        ..      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005d72:    e009        ..      B        0x8005d88 ; USBD_StdDevReq + 232
        0x08005d74:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d78:    6902        .i      LDR      r2,[r0,#0x10]
        0x08005d7a:    b92a        *.      CBNZ     r2,0x8005d88 ; USBD_StdDevReq + 232
        0x08005d7c:    e083        ..      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005d7e:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d82:    6942        Bi      LDR      r2,[r0,#0x14]
        0x08005d84:    2a00        .*      CMP      r2,#0
        0x08005d86:    d07e        ~.      BEQ      0x8005e86 ; USBD_StdDevReq + 486
        0x08005d88:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08005d8a:    4669        iF      MOV      r1,sp
        0x08005d8c:    4790        .G      BLX      r2
        0x08005d8e:    4601        .F      MOV      r1,r0
        0x08005d90:    e01d        ..      B        0x8005dce ; USBD_StdDevReq + 302
        0x08005d92:    f8d402b4    ....    LDR      r0,[r4,#0x2b4]
        0x08005d96:    6982        .i      LDR      r2,[r0,#0x18]
        0x08005d98:    2a00        .*      CMP      r2,#0
        0x08005d9a:    d074        t.      BEQ      0x8005e86 ; USBD_StdDevReq + 486
        0x08005d9c:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08005d9e:    4669        iF      MOV      r1,sp
        0x08005da0:    4790        .G      BLX      r2
        0x08005da2:    e007        ..      B        0x8005db4 ; USBD_StdDevReq + 276
        0x08005da4:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08005da6:    2800        .(      CMP      r0,#0
        0x08005da8:    d16d        m.      BNE      0x8005e86 ; USBD_StdDevReq + 486
        0x08005daa:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08005dae:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08005db0:    4668        hF      MOV      r0,sp
        0x08005db2:    4788        .G      BLX      r1
        0x08005db4:    4601        .F      MOV      r1,r0
        0x08005db6:    e00a        ..      B        0x8005dce ; USBD_StdDevReq + 302
        0x08005db8:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08005dba:    2800        .(      CMP      r0,#0
        0x08005dbc:    d163        c.      BNE      0x8005e86 ; USBD_StdDevReq + 486
        0x08005dbe:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08005dc2:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08005dc4:    4668        hF      MOV      r0,sp
        0x08005dc6:    4788        .G      BLX      r1
        0x08005dc8:    4601        .F      MOV      r1,r0
        0x08005dca:    2007        .       MOVS     r0,#7
        0x08005dcc:    7048        Hp      STRB     r0,[r1,#1]
        0x08005dce:    88ea        ..      LDRH     r2,[r5,#6]
        0x08005dd0:    b152        R.      CBZ      r2,0x8005de8 ; USBD_StdDevReq + 328
        0x08005dd2:    f8bd0000    ....    LDRH     r0,[sp,#0]
        0x08005dd6:    b130        0.      CBZ      r0,0x8005de6 ; USBD_StdDevReq + 326
        0x08005dd8:    4282        .B      CMP      r2,r0
        0x08005dda:    bf88        ..      IT       HI
        0x08005ddc:    4602        .F      MOVHI    r2,r0
        0x08005dde:    f8ad2000    ...     STRH     r2,[sp,#0]
        0x08005de2:    4620         F      MOV      r0,r4
        0x08005de4:    e0a8        ..      B        0x8005f38 ; USBD_StdDevReq + 664
        0x08005de6:    e04e        N.      B        0x8005e86 ; USBD_StdDevReq + 486
        0x08005de8:    4620         F      MOV      r0,r4
        0x08005dea:    f7fffcc3    ....    BL       USBD_CtlSendStatus ; 0x8005774
        0x08005dee:    e09c        ..      B        0x8005f2a ; USBD_StdDevReq + 650
        0x08005df0:    4604        .F      MOV      r4,r0
        0x08005df2:    88a8        ..      LDRH     r0,[r5,#4]
        0x08005df4:    2800        .(      CMP      r0,#0
        0x08005df6:    bf04        ..      ITT      EQ
        0x08005df8:    88e8        ..      LDRHEQ   r0,[r5,#6]
        0x08005dfa:    2800        .(      CMPEQ    r0,#0
        0x08005dfc:    d143        C.      BNE      0x8005e86 ; USBD_StdDevReq + 486
        0x08005dfe:    8868        h.      LDRH     r0,[r5,#2]
        0x08005e00:    2880        .(      CMP      r0,#0x80
        0x08005e02:    d240        @.      BCS      0x8005e86 ; USBD_StdDevReq + 486
        0x08005e04:    f000057f    ....    AND      r5,r0,#0x7f
        0x08005e08:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x08005e0c:    2803        .(      CMP      r0,#3
        0x08005e0e:    d03a        :.      BEQ      0x8005e86 ; USBD_StdDevReq + 486
        0x08005e10:    f884529e    ...R    STRB     r5,[r4,#0x29e]
        0x08005e14:    4629        )F      MOV      r1,r5
        0x08005e16:    4620         F      MOV      r0,r4
        0x08005e18:    f7fffe89    ....    BL       USBD_LL_SetUSBAddress ; 0x8005b2e
        0x08005e1c:    4620         F      MOV      r0,r4
        0x08005e1e:    f7fffca9    ....    BL       USBD_CtlSendStatus ; 0x8005774
        0x08005e22:    2d00        .-      CMP      r5,#0
        0x08005e24:    bf0c        ..      ITE      EQ
        0x08005e26:    2001        .       MOVEQ    r0,#1
        0x08005e28:    2002        .       MOVNE    r0,#2
        0x08005e2a:    f884029c    ....    STRB     r0,[r4,#0x29c]
        0x08005e2e:    e07c        |.      B        0x8005f2a ; USBD_StdDevReq + 650
        0x08005e30:    78a9        .x      LDRB     r1,[r5,#2]
        0x08005e32:    4d58        XM      LDR      r5,[pc,#352] ; [0x8005f94] = 0x20000154
        0x08005e34:    2600        .&      MOVS     r6,#0
        0x08005e36:    4604        .F      MOV      r4,r0
        0x08005e38:    7029        )p      STRB     r1,[r5,#0]
        0x08005e3a:    2901        .)      CMP      r1,#1
        0x08005e3c:    d908        ..      BLS      0x8005e50 ; USBD_StdDevReq + 432
        0x08005e3e:    2180        .!      MOVS     r1,#0x80
        0x08005e40:    4620         F      MOV      r0,r4
        0x08005e42:    f7fffeb8    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005e46:    2100        .!      MOVS     r1,#0
        0x08005e48:    4620         F      MOV      r0,r4
        0x08005e4a:    f7fffeb4    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005e4e:    e011        ..      B        0x8005e74 ; USBD_StdDevReq + 468
        0x08005e50:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x08005e54:    2802        .(      CMP      r0,#2
        0x08005e56:    d00f        ..      BEQ      0x8005e78 ; USBD_StdDevReq + 472
        0x08005e58:    2803        .(      CMP      r0,#3
        0x08005e5a:    d024        $.      BEQ      0x8005ea6 ; USBD_StdDevReq + 518
        0x08005e5c:    2180        .!      MOVS     r1,#0x80
        0x08005e5e:    4620         F      MOV      r0,r4
        0x08005e60:    f7fffea9    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005e64:    2100        .!      MOVS     r1,#0
        0x08005e66:    4620         F      MOV      r0,r4
        0x08005e68:    f7fffea5    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005e6c:    7829        )x      LDRB     r1,[r5,#0]
        0x08005e6e:    4620         F      MOV      r0,r4
        0x08005e70:    f7fffc35    ..5.    BL       USBD_ClrClassConfig ; 0x80056de
        0x08005e74:    2603        .&      MOVS     r6,#3
        0x08005e76:    e058        X.      B        0x8005f2a ; USBD_StdDevReq + 650
        0x08005e78:    b199        ..      CBZ      r1,0x8005ea2 ; USBD_StdDevReq + 514
        0x08005e7a:    4620         F      MOV      r0,r4
        0x08005e7c:    6061        a`      STR      r1,[r4,#4]
        0x08005e7e:    f7ffff03    ....    BL       USBD_SetClassConfig ; 0x8005c88
        0x08005e82:    0006        ..      MOVS     r6,r0
        0x08005e84:    d008        ..      BEQ      0x8005e98 ; USBD_StdDevReq + 504
        0x08005e86:    2180        .!      MOVS     r1,#0x80
        0x08005e88:    4620         F      MOV      r0,r4
        0x08005e8a:    f7fffe94    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005e8e:    2100        .!      MOVS     r1,#0
        0x08005e90:    4620         F      MOV      r0,r4
        0x08005e92:    f7fffe90    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005e96:    e048        H.      B        0x8005f2a ; USBD_StdDevReq + 650
        0x08005e98:    4620         F      MOV      r0,r4
        0x08005e9a:    f7fffc6b    ..k.    BL       USBD_CtlSendStatus ; 0x8005774
        0x08005e9e:    2003        .       MOVS     r0,#3
        0x08005ea0:    e7c3        ..      B        0x8005e2a ; USBD_StdDevReq + 394
        0x08005ea2:    4620         F      MOV      r0,r4
        0x08005ea4:    e066        f.      B        0x8005f74 ; USBD_StdDevReq + 724
        0x08005ea6:    b309        ..      CBZ      r1,0x8005eec ; USBD_StdDevReq + 588
        0x08005ea8:    6860        `h      LDR      r0,[r4,#4]
        0x08005eaa:    4288        .B      CMP      r0,r1
        0x08005eac:    d0f9        ..      BEQ      0x8005ea2 ; USBD_StdDevReq + 514
        0x08005eae:    b2c1        ..      UXTB     r1,r0
        0x08005eb0:    4620         F      MOV      r0,r4
        0x08005eb2:    f7fffc14    ....    BL       USBD_ClrClassConfig ; 0x80056de
        0x08005eb6:    7829        )x      LDRB     r1,[r5,#0]
        0x08005eb8:    4620         F      MOV      r0,r4
        0x08005eba:    6061        a`      STR      r1,[r4,#4]
        0x08005ebc:    f7fffee4    ....    BL       USBD_SetClassConfig ; 0x8005c88
        0x08005ec0:    0006        ..      MOVS     r6,r0
        0x08005ec2:    d0ee        ..      BEQ      0x8005ea2 ; USBD_StdDevReq + 514
        0x08005ec4:    2180        .!      MOVS     r1,#0x80
        0x08005ec6:    e004        ..      B        0x8005ed2 ; USBD_StdDevReq + 562
        0x08005ec8:    e019        ..      B        0x8005efe ; USBD_StdDevReq + 606
        0x08005eca:    e04e        N.      B        0x8005f6a ; USBD_StdDevReq + 714
        0x08005ecc:    e025        %.      B        0x8005f1a ; USBD_StdDevReq + 634
        0x08005ece:    e054        T.      B        0x8005f7a ; USBD_StdDevReq + 730
        0x08005ed0:    e035        5.      B        0x8005f3e ; USBD_StdDevReq + 670
        0x08005ed2:    4620         F      MOV      r0,r4
        0x08005ed4:    f7fffe6f    ..o.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005ed8:    2100        .!      MOVS     r1,#0
        0x08005eda:    4620         F      MOV      r0,r4
        0x08005edc:    f7fffe6b    ..k.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005ee0:    7921        !y      LDRB     r1,[r4,#4]
        0x08005ee2:    4620         F      MOV      r0,r4
        0x08005ee4:    f7fffbfb    ....    BL       USBD_ClrClassConfig ; 0x80056de
        0x08005ee8:    2002        .       MOVS     r0,#2
        0x08005eea:    e79e        ..      B        0x8005e2a ; USBD_StdDevReq + 394
        0x08005eec:    2002        .       MOVS     r0,#2
        0x08005eee:    f884029c    ....    STRB     r0,[r4,#0x29c]
        0x08005ef2:    4620         F      MOV      r0,r4
        0x08005ef4:    6061        a`      STR      r1,[r4,#4]
        0x08005ef6:    f7fffbf2    ....    BL       USBD_ClrClassConfig ; 0x80056de
        0x08005efa:    4620         F      MOV      r0,r4
        0x08005efc:    e03a        :.      B        0x8005f74 ; USBD_StdDevReq + 724
        0x08005efe:    88e9        ..      LDRH     r1,[r5,#6]
        0x08005f00:    2901        .)      CMP      r1,#1
        0x08005f02:    d10a        ..      BNE      0x8005f1a ; USBD_StdDevReq + 634
        0x08005f04:    f890129c    ....    LDRB     r1,[r0,#0x29c]
        0x08005f08:    2901        .)      CMP      r1,#1
        0x08005f0a:    bf18        ..      IT       NE
        0x08005f0c:    2902        .)      CMPNE    r1,#2
        0x08005f0e:    d00e        ..      BEQ      0x8005f2e ; USBD_StdDevReq + 654
        0x08005f10:    2903        .)      CMP      r1,#3
        0x08005f12:    bf04        ..      ITT      EQ
        0x08005f14:    2201        ."      MOVEQ    r2,#1
        0x08005f16:    1d01        ..      ADDEQ    r1,r0,#4
        0x08005f18:    d00e        ..      BEQ      0x8005f38 ; USBD_StdDevReq + 664
        0x08005f1a:    4604        .F      MOV      r4,r0
        0x08005f1c:    2180        .!      MOVS     r1,#0x80
        0x08005f1e:    f7fffe4a    ..J.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005f22:    2100        .!      MOVS     r1,#0
        0x08005f24:    4620         F      MOV      r0,r4
        0x08005f26:    f7fffe46    ..F.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005f2a:    4630        0F      MOV      r0,r6
        0x08005f2c:    bdf8        ..      POP      {r3-r7,pc}
        0x08005f2e:    2100        .!      MOVS     r1,#0
        0x08005f30:    6081        .`      STR      r1,[r0,#8]
        0x08005f32:    2201        ."      MOVS     r2,#1
        0x08005f34:    f1000108    ....    ADD      r1,r0,#8
        0x08005f38:    f7fffc0f    ....    BL       USBD_CtlSendData ; 0x800575a
        0x08005f3c:    e7f5        ..      B        0x8005f2a ; USBD_StdDevReq + 650
        0x08005f3e:    f890129c    ....    LDRB     r1,[r0,#0x29c]
        0x08005f42:    2901        .)      CMP      r1,#1
        0x08005f44:    bf19        ..      ITTEE    NE
        0x08005f46:    2902        .)      CMPNE    r1,#2
        0x08005f48:    2903        .)      CMPNE    r1,#3
        0x08005f4a:    88e9        ..      LDRHEQ   r1,[r5,#6]
        0x08005f4c:    2902        .)      CMPEQ    r1,#2
        0x08005f4e:    d1e4        ..      BNE      0x8005f1a ; USBD_StdDevReq + 634
        0x08005f50:    f04f0101    O...    MOV      r1,#1
        0x08005f54:    60c1        .`      STR      r1,[r0,#0xc]
        0x08005f56:    f8d012a4    ....    LDR      r1,[r0,#0x2a4]
        0x08005f5a:    2900        .)      CMP      r1,#0
        0x08005f5c:    bf1c        ..      ITT      NE
        0x08005f5e:    2103        .!      MOVNE    r1,#3
        0x08005f60:    60c1        .`      STRNE    r1,[r0,#0xc]
        0x08005f62:    2202        ."      MOVS     r2,#2
        0x08005f64:    f100010c    ....    ADD      r1,r0,#0xc
        0x08005f68:    e7e6        ..      B        0x8005f38 ; USBD_StdDevReq + 664
        0x08005f6a:    8869        i.      LDRH     r1,[r5,#2]
        0x08005f6c:    2901        .)      CMP      r1,#1
        0x08005f6e:    d1dc        ..      BNE      0x8005f2a ; USBD_StdDevReq + 650
        0x08005f70:    f8c012a4    ....    STR      r1,[r0,#0x2a4]
        0x08005f74:    f7fffbfe    ....    BL       USBD_CtlSendStatus ; 0x8005774
        0x08005f78:    e7d7        ..      B        0x8005f2a ; USBD_StdDevReq + 650
        0x08005f7a:    f890129c    ....    LDRB     r1,[r0,#0x29c]
        0x08005f7e:    2901        .)      CMP      r1,#1
        0x08005f80:    bf1c        ..      ITT      NE
        0x08005f82:    2902        .)      CMPNE    r1,#2
        0x08005f84:    2903        .)      CMPNE    r1,#3
        0x08005f86:    d1c8        ..      BNE      0x8005f1a ; USBD_StdDevReq + 634
        0x08005f88:    8869        i.      LDRH     r1,[r5,#2]
        0x08005f8a:    2901        .)      CMP      r1,#1
        0x08005f8c:    bf08        ..      IT       EQ
        0x08005f8e:    2100        .!      MOVEQ    r1,#0
        0x08005f90:    d1cb        ..      BNE      0x8005f2a ; USBD_StdDevReq + 650
        0x08005f92:    e7ed        ..      B        0x8005f70 ; USBD_StdDevReq + 720
    $d
        0x08005f94:    20000154    T..     DCD    536871252
    $t
    i.USBD_StdEPReq
    USBD_StdEPReq
        0x08005f98:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08005f9c:    460d        .F      MOV      r5,r1
        0x08005f9e:    4604        .F      MOV      r4,r0
        0x08005fa0:    7828        (x      LDRB     r0,[r5,#0]
        0x08005fa2:    2600        .&      MOVS     r6,#0
        0x08005fa4:    7909        .y      LDRB     r1,[r1,#4]
        0x08005fa6:    f0100060    ..`.    ANDS     r0,r0,#0x60
        0x08005faa:    d00b        ..      BEQ      0x8005fc4 ; USBD_StdEPReq + 44
        0x08005fac:    2820         (      CMP      r0,#0x20
        0x08005fae:    bf18        ..      IT       NE
        0x08005fb0:    2840        @(      CMPNE    r0,#0x40
        0x08005fb2:    d151        Q.      BNE      0x8006058 ; USBD_StdEPReq + 192
        0x08005fb4:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08005fb8:    4629        )F      MOV      r1,r5
        0x08005fba:    6882        .h      LDR      r2,[r0,#8]
        0x08005fbc:    4620         F      MOV      r0,r4
        0x08005fbe:    4790        .G      BLX      r2
        0x08005fc0:    4606        .F      MOV      r6,r0
        0x08005fc2:    e09c        ..      B        0x80060fe ; USBD_StdEPReq + 358
        0x08005fc4:    7868        hx      LDRB     r0,[r5,#1]
        0x08005fc6:    2800        .(      CMP      r0,#0
        0x08005fc8:    d03f        ?.      BEQ      0x800604a ; USBD_StdEPReq + 178
        0x08005fca:    2801        .(      CMP      r0,#1
        0x08005fcc:    d024        $.      BEQ      0x8006018 ; USBD_StdEPReq + 128
        0x08005fce:    2803        .(      CMP      r0,#3
        0x08005fd0:    d142        B.      BNE      0x8006058 ; USBD_StdEPReq + 192
        0x08005fd2:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x08005fd6:    2802        .(      CMP      r0,#2
        0x08005fd8:    d002        ..      BEQ      0x8005fe0 ; USBD_StdEPReq + 72
        0x08005fda:    2803        .(      CMP      r0,#3
        0x08005fdc:    d00c        ..      BEQ      0x8005ff8 ; USBD_StdEPReq + 96
        0x08005fde:    e086        ..      B        0x80060ee ; USBD_StdEPReq + 342
        0x08005fe0:    2900        .)      CMP      r1,#0
        0x08005fe2:    bf18        ..      IT       NE
        0x08005fe4:    2980        .)      CMPNE    r1,#0x80
        0x08005fe6:    d037        7.      BEQ      0x8006058 ; USBD_StdEPReq + 192
        0x08005fe8:    4620         F      MOV      r0,r4
        0x08005fea:    f7fffde4    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005fee:    2180        .!      MOVS     r1,#0x80
        0x08005ff0:    4620         F      MOV      r0,r4
        0x08005ff2:    f7fffde0    ....    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08005ff6:    e082        ..      B        0x80060fe ; USBD_StdEPReq + 358
        0x08005ff8:    8868        h.      LDRH     r0,[r5,#2]
        0x08005ffa:    b948        H.      CBNZ     r0,0x8006010 ; USBD_StdEPReq + 120
        0x08005ffc:    2900        .)      CMP      r1,#0
        0x08005ffe:    bf18        ..      IT       NE
        0x08006000:    2980        .)      CMPNE    r1,#0x80
        0x08006002:    d005        ..      BEQ      0x8006010 ; USBD_StdEPReq + 120
        0x08006004:    88e8        ..      LDRH     r0,[r5,#6]
        0x08006006:    2800        .(      CMP      r0,#0
        0x08006008:    bf04        ..      ITT      EQ
        0x0800600a:    4620         F      MOVEQ    r0,r4
        0x0800600c:    f7fffdd3    ....    BLEQ     USBD_LL_StallEP ; 0x8005bb6
        0x08006010:    4620         F      MOV      r0,r4
        0x08006012:    f7fffbaf    ....    BL       USBD_CtlSendStatus ; 0x8005774
        0x08006016:    e072        r.      B        0x80060fe ; USBD_StdEPReq + 358
        0x08006018:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x0800601c:    2802        .(      CMP      r0,#2
        0x0800601e:    d002        ..      BEQ      0x8006026 ; USBD_StdEPReq + 142
        0x08006020:    2803        .(      CMP      r0,#3
        0x08006022:    d005        ..      BEQ      0x8006030 ; USBD_StdEPReq + 152
        0x08006024:    e063        c.      B        0x80060ee ; USBD_StdEPReq + 342
        0x08006026:    2900        .)      CMP      r1,#0
        0x08006028:    bf18        ..      IT       NE
        0x0800602a:    2980        .)      CMPNE    r1,#0x80
        0x0800602c:    d1dc        ..      BNE      0x8005fe8 ; USBD_StdEPReq + 80
        0x0800602e:    e05e        ^.      B        0x80060ee ; USBD_StdEPReq + 342
        0x08006030:    8868        h.      LDRH     r0,[r5,#2]
        0x08006032:    2800        .(      CMP      r0,#0
        0x08006034:    d163        c.      BNE      0x80060fe ; USBD_StdEPReq + 358
        0x08006036:    f0110f7f    ....    TST      r1,#0x7f
        0x0800603a:    bf1c        ..      ITT      NE
        0x0800603c:    4620         F      MOVNE    r0,r4
        0x0800603e:    f7fffbee    ....    BLNE     USBD_LL_ClearStallEP ; 0x800581e
        0x08006042:    4620         F      MOV      r0,r4
        0x08006044:    f7fffb96    ....    BL       USBD_CtlSendStatus ; 0x8005774
        0x08006048:    e7b4        ..      B        0x8005fb4 ; USBD_StdEPReq + 28
        0x0800604a:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x0800604e:    2700        .'      MOVS     r7,#0
        0x08006050:    2802        .(      CMP      r0,#2
        0x08006052:    d002        ..      BEQ      0x800605a ; USBD_StdEPReq + 194
        0x08006054:    2803        .(      CMP      r0,#3
        0x08006056:    d018        ..      BEQ      0x800608a ; USBD_StdEPReq + 242
        0x08006058:    e049        I.      B        0x80060ee ; USBD_StdEPReq + 342
