ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800605a:    2900        .)      CMP      r1,#0
        0x0800605c:    bf18        ..      IT       NE
        0x0800605e:    2980        .)      CMPNE    r1,#0x80
        0x08006060:    d145        E.      BNE      0x80060ee ; USBD_StdEPReq + 342
        0x08006062:    f001007f    ....    AND      r0,r1,#0x7f
        0x08006066:    eb000080    ....    ADD      r0,r0,r0,LSL #2
        0x0800606a:    f0110f80    ....    TST      r1,#0x80
        0x0800606e:    eb040080    ....    ADD      r0,r4,r0,LSL #2
        0x08006072:    bf14        ..      ITE      NE
        0x08006074:    f1000114    ....    ADDNE    r1,r0,#0x14
        0x08006078:    f50071aa    ...q    ADDEQ    r1,r0,#0x154
        0x0800607c:    f04f0202    O...    MOV      r2,#2
        0x08006080:    4620         F      MOV      r0,r4
        0x08006082:    600f        .`      STR      r7,[r1,#0]
        0x08006084:    f7fffb69    ..i.    BL       USBD_CtlSendData ; 0x800575a
        0x08006088:    e039        9.      B        0x80060fe ; USBD_StdEPReq + 358
        0x0800608a:    f001000f    ....    AND      r0,r1,#0xf
        0x0800608e:    eb000080    ....    ADD      r0,r0,r0,LSL #2
        0x08006092:    f0110f80    ....    TST      r1,#0x80
        0x08006096:    eb040080    ....    ADD      r0,r4,r0,LSL #2
        0x0800609a:    d00a        ..      BEQ      0x80060b2 ; USBD_StdEPReq + 282
        0x0800609c:    8c80        ..      LDRH     r0,[r0,#0x24]
        0x0800609e:    b330        0.      CBZ      r0,0x80060ee ; USBD_StdEPReq + 342
        0x080060a0:    f001007f    ....    AND      r0,r1,#0x7f
        0x080060a4:    eb000080    ....    ADD      r0,r0,r0,LSL #2
        0x080060a8:    eb040080    ....    ADD      r0,r4,r0,LSL #2
        0x080060ac:    f1000514    ....    ADD      r5,r0,#0x14
        0x080060b0:    e00a        ..      B        0x80060c8 ; USBD_StdEPReq + 304
        0x080060b2:    f8b00164    ..d.    LDRH     r0,[r0,#0x164]
        0x080060b6:    b1d0        ..      CBZ      r0,0x80060ee ; USBD_StdEPReq + 342
        0x080060b8:    f001007f    ....    AND      r0,r1,#0x7f
        0x080060bc:    eb000080    ....    ADD      r0,r0,r0,LSL #2
        0x080060c0:    eb040080    ....    ADD      r0,r4,r0,LSL #2
        0x080060c4:    f50075aa    ...u    ADD      r5,r0,#0x154
        0x080060c8:    2900        .)      CMP      r1,#0
        0x080060ca:    bf18        ..      IT       NE
        0x080060cc:    2980        .)      CMPNE    r1,#0x80
        0x080060ce:    d007        ..      BEQ      0x80060e0 ; USBD_StdEPReq + 328
        0x080060d0:    4620         F      MOV      r0,r4
        0x080060d2:    f7fffca7    ....    BL       USBD_LL_IsStallEP ; 0x8005a24
        0x080060d6:    2800        .(      CMP      r0,#0
        0x080060d8:    bf1c        ..      ITT      NE
        0x080060da:    2001        .       MOVNE    r0,#1
        0x080060dc:    6028        (`      STRNE    r0,[r5,#0]
        0x080060de:    d100        ..      BNE      0x80060e2 ; USBD_StdEPReq + 330
        0x080060e0:    602f        /`      STR      r7,[r5,#0]
        0x080060e2:    2202        ."      MOVS     r2,#2
        0x080060e4:    4629        )F      MOV      r1,r5
        0x080060e6:    4620         F      MOV      r0,r4
        0x080060e8:    f7fffb37    ..7.    BL       USBD_CtlSendData ; 0x800575a
        0x080060ec:    e007        ..      B        0x80060fe ; USBD_StdEPReq + 358
        0x080060ee:    2180        .!      MOVS     r1,#0x80
        0x080060f0:    4620         F      MOV      r0,r4
        0x080060f2:    f7fffd60    ..`.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x080060f6:    2100        .!      MOVS     r1,#0
        0x080060f8:    4620         F      MOV      r0,r4
        0x080060fa:    f7fffd5c    ..\.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x080060fe:    4630        0F      MOV      r0,r6
        0x08006100:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.USBD_StdItfReq
    USBD_StdItfReq
        0x08006104:    b570        p.      PUSH     {r4-r6,lr}
        0x08006106:    4604        .F      MOV      r4,r0
        0x08006108:    7808        .x      LDRB     r0,[r1,#0]
        0x0800610a:    2500        .%      MOVS     r5,#0
        0x0800610c:    460e        .F      MOV      r6,r1
        0x0800610e:    f0100060    ..`.    ANDS     r0,r0,#0x60
        0x08006112:    bf1c        ..      ITT      NE
        0x08006114:    2820         (      CMPNE    r0,#0x20
        0x08006116:    2840        @(      CMPNE    r0,#0x40
        0x08006118:    d116        ..      BNE      0x8006148 ; USBD_StdItfReq + 68
        0x0800611a:    f894029c    ....    LDRB     r0,[r4,#0x29c]
        0x0800611e:    2801        .(      CMP      r0,#1
        0x08006120:    bf1c        ..      ITT      NE
        0x08006122:    2802        .(      CMPNE    r0,#2
        0x08006124:    2803        .(      CMPNE    r0,#3
        0x08006126:    d10f        ..      BNE      0x8006148 ; USBD_StdItfReq + 68
        0x08006128:    7930        0y      LDRB     r0,[r6,#4]
        0x0800612a:    2801        .(      CMP      r0,#1
        0x0800612c:    d80c        ..      BHI      0x8006148 ; USBD_StdItfReq + 68
        0x0800612e:    f8d402b8    ....    LDR      r0,[r4,#0x2b8]
        0x08006132:    6882        .h      LDR      r2,[r0,#8]
        0x08006134:    4620         F      MOV      r0,r4
        0x08006136:    4790        .G      BLX      r2
        0x08006138:    4605        .F      MOV      r5,r0
        0x0800613a:    88f0        ..      LDRH     r0,[r6,#6]
        0x0800613c:    4328        (C      ORRS     r0,r0,r5
        0x0800613e:    bf04        ..      ITT      EQ
        0x08006140:    4620         F      MOVEQ    r0,r4
        0x08006142:    f7fffb17    ....    BLEQ     USBD_CtlSendStatus ; 0x8005774
        0x08006146:    e007        ..      B        0x8006158 ; USBD_StdItfReq + 84
        0x08006148:    2180        .!      MOVS     r1,#0x80
        0x0800614a:    4620         F      MOV      r0,r4
        0x0800614c:    f7fffd33    ..3.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08006150:    2100        .!      MOVS     r1,#0
        0x08006152:    4620         F      MOV      r0,r4
        0x08006154:    f7fffd2f    ../.    BL       USBD_LL_StallEP ; 0x8005bb6
        0x08006158:    4628        (F      MOV      r0,r5
        0x0800615a:    bd70        p.      POP      {r4-r6,pc}
    i.USBD_static_free
    USBD_static_free
        0x0800615c:    4770        pG      BX       lr
        0x0800615e:    0000        ..      MOVS     r0,r0
    i.USBD_static_malloc
    USBD_static_malloc
        0x08006160:    4800        .H      LDR      r0,[pc,#0] ; [0x8006164] = 0x20000dac
        0x08006162:    4770        pG      BX       lr
    $d
        0x08006164:    20000dac    ...     DCD    536874412
    $t
    i.USB_ActivateEndpoint
    USB_ActivateEndpoint
        0x08006168:    b4f0        ..      PUSH     {r4-r7}
        0x0800616a:    f891c000    ....    LDRB     r12,[r1,#0]
        0x0800616e:    2500        .%      MOVS     r5,#0
        0x08006170:    f830202c    0.,     LDRH     r2,[r0,r12,LSL #2]
        0x08006174:    f42263ce    "..c    BIC      r3,r2,#0x670
        0x08006178:    78ca        .x      LDRB     r2,[r1,#3]
        0x0800617a:    f42343e0    #..C    BIC      r3,r3,#0x7000
        0x0800617e:    2a00        .*      CMP      r2,#0
        0x08006180:    bf08        ..      IT       EQ
        0x08006182:    f4437300    C..s    ORREQ    r3,r3,#0x200
        0x08006186:    d00a        ..      BEQ      0x800619e ; USB_ActivateEndpoint + 54
        0x08006188:    2a01        .*      CMP      r2,#1
        0x0800618a:    bf0c        ..      ITE      EQ
        0x0800618c:    f4436380    C..c    ORREQ    r3,r3,#0x400
        0x08006190:    2a02        .*      CMPNE    r2,#2
        0x08006192:    d004        ..      BEQ      0x800619e ; USB_ActivateEndpoint + 54
        0x08006194:    2a03        .*      CMP      r2,#3
        0x08006196:    bf0c        ..      ITE      EQ
        0x08006198:    f44363c0    C..c    ORREQ    r3,r3,#0x600
        0x0800619c:    2501        .%      MOVNE    r5,#1
        0x0800619e:    f2480280    H...    MOV      r2,#0x8080
        0x080061a2:    4313        .C      ORRS     r3,r3,r2
        0x080061a4:    f820302c     .,0    STRH     r3,[r0,r12,LSL #2]
        0x080061a8:    780b        .x      LDRB     r3,[r1,#0]
        0x080061aa:    f830c023    0.#.    LDRH     r12,[r0,r3,LSL #2]
        0x080061ae:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x080061b2:    f42c4ce0    ,..L    BIC      r12,r12,#0x7000
        0x080061b6:    ea4c0c03    L...    ORR      r12,r12,r3
        0x080061ba:    ea4c0c02    L...    ORR      r12,r12,r2
        0x080061be:    f820c023     .#.    STRH     r12,[r0,r3,LSL #2]
        0x080061c2:    f891c00c    ....    LDRB     r12,[r1,#0xc]
        0x080061c6:    f24803c0    H...    MOV      r3,#0x80c0
        0x080061ca:    f24c0680    L...    MOV      r6,#0xc080
        0x080061ce:    f1bc0f00    ....    CMP      r12,#0
        0x080061d2:    d06d        m.      BEQ      0x80062b0 ; USB_ActivateEndpoint + 328
        0x080061d4:    f891c003    ....    LDRB     r12,[r1,#3]
        0x080061d8:    f1bc0f02    ....    CMP      r12,#2
        0x080061dc:    f891c000    ....    LDRB     r12,[r1,#0]
        0x080061e0:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x080061e4:    bf01        ..      ITTTT    EQ
        0x080061e6:    f0240470    $.p.    BICEQ    r4,r4,#0x70
        0x080061ea:    f42444e0    $..D    BICEQ    r4,r4,#0x7000
        0x080061ee:    f2481780    H...    MOVEQ    r7,#0x8180
        0x080061f2:    433c        <C      ORREQ    r4,r4,r7
        0x080061f4:    bf1e        ..      ITTT     NE
        0x080061f6:    f42474b8    $..t    BICNE    r4,r4,#0x170
        0x080061fa:    f42444e0    $..D    BICNE    r4,r4,#0x7000
        0x080061fe:    4314        .C      ORRNE    r4,r4,r2
        0x08006200:    f820402c     .,@    STRH     r4,[r0,r12,LSL #2]
        0x08006204:    f8b0c050    ..P.    LDRH     r12,[r0,#0x50]
        0x08006208:    780c        .x      LDRB     r4,[r1,#0]
        0x0800620a:    4484        .D      ADD      r12,r12,r0
        0x0800620c:    eb0c0cc4    ....    ADD      r12,r12,r4,LSL #3
        0x08006210:    890c        ..      LDRH     r4,[r1,#8]
        0x08006212:    f0240401    $...    BIC      r4,r4,#1
        0x08006216:    f8ac4400    ...D    STRH     r4,[r12,#0x400]
        0x0800621a:    f8b0c050    ..P.    LDRH     r12,[r0,#0x50]
        0x0800621e:    780c        .x      LDRB     r4,[r1,#0]
        0x08006220:    4484        .D      ADD      r12,r12,r0
        0x08006222:    eb0c0cc4    ....    ADD      r12,r12,r4,LSL #3
        0x08006226:    894c        L.      LDRH     r4,[r1,#0xa]
        0x08006228:    f0240401    $...    BIC      r4,r4,#1
        0x0800622c:    f8ac4404    ...D    STRH     r4,[r12,#0x404]
        0x08006230:    f891c001    ....    LDRB     r12,[r1,#1]
        0x08006234:    f1bc0f00    ....    CMP      r12,#0
        0x08006238:    f891c000    ....    LDRB     r12,[r1,#0]
        0x0800623c:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x08006240:    f4044480    ...D    AND      r4,r4,#0x4000
        0x08006244:    d06f        o.      BEQ      0x8006326 ; USB_ActivateEndpoint + 446
        0x08006246:    b144        D.      CBZ      r4,0x800625a ; USB_ActivateEndpoint + 242
        0x08006248:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x0800624c:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x08006250:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x08006254:    4334        4C      ORRS     r4,r4,r6
        0x08006256:    f820402c     .,@    STRH     r4,[r0,r12,LSL #2]
        0x0800625a:    f891c000    ....    LDRB     r12,[r1,#0]
        0x0800625e:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x08006262:    f0140f40    ..@.    TST      r4,#0x40
        0x08006266:    d008        ..      BEQ      0x800627a ; USB_ActivateEndpoint + 274
        0x08006268:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x0800626c:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x08006270:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x08006274:    4323        #C      ORRS     r3,r3,r4
        0x08006276:    f820302c     .,0    STRH     r3,[r0,r12,LSL #2]
        0x0800627a:    78cb        .x      LDRB     r3,[r1,#3]
        0x0800627c:    2b01        .+      CMP      r3,#1
        0x0800627e:    780b        .x      LDRB     r3,[r1,#0]
        0x08006280:    f830c023    0.#.    LDRH     r12,[r0,r3,LSL #2]
        0x08006284:    f42c5c41    ,.A\    BIC      r12,r12,#0x3040
        0x08006288:    f42c4c80    ,..L    BIC      r12,r12,#0x4000
        0x0800628c:    bf18        ..      IT       NE
        0x0800628e:    f08c0c20    .. .    EORNE    r12,r12,#0x20
        0x08006292:    ea4c0c02    L...    ORR      r12,r12,r2
        0x08006296:    f820c023     .#.    STRH     r12,[r0,r3,LSL #2]
        0x0800629a:    7809        .x      LDRB     r1,[r1,#0]
        0x0800629c:    f8303021    0.!0    LDRH     r3,[r0,r1,LSL #2]
        0x080062a0:    f0230370    #.p.    BIC      r3,r3,#0x70
        0x080062a4:    f4234380    #..C    BIC      r3,r3,#0x4000
        0x080062a8:    431a        .C      ORRS     r2,r2,r3
        0x080062aa:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x080062ae:    e0ab        ..      B        0x8006408 ; USB_ActivateEndpoint + 672
        0x080062b0:    f891c001    ....    LDRB     r12,[r1,#1]
        0x080062b4:    f1bc0f00    ....    CMP      r12,#0
        0x080062b8:    d036        6.      BEQ      0x8006328 ; USB_ActivateEndpoint + 448
        0x080062ba:    f8b0c050    ..P.    LDRH     r12,[r0,#0x50]
        0x080062be:    780c        .x      LDRB     r4,[r1,#0]
        0x080062c0:    4484        .D      ADD      r12,r12,r0
        0x080062c2:    eb0c0cc4    ....    ADD      r12,r12,r4,LSL #3
        0x080062c6:    88cc        ..      LDRH     r4,[r1,#6]
        0x080062c8:    f0240401    $...    BIC      r4,r4,#1
        0x080062cc:    f8ac4400    ...D    STRH     r4,[r12,#0x400]
        0x080062d0:    f891c000    ....    LDRB     r12,[r1,#0]
        0x080062d4:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x080062d8:    f0140f40    ..@.    TST      r4,#0x40
        0x080062dc:    d008        ..      BEQ      0x80062f0 ; USB_ActivateEndpoint + 392
        0x080062de:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x080062e2:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x080062e6:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x080062ea:    4323        #C      ORRS     r3,r3,r4
        0x080062ec:    f820302c     .,0    STRH     r3,[r0,r12,LSL #2]
        0x080062f0:    78cb        .x      LDRB     r3,[r1,#3]
        0x080062f2:    2b01        .+      CMP      r3,#1
        0x080062f4:    d00c        ..      BEQ      0x8006310 ; USB_ActivateEndpoint + 424
        0x080062f6:    7809        .x      LDRB     r1,[r1,#0]
        0x080062f8:    f8303021    0.!0    LDRH     r3,[r0,r1,LSL #2]
        0x080062fc:    f4235341    #.AS    BIC      r3,r3,#0x3040
        0x08006300:    f4234380    #..C    BIC      r3,r3,#0x4000
        0x08006304:    f0830320    .. .    EOR      r3,r3,#0x20
        0x08006308:    431a        .C      ORRS     r2,r2,r3
        0x0800630a:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x0800630e:    e07b        {.      B        0x8006408 ; USB_ActivateEndpoint + 672
        0x08006310:    7809        .x      LDRB     r1,[r1,#0]
        0x08006312:    f8303021    0.!0    LDRH     r3,[r0,r1,LSL #2]
        0x08006316:    f4235341    #.AS    BIC      r3,r3,#0x3040
        0x0800631a:    f4234380    #..C    BIC      r3,r3,#0x4000
        0x0800631e:    431a        .C      ORRS     r2,r2,r3
        0x08006320:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x08006324:    e070        p.      B        0x8006408 ; USB_ActivateEndpoint + 672
        0x08006326:    e072        r.      B        0x800640e ; USB_ActivateEndpoint + 678
        0x08006328:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x0800632c:    f891c000    ....    LDRB     r12,[r1,#0]
        0x08006330:    4403        .D      ADD      r3,r3,r0
        0x08006332:    eb0303cc    ....    ADD      r3,r3,r12,LSL #3
        0x08006336:    f8b1c006    ....    LDRH     r12,[r1,#6]
        0x0800633a:    f02c0c01    ,...    BIC      r12,r12,#1
        0x0800633e:    f8a3c404    ....    STRH     r12,[r3,#0x404]
        0x08006342:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x08006346:    f891c000    ....    LDRB     r12,[r1,#0]
        0x0800634a:    4403        .D      ADD      r3,r3,r0
        0x0800634c:    eb0303cc    ....    ADD      r3,r3,r12,LSL #3
        0x08006350:    f8b3c406    ....    LDRH     r12,[r3,#0x406]
        0x08006354:    f3cc0c09    ....    UBFX     r12,r12,#0,#10
        0x08006358:    f8a3c406    ....    STRH     r12,[r3,#0x406]
        0x0800635c:    f8d1c010    ....    LDR      r12,[r1,#0x10]
        0x08006360:    f2034306    ...C    ADD      r3,r3,#0x406
        0x08006364:    f1bc0f3e    ..>.    CMP      r12,#0x3e
        0x08006368:    d90f        ..      BLS      0x800638a ; USB_ActivateEndpoint + 546
        0x0800636a:    ea4f145c    O.\.    LSR      r4,r12,#5
        0x0800636e:    f01c0f1f    ....    TST      r12,#0x1f
        0x08006372:    bf08        ..      IT       EQ
        0x08006374:    1e64        d.      SUBEQ    r4,r4,#1
        0x08006376:    881f        ..      LDRH     r7,[r3,#0]
        0x08006378:    f44f4c00    O..L    MOV      r12,#0x8000
        0x0800637c:    ea4c2c84    L..,    ORR      r12,r12,r4,LSL #10
        0x08006380:    ea470c0c    G...    ORR      r12,r7,r12
        0x08006384:    f8a3c000    ....    STRH     r12,[r3,#0]
        0x08006388:    e017        ..      B        0x80063ba ; USB_ActivateEndpoint + 594
        0x0800638a:    f1bc0f00    ....    CMP      r12,#0
        0x0800638e:    bf04        ..      ITT      EQ
        0x08006390:    f8b3c000    ....    LDRHEQ   r12,[r3,#0]
        0x08006394:    f44c4c00    L..L    ORREQ    r12,r12,#0x8000
        0x08006398:    d00d        ..      BEQ      0x80063b6 ; USB_ActivateEndpoint + 590
        0x0800639a:    ea4f045c    O.\.    LSR      r4,r12,#1
        0x0800639e:    f01c0f01    ....    TST      r12,#1
        0x080063a2:    bf18        ..      IT       NE
        0x080063a4:    1c64        d.      ADDNE    r4,r4,#1
        0x080063a6:    f8b3c000    ....    LDRH     r12,[r3,#0]
        0x080063aa:    f64f77ff    O..w    MOV      r7,#0xffff
        0x080063ae:    ea072484    ...$    AND      r4,r7,r4,LSL #10
        0x080063b2:    ea4c0c04    L...    ORR      r12,r12,r4
        0x080063b6:    f8a3c000    ....    STRH     r12,[r3,#0]
        0x080063ba:    780b        .x      LDRB     r3,[r1,#0]
        0x080063bc:    f830c023    0.#.    LDRH     r12,[r0,r3,LSL #2]
        0x080063c0:    f41c4f80    ...O    TST      r12,#0x4000
        0x080063c4:    d009        ..      BEQ      0x80063da ; USB_ActivateEndpoint + 626
        0x080063c6:    f830c023    0.#.    LDRH     r12,[r0,r3,LSL #2]
        0x080063ca:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x080063ce:    f42c4ce0    ,..L    BIC      r12,r12,#0x7000
        0x080063d2:    ea4c0c06    L...    ORR      r12,r12,r6
        0x080063d6:    f820c023     .#.    STRH     r12,[r0,r3,LSL #2]
        0x080063da:    7809        .x      LDRB     r1,[r1,#0]
        0x080063dc:    b159        Y.      CBZ      r1,0x80063f6 ; USB_ActivateEndpoint + 654
        0x080063de:    f8303021    0.!0    LDRH     r3,[r0,r1,LSL #2]
        0x080063e2:    f0230370    #.p.    BIC      r3,r3,#0x70
        0x080063e6:    f4234380    #..C    BIC      r3,r3,#0x4000
        0x080063ea:    f4835300    ...S    EOR      r3,r3,#0x2000
        0x080063ee:    431a        .C      ORRS     r2,r2,r3
        0x080063f0:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x080063f4:    e008        ..      B        0x8006408 ; USB_ActivateEndpoint + 672
        0x080063f6:    8801        ..      LDRH     r1,[r0,#0]
        0x080063f8:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x080063fc:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x08006400:    f4815140    ..@Q    EOR      r1,r1,#0x3000
        0x08006404:    4311        .C      ORRS     r1,r1,r2
        0x08006406:    8001        ..      STRH     r1,[r0,#0]
        0x08006408:    4628        (F      MOV      r0,r5
        0x0800640a:    bcf0        ..      POP      {r4-r7}
        0x0800640c:    4770        pG      BX       lr
        0x0800640e:    b144        D.      CBZ      r4,0x8006422 ; USB_ActivateEndpoint + 698
        0x08006410:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x08006414:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x08006418:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x0800641c:    4334        4C      ORRS     r4,r4,r6
        0x0800641e:    f820402c     .,@    STRH     r4,[r0,r12,LSL #2]
        0x08006422:    f891c000    ....    LDRB     r12,[r1,#0]
        0x08006426:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x0800642a:    f0140f40    ..@.    TST      r4,#0x40
        0x0800642e:    d008        ..      BEQ      0x8006442 ; USB_ActivateEndpoint + 730
        0x08006430:    f830402c    0.,@    LDRH     r4,[r0,r12,LSL #2]
        0x08006434:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x08006438:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x0800643c:    4323        #C      ORRS     r3,r3,r4
        0x0800643e:    f820302c     .,0    STRH     r3,[r0,r12,LSL #2]
        0x08006442:    780b        .x      LDRB     r3,[r1,#0]
        0x08006444:    f830c023    0.#.    LDRH     r12,[r0,r3,LSL #2]
        0x08006448:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x0800644c:    f42c4c80    ,..L    BIC      r12,r12,#0x4000
        0x08006450:    f48c5c40    ..@\    EOR      r12,r12,#0x3000
        0x08006454:    ea4c0c02    L...    ORR      r12,r12,r2
        0x08006458:    f820c023     .#.    STRH     r12,[r0,r3,LSL #2]
        0x0800645c:    e758        X.      B        0x8006310 ; USB_ActivateEndpoint + 424
        0x0800645e:    0000        ..      MOVS     r0,r0
    i.USB_DeactivateEndpoint
    USB_DeactivateEndpoint
        0x08006460:    b470        p.      PUSH     {r4-r6}
        0x08006462:    7b0e        .{      LDRB     r6,[r1,#0xc]
        0x08006464:    784d        Mx      LDRB     r5,[r1,#1]
        0x08006466:    780a        .x      LDRB     r2,[r1,#0]
        0x08006468:    f2480380    H...    MOV      r3,#0x8080
        0x0800646c:    f2480cc0    H...    MOV      r12,#0x80c0
        0x08006470:    f24c0480    L...    MOV      r4,#0xc080
        0x08006474:    b3be        ..      CBZ      r6,0x80064e6 ; USB_DeactivateEndpoint + 134
        0x08006476:    2d00        .-      CMP      r5,#0
        0x08006478:    f8305022    0."P    LDRH     r5,[r0,r2,LSL #2]
        0x0800647c:    f4054580    ...E    AND      r5,r5,#0x4000
        0x08006480:    d066        f.      BEQ      0x8006550 ; USB_DeactivateEndpoint + 240
        0x08006482:    b145        E.      CBZ      r5,0x8006496 ; USB_DeactivateEndpoint + 54
        0x08006484:    f8305022    0."P    LDRH     r5,[r0,r2,LSL #2]
        0x08006488:    f0250570    %.p.    BIC      r5,r5,#0x70
        0x0800648c:    f42545e0    %..E    BIC      r5,r5,#0x7000
        0x08006490:    4325        %C      ORRS     r5,r5,r4
        0x08006492:    f8205022     ."P    STRH     r5,[r0,r2,LSL #2]
        0x08006496:    780a        .x      LDRB     r2,[r1,#0]
        0x08006498:    f8305022    0."P    LDRH     r5,[r0,r2,LSL #2]
        0x0800649c:    f0150f40    ..@.    TST      r5,#0x40
