ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080064a0:    d009        ..      BEQ      0x80064b6 ; USB_DeactivateEndpoint + 86
        0x080064a2:    f8305022    0."P    LDRH     r5,[r0,r2,LSL #2]
        0x080064a6:    f0250570    %.p.    BIC      r5,r5,#0x70
        0x080064aa:    f42545e0    %..E    BIC      r5,r5,#0x7000
        0x080064ae:    ea450c0c    E...    ORR      r12,r5,r12
        0x080064b2:    f820c022     .".    STRH     r12,[r0,r2,LSL #2]
        0x080064b6:    f891c000    ....    LDRB     r12,[r1,#0]
        0x080064ba:    f830202c    0.,     LDRH     r2,[r0,r12,LSL #2]
        0x080064be:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x080064c2:    f42242e0    "..B    BIC      r2,r2,#0x7000
        0x080064c6:    4322        "C      ORRS     r2,r2,r4
        0x080064c8:    f820202c     .,     STRH     r2,[r0,r12,LSL #2]
        0x080064cc:    780a        .x      LDRB     r2,[r1,#0]
        0x080064ce:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x080064d2:    f42c5c41    ,.A\    BIC      r12,r12,#0x3040
        0x080064d6:    f42c4c80    ,..L    BIC      r12,r12,#0x4000
        0x080064da:    ea4c0c03    L...    ORR      r12,r12,r3
        0x080064de:    bf00        ..      NOP      
        0x080064e0:    f820c022     .".    STRH     r12,[r0,r2,LSL #2]
        0x080064e4:    e029        ).      B        0x800653a ; USB_DeactivateEndpoint + 218
        0x080064e6:    e7ff        ..      B        0x80064e8 ; USB_DeactivateEndpoint + 136
        0x080064e8:    b1cd        ..      CBZ      r5,0x800651e ; USB_DeactivateEndpoint + 190
        0x080064ea:    f8304022    0."@    LDRH     r4,[r0,r2,LSL #2]
        0x080064ee:    f0140f40    ..@.    TST      r4,#0x40
        0x080064f2:    d009        ..      BEQ      0x8006508 ; USB_DeactivateEndpoint + 168
        0x080064f4:    f8304022    0."@    LDRH     r4,[r0,r2,LSL #2]
        0x080064f8:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x080064fc:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x08006500:    ea440c0c    D...    ORR      r12,r4,r12
        0x08006504:    f820c022     .".    STRH     r12,[r0,r2,LSL #2]
        0x08006508:    7809        .x      LDRB     r1,[r1,#0]
        0x0800650a:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x0800650e:    f4225241    ".AR    BIC      r2,r2,#0x3040
        0x08006512:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08006516:    431a        .C      ORRS     r2,r2,r3
        0x08006518:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x0800651c:    e052        R.      B        0x80065c4 ; USB_DeactivateEndpoint + 356
        0x0800651e:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x08006522:    f41c4f80    ...O    TST      r12,#0x4000
        0x08006526:    d008        ..      BEQ      0x800653a ; USB_DeactivateEndpoint + 218
        0x08006528:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x0800652c:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x08006530:    f42c4ce0    ,..L    BIC      r12,r12,#0x7000
        0x08006534:    ea4c0c04    L...    ORR      r12,r12,r4
        0x08006538:    e7d2        ..      B        0x80064e0 ; USB_DeactivateEndpoint + 128
        0x0800653a:    7809        .x      LDRB     r1,[r1,#0]
        0x0800653c:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x08006540:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x08006544:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08006548:    431a        .C      ORRS     r2,r2,r3
        0x0800654a:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x0800654e:    e039        9.      B        0x80065c4 ; USB_DeactivateEndpoint + 356
        0x08006550:    b145        E.      CBZ      r5,0x8006564 ; USB_DeactivateEndpoint + 260
        0x08006552:    f8305022    0."P    LDRH     r5,[r0,r2,LSL #2]
        0x08006556:    f0250570    %.p.    BIC      r5,r5,#0x70
        0x0800655a:    f42545e0    %..E    BIC      r5,r5,#0x7000
        0x0800655e:    432c        ,C      ORRS     r4,r4,r5
        0x08006560:    f8204022     ."@    STRH     r4,[r0,r2,LSL #2]
        0x08006564:    780a        .x      LDRB     r2,[r1,#0]
        0x08006566:    f8304022    0."@    LDRH     r4,[r0,r2,LSL #2]
        0x0800656a:    f0140f40    ..@.    TST      r4,#0x40
        0x0800656e:    d009        ..      BEQ      0x8006584 ; USB_DeactivateEndpoint + 292
        0x08006570:    f8304022    0."@    LDRH     r4,[r0,r2,LSL #2]
        0x08006574:    f0240470    $.p.    BIC      r4,r4,#0x70
        0x08006578:    f42444e0    $..D    BIC      r4,r4,#0x7000
        0x0800657c:    ea44040c    D...    ORR      r4,r4,r12
        0x08006580:    f8204022     ."@    STRH     r4,[r0,r2,LSL #2]
        0x08006584:    780c        .x      LDRB     r4,[r1,#0]
        0x08006586:    f8302024    0.$     LDRH     r2,[r0,r4,LSL #2]
        0x0800658a:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x0800658e:    f42242e0    "..B    BIC      r2,r2,#0x7000
        0x08006592:    ea42020c    B...    ORR      r2,r2,r12
        0x08006596:    f8202024     .$     STRH     r2,[r0,r4,LSL #2]
        0x0800659a:    780a        .x      LDRB     r2,[r1,#0]
        0x0800659c:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x080065a0:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x080065a4:    f42c4c80    ,..L    BIC      r12,r12,#0x4000
        0x080065a8:    ea4c0c03    L...    ORR      r12,r12,r3
        0x080065ac:    f820c022     .".    STRH     r12,[r0,r2,LSL #2]
        0x080065b0:    780a        .x      LDRB     r2,[r1,#0]
        0x080065b2:    f8301022    0.".    LDRH     r1,[r0,r2,LSL #2]
        0x080065b6:    f4215141    !.AQ    BIC      r1,r1,#0x3040
        0x080065ba:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x080065be:    4319        .C      ORRS     r1,r1,r3
        0x080065c0:    f8201022     .".    STRH     r1,[r0,r2,LSL #2]
        0x080065c4:    bc70        p.      POP      {r4-r6}
        0x080065c6:    2000        .       MOVS     r0,#0
        0x080065c8:    4770        pG      BX       lr
    i.USB_DevConnect
    USB_DevConnect
        0x080065ca:    f8b01058    ..X.    LDRH     r1,[r0,#0x58]
        0x080065ce:    f4414100    A..A    ORR      r1,r1,#0x8000
        0x080065d2:    f8a01058    ..X.    STRH     r1,[r0,#0x58]
        0x080065d6:    2000        .       MOVS     r0,#0
        0x080065d8:    4770        pG      BX       lr
    i.USB_DevInit
    USB_DevInit
        0x080065da:    2101        .!      MOVS     r1,#1
        0x080065dc:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x080065e0:    2100        .!      MOVS     r1,#0
        0x080065e2:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x080065e6:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x080065ea:    f8a01050    ..P.    STRH     r1,[r0,#0x50]
        0x080065ee:    4608        .F      MOV      r0,r1
        0x080065f0:    4770        pG      BX       lr
    i.USB_DisableGlobalInt
    USB_DisableGlobalInt
        0x080065f2:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x080065f6:    f421517e    !.~Q    BIC      r1,r1,#0x3f80
        0x080065fa:    f4214100    !..A    BIC      r1,r1,#0x8000
        0x080065fe:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08006602:    2000        .       MOVS     r0,#0
        0x08006604:    4770        pG      BX       lr
    i.USB_EPClearStall
    USB_EPClearStall
        0x08006606:    b410        ..      PUSH     {r4}
        0x08006608:    7b0a        .{      LDRB     r2,[r1,#0xc]
        0x0800660a:    bb2a        *.      CBNZ     r2,0x8006658 ; USB_EPClearStall + 82
        0x0800660c:    784a        Jx      LDRB     r2,[r1,#1]
        0x0800660e:    f2480380    H...    MOV      r3,#0x8080
        0x08006612:    2a00        .*      CMP      r2,#0
        0x08006614:    780a        .x      LDRB     r2,[r1,#0]
        0x08006616:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x0800661a:    d01e        ..      BEQ      0x800665a ; USB_EPClearStall + 84
        0x0800661c:    f01c0f40    ..@.    TST      r12,#0x40
        0x08006620:    d00b        ..      BEQ      0x800663a ; USB_EPClearStall + 52
        0x08006622:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x08006626:    f24804c0    H...    MOV      r4,#0x80c0
        0x0800662a:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x0800662e:    f42c4ce0    ,..L    BIC      r12,r12,#0x7000
        0x08006632:    ea4c0c04    L...    ORR      r12,r12,r4
        0x08006636:    f820c022     .".    STRH     r12,[r0,r2,LSL #2]
        0x0800663a:    78ca        .x      LDRB     r2,[r1,#3]
        0x0800663c:    2a01        .*      CMP      r2,#1
        0x0800663e:    d027        '.      BEQ      0x8006690 ; USB_EPClearStall + 138
        0x08006640:    7809        .x      LDRB     r1,[r1,#0]
        0x08006642:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x08006646:    f4225241    ".AR    BIC      r2,r2,#0x3040
        0x0800664a:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x0800664e:    f0820220    .. .    EOR      r2,r2,#0x20
        0x08006652:    431a        .C      ORRS     r2,r2,r3
        0x08006654:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x08006658:    e01a        ..      B        0x8006690 ; USB_EPClearStall + 138
        0x0800665a:    f41c4f80    ...O    TST      r12,#0x4000
        0x0800665e:    d00b        ..      BEQ      0x8006678 ; USB_EPClearStall + 114
        0x08006660:    f830c022    0.".    LDRH     r12,[r0,r2,LSL #2]
        0x08006664:    f24c0480    L...    MOV      r4,#0xc080
        0x08006668:    f02c0c70    ,.p.    BIC      r12,r12,#0x70
        0x0800666c:    f42c4ce0    ,..L    BIC      r12,r12,#0x7000
        0x08006670:    ea4c0c04    L...    ORR      r12,r12,r4
        0x08006674:    f820c022     .".    STRH     r12,[r0,r2,LSL #2]
        0x08006678:    7809        .x      LDRB     r1,[r1,#0]
        0x0800667a:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x0800667e:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x08006682:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08006686:    f4825240    ..@R    EOR      r2,r2,#0x3000
        0x0800668a:    431a        .C      ORRS     r2,r2,r3
        0x0800668c:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x08006690:    bc10        ..      POP      {r4}
        0x08006692:    2000        .       MOVS     r0,#0
        0x08006694:    4770        pG      BX       lr
    i.USB_EPSetStall
    USB_EPSetStall
        0x08006696:    784b        Kx      LDRB     r3,[r1,#1]
        0x08006698:    7809        .x      LDRB     r1,[r1,#0]
        0x0800669a:    2b00        .+      CMP      r3,#0
        0x0800669c:    f2480280    H...    MOV      r2,#0x8080
        0x080066a0:    f8303021    0.!0    LDRH     r3,[r0,r1,LSL #2]
        0x080066a4:    bf1d        ..      ITTTE    NE
        0x080066a6:    f4235341    #.AS    BICNE    r3,r3,#0x3040
        0x080066aa:    f4234380    #..C    BICNE    r3,r3,#0x4000
        0x080066ae:    f0830310    ....    EORNE    r3,r3,#0x10
        0x080066b2:    f0230370    #.p.    BICEQ    r3,r3,#0x70
        0x080066b6:    bf04        ..      ITT      EQ
        0x080066b8:    f4234380    #..C    BICEQ    r3,r3,#0x4000
        0x080066bc:    f4835380    ...S    EOREQ    r3,r3,#0x1000
        0x080066c0:    431a        .C      ORRS     r2,r2,r3
        0x080066c2:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x080066c6:    2000        .       MOVS     r0,#0
        0x080066c8:    4770        pG      BX       lr
        0x080066ca:    0000        ..      MOVS     r0,r0
    i.USB_EPStartXfer
    USB_EPStartXfer
        0x080066cc:    e92d07f0    -...    PUSH     {r4-r10}
        0x080066d0:    f8918001    ....    LDRB     r8,[r1,#1]
        0x080066d4:    2700        .'      MOVS     r7,#0
        0x080066d6:    7b0e        .{      LDRB     r6,[r1,#0xc]
        0x080066d8:    f2480580    H...    MOV      r5,#0x8080
        0x080066dc:    f44f4c00    O..L    MOV      r12,#0x8000
        0x080066e0:    f64f74ff    O..t    MOV      r4,#0xffff
        0x080066e4:    f1b80f01    ....    CMP      r8,#1
        0x080066e8:    d01a        ..      BEQ      0x8006720 ; USB_EPStartXfer + 84
        0x080066ea:    2e00        ..      CMP      r6,#0
        0x080066ec:    f000823a    ..:.    BEQ.W    0x8006b64 ; USB_EPStartXfer + 1176
        0x080066f0:    78ca        .x      LDRB     r2,[r1,#3]
        0x080066f2:    2a02        .*      CMP      r2,#2
        0x080066f4:    f0008264    ..d.    BEQ.W    0x8006bc0 ; USB_EPStartXfer + 1268
        0x080066f8:    2a01        .*      CMP      r2,#1
        0x080066fa:    bf1e        ..      ITTT     NE
        0x080066fc:    2001        .       MOVNE    r0,#1
        0x080066fe:    e8bd07f0    ....    POPNE    {r4-r10}
        0x08006702:    4770        pG      BXNE     lr
        0x08006704:    698b        .i      LDR      r3,[r1,#0x18]
        0x08006706:    690a        .i      LDR      r2,[r1,#0x10]
        0x08006708:    4293        .B      CMP      r3,r2
        0x0800670a:    bf87        ..      ITTEE    HI
        0x0800670c:    1a9b        ..      SUBHI    r3,r3,r2
        0x0800670e:    618b        .a      STRHI    r3,[r1,#0x18]
        0x08006710:    461a        .F      MOVLS    r2,r3
        0x08006712:    618f        .a      STRLS    r7,[r1,#0x18]
        0x08006714:    f1b80f00    ....    CMP      r8,#0
        0x08006718:    f00082de    ....    BEQ.W    0x8006cd8 ; USB_EPStartXfer + 1548
        0x0800671c:    f000baf6    ....    B.W      0x8006d0c ; USB_EPStartXfer + 1600
        0x08006720:    690b        .i      LDR      r3,[r1,#0x10]
        0x08006722:    698a        .i      LDR      r2,[r1,#0x18]
        0x08006724:    429a        .B      CMP      r2,r3
        0x08006726:    bf88        ..      IT       HI
        0x08006728:    461a        .F      MOVHI    r2,r3
        0x0800672a:    b35e        ^.      CBZ      r6,0x8006784 ; USB_EPStartXfer + 184
        0x0800672c:    78ce        .x      LDRB     r6,[r1,#3]
        0x0800672e:    2e02        ..      CMP      r6,#2
        0x08006730:    d04a        J.      BEQ      0x80067c8 ; USB_EPStartXfer + 252
        0x08006732:    6a0b        .j      LDR      r3,[r1,#0x20]
        0x08006734:    1a9b        ..      SUBS     r3,r3,r2
        0x08006736:    620b        .b      STR      r3,[r1,#0x20]
        0x08006738:    780b        .x      LDRB     r3,[r1,#0]
        0x0800673a:    f830c023    0.#.    LDRH     r12,[r0,r3,LSL #2]
        0x0800673e:    f01c0f40    ..@.    TST      r12,#0x40
        0x08006742:    f8b0c050    ..P.    LDRH     r12,[r0,#0x50]
        0x08006746:    4484        .D      ADD      r12,r12,r0
        0x08006748:    eb0c03c3    ....    ADD      r3,r12,r3,LSL #3
        0x0800674c:    f00081e6    ....    BEQ.W    0x8006b1c ; USB_EPStartXfer + 1104
        0x08006750:    f8a32406    ...$    STRH     r2,[r3,#0x406]
        0x08006754:    f8b1c00a    ....    LDRH     r12,[r1,#0xa]
        0x08006758:    b292        ..      UXTH     r2,r2
        0x0800675a:    1c52        R.      ADDS     r2,r2,#1
        0x0800675c:    694b        Ki      LDR      r3,[r1,#0x14]
        0x0800675e:    4484        .D      ADD      r12,r12,r0
        0x08006760:    0852        R.      LSRS     r2,r2,#1
        0x08006762:    f50c6c80    ...l    ADD      r12,r12,#0x400
        0x08006766:    f00081ef    ....    BEQ.W    0x8006b48 ; USB_EPStartXfer + 1148
        0x0800676a:    bf00        ..      NOP      
        0x0800676c:    f8134b01    ...K    LDRB     r4,[r3],#1
        0x08006770:    f8136b01    ...k    LDRB     r6,[r3],#1
        0x08006774:    ea442406    D..$    ORR      r4,r4,r6,LSL #8
        0x08006778:    f82c4b02    ,..K    STRH     r4,[r12],#2
        0x0800677c:    1e52        R.      SUBS     r2,r2,#1
        0x0800677e:    d1f5        ..      BNE      0x800676c ; USB_EPStartXfer + 160
        0x08006780:    f000b9e2    ....    B.W      0x8006b48 ; USB_EPStartXfer + 1148
        0x08006784:    88cc        ..      LDRH     r4,[r1,#6]
        0x08006786:    fa1ffc82    ....    UXTH     r12,r2
        0x0800678a:    f10c0c01    ....    ADD      r12,r12,#1
        0x0800678e:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08006790:    4404        .D      ADD      r4,r4,r0
        0x08006792:    ea5f0c5c    _.\.    LSRS     r12,r12,#1
        0x08006796:    f5046480    ...d    ADD      r4,r4,#0x400
        0x0800679a:    d00a        ..      BEQ      0x80067b2 ; USB_EPStartXfer + 230
        0x0800679c:    f8136b01    ...k    LDRB     r6,[r3],#1
        0x080067a0:    f8137b01    ...{    LDRB     r7,[r3],#1
        0x080067a4:    ea462607    F..&    ORR      r6,r6,r7,LSL #8
        0x080067a8:    f8246b02    $..k    STRH     r6,[r4],#2
        0x080067ac:    f1bc0c01    ....    SUBS     r12,r12,#1
        0x080067b0:    d1f4        ..      BNE      0x800679c ; USB_EPStartXfer + 208
        0x080067b2:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x080067b6:    f891c000    ....    LDRB     r12,[r1,#0]
        0x080067ba:    4403        .D      ADD      r3,r3,r0
        0x080067bc:    eb0303cc    ....    ADD      r3,r3,r12,LSL #3
        0x080067c0:    f8a32402    ...$    STRH     r2,[r3,#0x402]
        0x080067c4:    f000b9c0    ....    B.W      0x8006b48 ; USB_EPStartXfer + 1148
        0x080067c8:    6a0e        .j      LDR      r6,[r1,#0x20]
        0x080067ca:    429e        .B      CMP      r6,r3
        0x080067cc:    f240817d    @.}.    BLS.W    0x8006aca ; USB_EPStartXfer + 1022
        0x080067d0:    780e        .x      LDRB     r6,[r1,#0]
        0x080067d2:    f8303026    0.&0    LDRH     r3,[r0,r6,LSL #2]
        0x080067d6:    f2481880    H...    MOV      r8,#0x8180
        0x080067da:    f0230370    #.p.    BIC      r3,r3,#0x70
        0x080067de:    f42343e0    #..C    BIC      r3,r3,#0x7000
        0x080067e2:    ea430308    C...    ORR      r3,r3,r8
        0x080067e6:    f8203026     .&0    STRH     r3,[r0,r6,LSL #2]
        0x080067ea:    6a0b        .j      LDR      r3,[r1,#0x20]
        0x080067ec:    1a9b        ..      SUBS     r3,r3,r2
        0x080067ee:    620b        .b      STR      r3,[r1,#0x20]
        0x080067f0:    780b        .x      LDRB     r3,[r1,#0]
        0x080067f2:    f8306023    0.#`    LDRH     r6,[r0,r3,LSL #2]
        0x080067f6:    f0160f40    ..@.    TST      r6,#0x40
        0x080067fa:    784e        Nx      LDRB     r6,[r1,#1]
        0x080067fc:    d07b        {.      BEQ      0x80068f6 ; USB_EPStartXfer + 554
        0x080067fe:    b116        ..      CBZ      r6,0x8006806 ; USB_EPStartXfer + 314
        0x08006800:    2e01        ..      CMP      r6,#1
        0x08006802:    d02f        /.      BEQ      0x8006864 ; USB_EPStartXfer + 408
        0x08006804:    e036        6.      B        0x8006874 ; USB_EPStartXfer + 424
        0x08006806:    f8b06050    ..P`    LDRH     r6,[r0,#0x50]
        0x0800680a:    4406        .D      ADD      r6,r6,r0
        0x0800680c:    eb0603c3    ....    ADD      r3,r6,r3,LSL #3
        0x08006810:    f8b36406    ...d    LDRH     r6,[r3,#0x406]
        0x08006814:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x08006818:    f8a36406    ...d    STRH     r6,[r3,#0x406]
        0x0800681c:    f2034306    ...C    ADD      r3,r3,#0x406
        0x08006820:    2a3e        >*      CMP      r2,#0x3e
        0x08006822:    d90c        ..      BLS      0x800683e ; USB_EPStartXfer + 370
        0x08006824:    0956        V.      LSRS     r6,r2,#5
        0x08006826:    f0120f1f    ....    TST      r2,#0x1f
        0x0800682a:    bf08        ..      IT       EQ
        0x0800682c:    1e76        v.      SUBEQ    r6,r6,#1
        0x0800682e:    f8b38000    ....    LDRH     r8,[r3,#0]
        0x08006832:    ea4c2686    L..&    ORR      r6,r12,r6,LSL #10
        0x08006836:    ea480606    H...    ORR      r6,r8,r6
        0x0800683a:    801e        ..      STRH     r6,[r3,#0]
        0x0800683c:    e01a        ..      B        0x8006874 ; USB_EPStartXfer + 424
        0x0800683e:    2a00        .*      CMP      r2,#0
        0x08006840:    bf04        ..      ITT      EQ
        0x08006842:    881e        ..      LDRHEQ   r6,[r3,#0]
        0x08006844:    f4464600    F..F    ORREQ    r6,r6,#0x8000
        0x08006848:    d0f7        ..      BEQ      0x800683a ; USB_EPStartXfer + 366
        0x0800684a:    0856        V.      LSRS     r6,r2,#1
        0x0800684c:    f0120f01    ....    TST      r2,#1
        0x08006850:    bf18        ..      IT       NE
        0x08006852:    1c76        v.      ADDNE    r6,r6,#1
        0x08006854:    f8b38000    ....    LDRH     r8,[r3,#0]
        0x08006858:    ea042686    ...&    AND      r6,r4,r6,LSL #10
        0x0800685c:    ea480606    H...    ORR      r6,r8,r6
        0x08006860:    801e        ..      STRH     r6,[r3,#0]
        0x08006862:    e007        ..      B        0x8006874 ; USB_EPStartXfer + 424
        0x08006864:    f8b08050    ..P.    LDRH     r8,[r0,#0x50]
        0x08006868:    eb080600    ....    ADD      r6,r8,r0
        0x0800686c:    eb0603c3    ....    ADD      r3,r6,r3,LSL #3
        0x08006870:    f8a32406    ...$    STRH     r2,[r3,#0x406]
        0x08006874:    f8b1800a    ....    LDRH     r8,[r1,#0xa]
        0x08006878:    b296        ..      UXTH     r6,r2
        0x0800687a:    1c76        v.      ADDS     r6,r6,#1
        0x0800687c:    694b        Ki      LDR      r3,[r1,#0x14]
        0x0800687e:    4480        .D      ADD      r8,r8,r0
        0x08006880:    0876        v.      LSRS     r6,r6,#1
        0x08006882:    f5086880    ...h    ADD      r8,r8,#0x400
        0x08006886:    d009        ..      BEQ      0x800689c ; USB_EPStartXfer + 464
        0x08006888:    f8139b01    ....    LDRB     r9,[r3],#1
        0x0800688c:    f813ab01    ....    LDRB     r10,[r3],#1
        0x08006890:    ea49290a    I..)    ORR      r9,r9,r10,LSL #8
        0x08006894:    f8289b02    (...    STRH     r9,[r8],#2
        0x08006898:    1e76        v.      SUBS     r6,r6,#1
        0x0800689a:    d1f5        ..      BNE      0x8006888 ; USB_EPStartXfer + 444
        0x0800689c:    694b        Ki      LDR      r3,[r1,#0x14]
        0x0800689e:    4413        .D      ADD      r3,r3,r2
        0x080068a0:    614b        Ka      STR      r3,[r1,#0x14]
        0x080068a2:    690e        .i      LDR      r6,[r1,#0x10]
        0x080068a4:    6a0b        .j      LDR      r3,[r1,#0x20]
        0x080068a6:    42b3        .B      CMP      r3,r6
        0x080068a8:    bf87        ..      ITTEE    HI
        0x080068aa:    1a9b        ..      SUBHI    r3,r3,r2
        0x080068ac:    620b        .b      STRHI    r3,[r1,#0x20]
        0x080068ae:    461a        .F      MOVLS    r2,r3
        0x080068b0:    620f        .b      STRLS    r7,[r1,#0x20]
        0x080068b2:    784b        Kx      LDRB     r3,[r1,#1]
        0x080068b4:    b113        ..      CBZ      r3,0x80068bc ; USB_EPStartXfer + 496
        0x080068b6:    2b01        .+      CMP      r3,#1
        0x080068b8:    d034        4.      BEQ      0x8006924 ; USB_EPStartXfer + 600
        0x080068ba:    e03c        <.      B        0x8006936 ; USB_EPStartXfer + 618
        0x080068bc:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x080068c0:    780e        .x      LDRB     r6,[r1,#0]
        0x080068c2:    4403        .D      ADD      r3,r3,r0
        0x080068c4:    eb0303c6    ....    ADD      r3,r3,r6,LSL #3
        0x080068c8:    f8b36402    ...d    LDRH     r6,[r3,#0x402]
        0x080068cc:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x080068d0:    f8a36402    ...d    STRH     r6,[r3,#0x402]
        0x080068d4:    f2034302    ...C    ADD      r3,r3,#0x402
        0x080068d8:    2a3e        >*      CMP      r2,#0x3e
