ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080068da:    d90d        ..      BLS      0x80068f8 ; USB_EPStartXfer + 556
        0x080068dc:    0954        T.      LSRS     r4,r2,#5
        0x080068de:    f0120f1f    ....    TST      r2,#0x1f
        0x080068e2:    bf08        ..      IT       EQ
        0x080068e4:    1e64        d.      SUBEQ    r4,r4,#1
        0x080068e6:    881e        ..      LDRH     r6,[r3,#0]
        0x080068e8:    ea4c2c84    L..,    ORR      r12,r12,r4,LSL #10
        0x080068ec:    ea460c0c    F...    ORR      r12,r6,r12
        0x080068f0:    f8a3c000    ....    STRH     r12,[r3,#0]
        0x080068f4:    e01f        ..      B        0x8006936 ; USB_EPStartXfer + 618
        0x080068f6:    e034        4.      B        0x8006962 ; USB_EPStartXfer + 662
        0x080068f8:    2a00        .*      CMP      r2,#0
        0x080068fa:    bf04        ..      ITT      EQ
        0x080068fc:    f8b3c000    ....    LDRHEQ   r12,[r3,#0]
        0x08006900:    f44c4c00    L..L    ORREQ    r12,r12,#0x8000
        0x08006904:    d0f4        ..      BEQ      0x80068f0 ; USB_EPStartXfer + 548
        0x08006906:    ea4f0c52    O.R.    LSR      r12,r2,#1
        0x0800690a:    f0120f01    ....    TST      r2,#1
        0x0800690e:    bf18        ..      IT       NE
        0x08006910:    f10c0c01    ....    ADDNE    r12,r12,#1
        0x08006914:    881e        ..      LDRH     r6,[r3,#0]
        0x08006916:    ea042c8c    ...,    AND      r12,r4,r12,LSL #10
        0x0800691a:    ea460c0c    F...    ORR      r12,r6,r12
        0x0800691e:    f8a3c000    ....    STRH     r12,[r3,#0]
        0x08006922:    e008        ..      B        0x8006936 ; USB_EPStartXfer + 618
        0x08006924:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x08006928:    f891c000    ....    LDRB     r12,[r1,#0]
        0x0800692c:    4403        .D      ADD      r3,r3,r0
        0x0800692e:    eb0303cc    ....    ADD      r3,r3,r12,LSL #3
        0x08006932:    f8a32402    ...$    STRH     r2,[r3,#0x402]
        0x08006936:    f8b1c008    ....    LDRH     r12,[r1,#8]
        0x0800693a:    b292        ..      UXTH     r2,r2
        0x0800693c:    1c52        R.      ADDS     r2,r2,#1
        0x0800693e:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08006940:    4484        .D      ADD      r12,r12,r0
        0x08006942:    0852        R.      LSRS     r2,r2,#1
        0x08006944:    f50c6c80    ...l    ADD      r12,r12,#0x400
        0x08006948:    d07e        ~.      BEQ      0x8006a48 ; USB_EPStartXfer + 892
        0x0800694a:    bf00        ..      NOP      
        0x0800694c:    f8134b01    ...K    LDRB     r4,[r3],#1
        0x08006950:    f8136b01    ...k    LDRB     r6,[r3],#1
        0x08006954:    ea442406    D..$    ORR      r4,r4,r6,LSL #8
        0x08006958:    f82c4b02    ,..K    STRH     r4,[r12],#2
        0x0800695c:    1e52        R.      SUBS     r2,r2,#1
        0x0800695e:    d1f5        ..      BNE      0x800694c ; USB_EPStartXfer + 640
        0x08006960:    e0f2        ..      B        0x8006b48 ; USB_EPStartXfer + 1148
        0x08006962:    b116        ..      CBZ      r6,0x800696a ; USB_EPStartXfer + 670
        0x08006964:    2e01        ..      CMP      r6,#1
        0x08006966:    d02f        /.      BEQ      0x80069c8 ; USB_EPStartXfer + 764
        0x08006968:    e035        5.      B        0x80069d6 ; USB_EPStartXfer + 778
        0x0800696a:    f8b06050    ..P`    LDRH     r6,[r0,#0x50]
        0x0800696e:    4406        .D      ADD      r6,r6,r0
        0x08006970:    eb0603c3    ....    ADD      r3,r6,r3,LSL #3
        0x08006974:    f8b36402    ...d    LDRH     r6,[r3,#0x402]
        0x08006978:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x0800697c:    f8a36402    ...d    STRH     r6,[r3,#0x402]
        0x08006980:    f2034302    ...C    ADD      r3,r3,#0x402
        0x08006984:    2a3e        >*      CMP      r2,#0x3e
        0x08006986:    d90c        ..      BLS      0x80069a2 ; USB_EPStartXfer + 726
        0x08006988:    0956        V.      LSRS     r6,r2,#5
        0x0800698a:    f0120f1f    ....    TST      r2,#0x1f
        0x0800698e:    bf08        ..      IT       EQ
        0x08006990:    1e76        v.      SUBEQ    r6,r6,#1
        0x08006992:    f8b38000    ....    LDRH     r8,[r3,#0]
        0x08006996:    ea4c2686    L..&    ORR      r6,r12,r6,LSL #10
        0x0800699a:    ea480606    H...    ORR      r6,r8,r6
        0x0800699e:    801e        ..      STRH     r6,[r3,#0]
        0x080069a0:    e019        ..      B        0x80069d6 ; USB_EPStartXfer + 778
        0x080069a2:    2a00        .*      CMP      r2,#0
        0x080069a4:    bf04        ..      ITT      EQ
        0x080069a6:    881e        ..      LDRHEQ   r6,[r3,#0]
        0x080069a8:    f4464600    F..F    ORREQ    r6,r6,#0x8000
        0x080069ac:    d0f7        ..      BEQ      0x800699e ; USB_EPStartXfer + 722
        0x080069ae:    0856        V.      LSRS     r6,r2,#1
        0x080069b0:    f0120f01    ....    TST      r2,#1
        0x080069b4:    bf18        ..      IT       NE
        0x080069b6:    1c76        v.      ADDNE    r6,r6,#1
        0x080069b8:    f8b38000    ....    LDRH     r8,[r3,#0]
        0x080069bc:    ea042686    ...&    AND      r6,r4,r6,LSL #10
        0x080069c0:    ea480606    H...    ORR      r6,r8,r6
        0x080069c4:    801e        ..      STRH     r6,[r3,#0]
        0x080069c6:    e006        ..      B        0x80069d6 ; USB_EPStartXfer + 778
        0x080069c8:    f8b06050    ..P`    LDRH     r6,[r0,#0x50]
        0x080069cc:    4406        .D      ADD      r6,r6,r0
        0x080069ce:    eb0603c3    ....    ADD      r3,r6,r3,LSL #3
        0x080069d2:    f8a32402    ...$    STRH     r2,[r3,#0x402]
        0x080069d6:    f8b18008    ....    LDRH     r8,[r1,#8]
        0x080069da:    b296        ..      UXTH     r6,r2
        0x080069dc:    1c76        v.      ADDS     r6,r6,#1
        0x080069de:    694b        Ki      LDR      r3,[r1,#0x14]
        0x080069e0:    4480        .D      ADD      r8,r8,r0
        0x080069e2:    0876        v.      LSRS     r6,r6,#1
        0x080069e4:    f5086880    ...h    ADD      r8,r8,#0x400
        0x080069e8:    d00a        ..      BEQ      0x8006a00 ; USB_EPStartXfer + 820
        0x080069ea:    bf00        ..      NOP      
        0x080069ec:    f8139b01    ....    LDRB     r9,[r3],#1
        0x080069f0:    f813ab01    ....    LDRB     r10,[r3],#1
        0x080069f4:    ea49290a    I..)    ORR      r9,r9,r10,LSL #8
        0x080069f8:    f8289b02    (...    STRH     r9,[r8],#2
        0x080069fc:    1e76        v.      SUBS     r6,r6,#1
        0x080069fe:    d1f5        ..      BNE      0x80069ec ; USB_EPStartXfer + 800
        0x08006a00:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08006a02:    4413        .D      ADD      r3,r3,r2
        0x08006a04:    614b        Ka      STR      r3,[r1,#0x14]
        0x08006a06:    690e        .i      LDR      r6,[r1,#0x10]
        0x08006a08:    6a0b        .j      LDR      r3,[r1,#0x20]
        0x08006a0a:    42b3        .B      CMP      r3,r6
        0x08006a0c:    bf87        ..      ITTEE    HI
        0x08006a0e:    1a9b        ..      SUBHI    r3,r3,r2
        0x08006a10:    620b        .b      STRHI    r3,[r1,#0x20]
        0x08006a12:    461a        .F      MOVLS    r2,r3
        0x08006a14:    620f        .b      STRLS    r7,[r1,#0x20]
        0x08006a16:    784b        Kx      LDRB     r3,[r1,#1]
        0x08006a18:    b113        ..      CBZ      r3,0x8006a20 ; USB_EPStartXfer + 852
        0x08006a1a:    2b01        .+      CMP      r3,#1
        0x08006a1c:    d035        5.      BEQ      0x8006a8a ; USB_EPStartXfer + 958
        0x08006a1e:    e03e        >.      B        0x8006a9e ; USB_EPStartXfer + 978
        0x08006a20:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x08006a24:    780e        .x      LDRB     r6,[r1,#0]
        0x08006a26:    4403        .D      ADD      r3,r3,r0
        0x08006a28:    eb0303c6    ....    ADD      r3,r3,r6,LSL #3
        0x08006a2c:    f8b36406    ...d    LDRH     r6,[r3,#0x406]
        0x08006a30:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x08006a34:    f8a36406    ...d    STRH     r6,[r3,#0x406]
        0x08006a38:    f2034306    ...C    ADD      r3,r3,#0x406
        0x08006a3c:    2a3e        >*      CMP      r2,#0x3e
        0x08006a3e:    d90e        ..      BLS      0x8006a5e ; USB_EPStartXfer + 914
        0x08006a40:    0954        T.      LSRS     r4,r2,#5
        0x08006a42:    f0120f1f    ....    TST      r2,#0x1f
        0x08006a46:    e000        ..      B        0x8006a4a ; USB_EPStartXfer + 894
        0x08006a48:    e07e        ~.      B        0x8006b48 ; USB_EPStartXfer + 1148
        0x08006a4a:    bf08        ..      IT       EQ
        0x08006a4c:    1e64        d.      SUBEQ    r4,r4,#1
        0x08006a4e:    881e        ..      LDRH     r6,[r3,#0]
        0x08006a50:    ea4c2c84    L..,    ORR      r12,r12,r4,LSL #10
        0x08006a54:    ea460c0c    F...    ORR      r12,r6,r12
        0x08006a58:    f8a3c000    ....    STRH     r12,[r3,#0]
        0x08006a5c:    e01f        ..      B        0x8006a9e ; USB_EPStartXfer + 978
        0x08006a5e:    2a00        .*      CMP      r2,#0
        0x08006a60:    bf04        ..      ITT      EQ
        0x08006a62:    f8b3c000    ....    LDRHEQ   r12,[r3,#0]
        0x08006a66:    f44c4c00    L..L    ORREQ    r12,r12,#0x8000
        0x08006a6a:    d0f5        ..      BEQ      0x8006a58 ; USB_EPStartXfer + 908
        0x08006a6c:    ea4f0c52    O.R.    LSR      r12,r2,#1
        0x08006a70:    f0120f01    ....    TST      r2,#1
        0x08006a74:    bf18        ..      IT       NE
        0x08006a76:    f10c0c01    ....    ADDNE    r12,r12,#1
        0x08006a7a:    881e        ..      LDRH     r6,[r3,#0]
        0x08006a7c:    ea042c8c    ...,    AND      r12,r4,r12,LSL #10
        0x08006a80:    ea460c0c    F...    ORR      r12,r6,r12
        0x08006a84:    f8a3c000    ....    STRH     r12,[r3,#0]
        0x08006a88:    e009        ..      B        0x8006a9e ; USB_EPStartXfer + 978
        0x08006a8a:    f8b0c050    ..P.    LDRH     r12,[r0,#0x50]
        0x08006a8e:    eb0c0300    ....    ADD      r3,r12,r0
        0x08006a92:    f891c000    ....    LDRB     r12,[r1,#0]
        0x08006a96:    eb0303cc    ....    ADD      r3,r3,r12,LSL #3
        0x08006a9a:    f8a32406    ...$    STRH     r2,[r3,#0x406]
        0x08006a9e:    f8b1c00a    ....    LDRH     r12,[r1,#0xa]
        0x08006aa2:    b292        ..      UXTH     r2,r2
        0x08006aa4:    1c52        R.      ADDS     r2,r2,#1
        0x08006aa6:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08006aa8:    4484        .D      ADD      r12,r12,r0
        0x08006aaa:    0852        R.      LSRS     r2,r2,#1
        0x08006aac:    f50c6c80    ...l    ADD      r12,r12,#0x400
        0x08006ab0:    d04a        J.      BEQ      0x8006b48 ; USB_EPStartXfer + 1148
        0x08006ab2:    bf00        ..      NOP      
        0x08006ab4:    f8134b01    ...K    LDRB     r4,[r3],#1
        0x08006ab8:    f8136b01    ...k    LDRB     r6,[r3],#1
        0x08006abc:    ea442406    D..$    ORR      r4,r4,r6,LSL #8
        0x08006ac0:    f82c4b02    ,..K    STRH     r4,[r12],#2
        0x08006ac4:    1e52        R.      SUBS     r2,r2,#1
        0x08006ac6:    d1f5        ..      BNE      0x8006ab4 ; USB_EPStartXfer + 1000
        0x08006ac8:    e03e        >.      B        0x8006b48 ; USB_EPStartXfer + 1148
        0x08006aca:    780a        .x      LDRB     r2,[r1,#0]
        0x08006acc:    f8303022    0."0    LDRH     r3,[r0,r2,LSL #2]
        0x08006ad0:    f42373b8    #..s    BIC      r3,r3,#0x170
        0x08006ad4:    f42343e0    #..C    BIC      r3,r3,#0x7000
        0x08006ad8:    432b        +C      ORRS     r3,r3,r5
        0x08006ada:    f8203022     ."0    STRH     r3,[r0,r2,LSL #2]
        0x08006ade:    f8b02050    ..P     LDRH     r2,[r0,#0x50]
        0x08006ae2:    780b        .x      LDRB     r3,[r1,#0]
        0x08006ae4:    4402        .D      ADD      r2,r2,r0
        0x08006ae6:    eb0202c3    ....    ADD      r2,r2,r3,LSL #3
        0x08006aea:    f8a26402    ...d    STRH     r6,[r2,#0x402]
        0x08006aee:    f8b1c008    ....    LDRH     r12,[r1,#8]
        0x08006af2:    b2b3        ..      UXTH     r3,r6
        0x08006af4:    1c5b        [.      ADDS     r3,r3,#1
        0x08006af6:    694a        Ji      LDR      r2,[r1,#0x14]
        0x08006af8:    4484        .D      ADD      r12,r12,r0
        0x08006afa:    085b        [.      LSRS     r3,r3,#1
        0x08006afc:    f50c6c80    ...l    ADD      r12,r12,#0x400
        0x08006b00:    d022        ".      BEQ      0x8006b48 ; USB_EPStartXfer + 1148
        0x08006b02:    bf00        ..      NOP      
        0x08006b04:    f8124b01    ...K    LDRB     r4,[r2],#1
        0x08006b08:    f8126b01    ...k    LDRB     r6,[r2],#1
        0x08006b0c:    ea442406    D..$    ORR      r4,r4,r6,LSL #8
        0x08006b10:    f82c4b02    ,..K    STRH     r4,[r12],#2
        0x08006b14:    1e5b        [.      SUBS     r3,r3,#1
        0x08006b16:    d1f5        ..      BNE      0x8006b04 ; USB_EPStartXfer + 1080
        0x08006b18:    e016        ..      B        0x8006b48 ; USB_EPStartXfer + 1148
        0x08006b1a:    bf00        ..      NOP      
        0x08006b1c:    f8a32402    ...$    STRH     r2,[r3,#0x402]
        0x08006b20:    f8b1c008    ....    LDRH     r12,[r1,#8]
        0x08006b24:    b292        ..      UXTH     r2,r2
        0x08006b26:    1c52        R.      ADDS     r2,r2,#1
        0x08006b28:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08006b2a:    4484        .D      ADD      r12,r12,r0
        0x08006b2c:    0852        R.      LSRS     r2,r2,#1
        0x08006b2e:    f50c6c80    ...l    ADD      r12,r12,#0x400
        0x08006b32:    d009        ..      BEQ      0x8006b48 ; USB_EPStartXfer + 1148
        0x08006b34:    f8134b01    ...K    LDRB     r4,[r3],#1
        0x08006b38:    f8136b01    ...k    LDRB     r6,[r3],#1
        0x08006b3c:    ea442406    D..$    ORR      r4,r4,r6,LSL #8
        0x08006b40:    f82c4b02    ,..K    STRH     r4,[r12],#2
        0x08006b44:    1e52        R.      SUBS     r2,r2,#1
        0x08006b46:    d1f5        ..      BNE      0x8006b34 ; USB_EPStartXfer + 1128
        0x08006b48:    7809        .x      LDRB     r1,[r1,#0]
        0x08006b4a:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x08006b4e:    f4225241    ".AR    BIC      r2,r2,#0x3040
        0x08006b52:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08006b56:    f0820230    ..0.    EOR      r2,r2,#0x30
        0x08006b5a:    432a        *C      ORRS     r2,r2,r5
        0x08006b5c:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x08006b60:    f000b92d    ..-.    B.W      0x8006dbe ; USB_EPStartXfer + 1778
        0x08006b64:    698b        .i      LDR      r3,[r1,#0x18]
        0x08006b66:    690a        .i      LDR      r2,[r1,#0x10]
        0x08006b68:    4293        .B      CMP      r3,r2
        0x08006b6a:    bf87        ..      ITTEE    HI
        0x08006b6c:    1a9b        ..      SUBHI    r3,r3,r2
        0x08006b6e:    618b        .a      STRHI    r3,[r1,#0x18]
        0x08006b70:    461a        .F      MOVLS    r2,r3
        0x08006b72:    618f        .a      STRLS    r7,[r1,#0x18]
        0x08006b74:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x08006b78:    780e        .x      LDRB     r6,[r1,#0]
        0x08006b7a:    4403        .D      ADD      r3,r3,r0
        0x08006b7c:    eb0303c6    ....    ADD      r3,r3,r6,LSL #3
        0x08006b80:    f8b36406    ...d    LDRH     r6,[r3,#0x406]
        0x08006b84:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x08006b88:    f8a36406    ...d    STRH     r6,[r3,#0x406]
        0x08006b8c:    f2034306    ...C    ADD      r3,r3,#0x406
        0x08006b90:    2a3e        >*      CMP      r2,#0x3e
        0x08006b92:    d905        ..      BLS      0x8006ba0 ; USB_EPStartXfer + 1236
        0x08006b94:    0954        T.      LSRS     r4,r2,#5
        0x08006b96:    f0120f1f    ....    TST      r2,#0x1f
        0x08006b9a:    d175        u.      BNE      0x8006c88 ; USB_EPStartXfer + 1468
        0x08006b9c:    1e64        d.      SUBS     r4,r4,#1
        0x08006b9e:    e0e0        ..      B        0x8006d62 ; USB_EPStartXfer + 1686
        0x08006ba0:    2a00        .*      CMP      r2,#0
        0x08006ba2:    d072        r.      BEQ      0x8006c8a ; USB_EPStartXfer + 1470
        0x08006ba4:    ea4f0c52    O.R.    LSR      r12,r2,#1
        0x08006ba8:    f0120f01    ....    TST      r2,#1
        0x08006bac:    bf18        ..      IT       NE
        0x08006bae:    f10c0c01    ....    ADDNE    r12,r12,#1
        0x08006bb2:    881a        ..      LDRH     r2,[r3,#0]
        0x08006bb4:    ea042c8c    ...,    AND      r12,r4,r12,LSL #10
        0x08006bb8:    ea42020c    B...    ORR      r2,r2,r12
        0x08006bbc:    801a        ..      STRH     r2,[r3,#0]
        0x08006bbe:    e0f2        ..      B        0x8006da6 ; USB_EPStartXfer + 1754
        0x08006bc0:    f1b80f00    ....    CMP      r8,#0
        0x08006bc4:    d11a        ..      BNE      0x8006bfc ; USB_EPStartXfer + 1328
        0x08006bc6:    f8b02050    ..P     LDRH     r2,[r0,#0x50]
        0x08006bca:    780b        .x      LDRB     r3,[r1,#0]
        0x08006bcc:    4402        .D      ADD      r2,r2,r0
        0x08006bce:    eb0202c3    ....    ADD      r2,r2,r3,LSL #3
        0x08006bd2:    f8b23402    ...4    LDRH     r3,[r2,#0x402]
        0x08006bd6:    f3c30309    ....    UBFX     r3,r3,#0,#10
        0x08006bda:    f8a23402    ...4    STRH     r3,[r2,#0x402]
        0x08006bde:    690b        .i      LDR      r3,[r1,#0x10]
        0x08006be0:    f2024202    ...B    ADD      r2,r2,#0x402
        0x08006be4:    2b3e        >+      CMP      r3,#0x3e
        0x08006be6:    d90e        ..      BLS      0x8006c06 ; USB_EPStartXfer + 1338
        0x08006be8:    095e        ^.      LSRS     r6,r3,#5
        0x08006bea:    f0130f1f    ....    TST      r3,#0x1f
        0x08006bee:    bf08        ..      IT       EQ
        0x08006bf0:    1e76        v.      SUBEQ    r6,r6,#1
        0x08006bf2:    8817        ..      LDRH     r7,[r2,#0]
        0x08006bf4:    ea4c2386    L..#    ORR      r3,r12,r6,LSL #10
        0x08006bf8:    433b        ;C      ORRS     r3,r3,r7
        0x08006bfa:    8013        ..      STRH     r3,[r2,#0]
        0x08006bfc:    784a        Jx      LDRB     r2,[r1,#1]
        0x08006bfe:    b19a        ..      CBZ      r2,0x8006c28 ; USB_EPStartXfer + 1372
        0x08006c00:    2a01        .*      CMP      r2,#1
        0x08006c02:    d043        C.      BEQ      0x8006c8c ; USB_EPStartXfer + 1472
        0x08006c04:    e04b        K.      B        0x8006c9e ; USB_EPStartXfer + 1490
        0x08006c06:    2b00        .+      CMP      r3,#0
        0x08006c08:    bf04        ..      ITT      EQ
        0x08006c0a:    8813        ..      LDRHEQ   r3,[r2,#0]
        0x08006c0c:    f4434300    C..C    ORREQ    r3,r3,#0x8000
        0x08006c10:    d0f3        ..      BEQ      0x8006bfa ; USB_EPStartXfer + 1326
        0x08006c12:    085e        ^.      LSRS     r6,r3,#1
        0x08006c14:    f0130f01    ....    TST      r3,#1
        0x08006c18:    bf18        ..      IT       NE
        0x08006c1a:    1c76        v.      ADDNE    r6,r6,#1
        0x08006c1c:    8813        ..      LDRH     r3,[r2,#0]
        0x08006c1e:    ea042686    ...&    AND      r6,r4,r6,LSL #10
        0x08006c22:    4333        3C      ORRS     r3,r3,r6
        0x08006c24:    8013        ..      STRH     r3,[r2,#0]
        0x08006c26:    e7e9        ..      B        0x8006bfc ; USB_EPStartXfer + 1328
        0x08006c28:    f8b02050    ..P     LDRH     r2,[r0,#0x50]
        0x08006c2c:    780b        .x      LDRB     r3,[r1,#0]
        0x08006c2e:    4402        .D      ADD      r2,r2,r0
        0x08006c30:    eb0202c3    ....    ADD      r2,r2,r3,LSL #3
        0x08006c34:    f8b23406    ...4    LDRH     r3,[r2,#0x406]
        0x08006c38:    f3c30309    ....    UBFX     r3,r3,#0,#10
        0x08006c3c:    f8a23406    ...4    STRH     r3,[r2,#0x406]
        0x08006c40:    690b        .i      LDR      r3,[r1,#0x10]
        0x08006c42:    f2024206    ...B    ADD      r2,r2,#0x406
        0x08006c46:    2b3e        >+      CMP      r3,#0x3e
        0x08006c48:    d90a        ..      BLS      0x8006c60 ; USB_EPStartXfer + 1428
        0x08006c4a:    095c        \.      LSRS     r4,r3,#5
        0x08006c4c:    f0130f1f    ....    TST      r3,#0x1f
        0x08006c50:    bf08        ..      IT       EQ
        0x08006c52:    1e64        d.      SUBEQ    r4,r4,#1
        0x08006c54:    8816        ..      LDRH     r6,[r2,#0]
        0x08006c56:    ea4c2384    L..#    ORR      r3,r12,r4,LSL #10
        0x08006c5a:    4333        3C      ORRS     r3,r3,r6
        0x08006c5c:    8013        ..      STRH     r3,[r2,#0]
        0x08006c5e:    e01e        ..      B        0x8006c9e ; USB_EPStartXfer + 1490
        0x08006c60:    2b00        .+      CMP      r3,#0
        0x08006c62:    bf04        ..      ITT      EQ
        0x08006c64:    8813        ..      LDRHEQ   r3,[r2,#0]
        0x08006c66:    f4434300    C..C    ORREQ    r3,r3,#0x8000
        0x08006c6a:    d0f7        ..      BEQ      0x8006c5c ; USB_EPStartXfer + 1424
        0x08006c6c:    ea4f0c53    O.S.    LSR      r12,r3,#1
        0x08006c70:    f0130f01    ....    TST      r3,#1
        0x08006c74:    bf18        ..      IT       NE
        0x08006c76:    f10c0c01    ....    ADDNE    r12,r12,#1
        0x08006c7a:    8813        ..      LDRH     r3,[r2,#0]
        0x08006c7c:    ea042c8c    ...,    AND      r12,r4,r12,LSL #10
        0x08006c80:    ea43030c    C...    ORR      r3,r3,r12
        0x08006c84:    8013        ..      STRH     r3,[r2,#0]
        0x08006c86:    e00a        ..      B        0x8006c9e ; USB_EPStartXfer + 1490
        0x08006c88:    e06b        k.      B        0x8006d62 ; USB_EPStartXfer + 1686
        0x08006c8a:    e07e        ~.      B        0x8006d8a ; USB_EPStartXfer + 1726
        0x08006c8c:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x08006c90:    181a        ..      ADDS     r2,r3,r0
        0x08006c92:    780b        .x      LDRB     r3,[r1,#0]
        0x08006c94:    eb0202c3    ....    ADD      r2,r2,r3,LSL #3
        0x08006c98:    8a0b        ..      LDRH     r3,[r1,#0x10]
        0x08006c9a:    f8a23406    ...4    STRH     r3,[r2,#0x406]
        0x08006c9e:    69ca        .i      LDR      r2,[r1,#0x1c]
        0x08006ca0:    b3c2        ..      CBZ      r2,0x8006d14 ; USB_EPStartXfer + 1608
        0x08006ca2:    780b        .x      LDRB     r3,[r1,#0]
        0x08006ca4:    f8302023    0.#     LDRH     r2,[r0,r3,LSL #2]
        0x08006ca8:    f4124f80    ...O    TST      r2,#0x4000
        0x08006cac:    bf18        ..      IT       NE
        0x08006cae:    f0120f40    ..@.    TSTNE    r2,#0x40
        0x08006cb2:    d104        ..      BNE      0x8006cbe ; USB_EPStartXfer + 1522
        0x08006cb4:    f02202bf    "...    BIC      r2,r2,#0xbf
        0x08006cb8:    f432423f    2.?B    BICS     r2,r2,#0xbf00
        0x08006cbc:    d173        s.      BNE      0x8006da6 ; USB_EPStartXfer + 1754
        0x08006cbe:    f8302023    0.#     LDRH     r2,[r0,r3,LSL #2]
        0x08006cc2:    f2480cc0    H...    MOV      r12,#0x80c0
        0x08006cc6:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x08006cca:    f42242e0    "..B    BIC      r2,r2,#0x7000
        0x08006cce:    ea42020c    B...    ORR      r2,r2,r12
        0x08006cd2:    f8202023     .#     STRH     r2,[r0,r3,LSL #2]
        0x08006cd6:    e066        f.      B        0x8006da6 ; USB_EPStartXfer + 1754
        0x08006cd8:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
