ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x08006cdc:    780e        .x      LDRB     r6,[r1,#0]
        0x08006cde:    4403        .D      ADD      r3,r3,r0
        0x08006ce0:    eb0303c6    ....    ADD      r3,r3,r6,LSL #3
        0x08006ce4:    f8b36402    ...d    LDRH     r6,[r3,#0x402]
        0x08006ce8:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x08006cec:    f8a36402    ...d    STRH     r6,[r3,#0x402]
        0x08006cf0:    f2034302    ...C    ADD      r3,r3,#0x402
        0x08006cf4:    2a3e        >*      CMP      r2,#0x3e
        0x08006cf6:    d90e        ..      BLS      0x8006d16 ; USB_EPStartXfer + 1610
        0x08006cf8:    0956        V.      LSRS     r6,r2,#5
        0x08006cfa:    f0120f1f    ....    TST      r2,#0x1f
        0x08006cfe:    bf08        ..      IT       EQ
        0x08006d00:    1e76        v.      SUBEQ    r6,r6,#1
        0x08006d02:    881f        ..      LDRH     r7,[r3,#0]
        0x08006d04:    ea4c2686    L..&    ORR      r6,r12,r6,LSL #10
        0x08006d08:    433e        >C      ORRS     r6,r6,r7
        0x08006d0a:    801e        ..      STRH     r6,[r3,#0]
        0x08006d0c:    784b        Kx      LDRB     r3,[r1,#1]
        0x08006d0e:    b19b        ..      CBZ      r3,0x8006d38 ; USB_EPStartXfer + 1644
        0x08006d10:    2b01        .+      CMP      r3,#1
        0x08006d12:    d03e        >.      BEQ      0x8006d92 ; USB_EPStartXfer + 1734
        0x08006d14:    e047        G.      B        0x8006da6 ; USB_EPStartXfer + 1754
        0x08006d16:    2a00        .*      CMP      r2,#0
        0x08006d18:    bf04        ..      ITT      EQ
        0x08006d1a:    881e        ..      LDRHEQ   r6,[r3,#0]
        0x08006d1c:    f4464600    F..F    ORREQ    r6,r6,#0x8000
        0x08006d20:    d0f3        ..      BEQ      0x8006d0a ; USB_EPStartXfer + 1598
        0x08006d22:    0856        V.      LSRS     r6,r2,#1
        0x08006d24:    f0120f01    ....    TST      r2,#1
        0x08006d28:    bf18        ..      IT       NE
        0x08006d2a:    1c76        v.      ADDNE    r6,r6,#1
        0x08006d2c:    881f        ..      LDRH     r7,[r3,#0]
        0x08006d2e:    ea042686    ...&    AND      r6,r4,r6,LSL #10
        0x08006d32:    433e        >C      ORRS     r6,r6,r7
        0x08006d34:    801e        ..      STRH     r6,[r3,#0]
        0x08006d36:    e7e9        ..      B        0x8006d0c ; USB_EPStartXfer + 1600
        0x08006d38:    f8b03050    ..P0    LDRH     r3,[r0,#0x50]
        0x08006d3c:    780e        .x      LDRB     r6,[r1,#0]
        0x08006d3e:    4403        .D      ADD      r3,r3,r0
        0x08006d40:    eb0303c6    ....    ADD      r3,r3,r6,LSL #3
        0x08006d44:    f8b36406    ...d    LDRH     r6,[r3,#0x406]
        0x08006d48:    f3c60609    ....    UBFX     r6,r6,#0,#10
        0x08006d4c:    f8a36406    ...d    STRH     r6,[r3,#0x406]
        0x08006d50:    f2034306    ...C    ADD      r3,r3,#0x406
        0x08006d54:    2a3e        >*      CMP      r2,#0x3e
        0x08006d56:    d90a        ..      BLS      0x8006d6e ; USB_EPStartXfer + 1698
        0x08006d58:    0954        T.      LSRS     r4,r2,#5
        0x08006d5a:    f0120f1f    ....    TST      r2,#0x1f
        0x08006d5e:    f43faf1d    ?...    BEQ      0x8006b9c ; USB_EPStartXfer + 1232
        0x08006d62:    881e        ..      LDRH     r6,[r3,#0]
        0x08006d64:    ea4c2284    L.."    ORR      r2,r12,r4,LSL #10
        0x08006d68:    4332        2C      ORRS     r2,r2,r6
        0x08006d6a:    801a        ..      STRH     r2,[r3,#0]
        0x08006d6c:    e01b        ..      B        0x8006da6 ; USB_EPStartXfer + 1754
        0x08006d6e:    b162        b.      CBZ      r2,0x8006d8a ; USB_EPStartXfer + 1726
        0x08006d70:    ea4f0c52    O.R.    LSR      r12,r2,#1
        0x08006d74:    f0120f01    ....    TST      r2,#1
        0x08006d78:    bf18        ..      IT       NE
        0x08006d7a:    f10c0c01    ....    ADDNE    r12,r12,#1
        0x08006d7e:    881a        ..      LDRH     r2,[r3,#0]
        0x08006d80:    ea042c8c    ...,    AND      r12,r4,r12,LSL #10
        0x08006d84:    ea42020c    B...    ORR      r2,r2,r12
        0x08006d88:    e7ef        ..      B        0x8006d6a ; USB_EPStartXfer + 1694
        0x08006d8a:    881a        ..      LDRH     r2,[r3,#0]
        0x08006d8c:    f4424200    B..B    ORR      r2,r2,#0x8000
        0x08006d90:    e7eb        ..      B        0x8006d6a ; USB_EPStartXfer + 1694
        0x08006d92:    f8b0c050    ..P.    LDRH     r12,[r0,#0x50]
        0x08006d96:    eb0c0300    ....    ADD      r3,r12,r0
        0x08006d9a:    f891c000    ....    LDRB     r12,[r1,#0]
        0x08006d9e:    eb0303cc    ....    ADD      r3,r3,r12,LSL #3
        0x08006da2:    f8a32406    ...$    STRH     r2,[r3,#0x406]
        0x08006da6:    7809        .x      LDRB     r1,[r1,#0]
        0x08006da8:    f8302021    0.!     LDRH     r2,[r0,r1,LSL #2]
        0x08006dac:    f0220270    ".p.    BIC      r2,r2,#0x70
        0x08006db0:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08006db4:    f4825240    ..@R    EOR      r2,r2,#0x3000
        0x08006db8:    432a        *C      ORRS     r2,r2,r5
        0x08006dba:    f8202021     .!     STRH     r2,[r0,r1,LSL #2]
        0x08006dbe:    e8bd07f0    ....    POP      {r4-r10}
        0x08006dc2:    2000        .       MOVS     r0,#0
        0x08006dc4:    4770        pG      BX       lr
    i.USB_EnableGlobalInt
    USB_EnableGlobalInt
        0x08006dc6:    2100        .!      MOVS     r1,#0
        0x08006dc8:    f8a01044    ..D.    STRH     r1,[r0,#0x44]
        0x08006dcc:    f64b7180    K..q    MOV      r1,#0xbf80
        0x08006dd0:    f8a01040    ..@.    STRH     r1,[r0,#0x40]
        0x08006dd4:    2000        .       MOVS     r0,#0
        0x08006dd6:    4770        pG      BX       lr
    i.USB_LP_IRQHandler
    USB_LP_IRQHandler
        0x08006dd8:    4801        .H      LDR      r0,[pc,#4] ; [0x8006de0] = 0x20000fcc
        0x08006dda:    f7fabebc    ....    B        HAL_PCD_IRQHandler ; 0x8001b56
    $d
        0x08006dde:    0000        ..      DCW    0
        0x08006de0:    20000fcc    ...     DCD    536874956
    $t
    i.USB_ReadInterrupts
    USB_ReadInterrupts
        0x08006de4:    f8b00044    ..D.    LDRH     r0,[r0,#0x44]
        0x08006de8:    4770        pG      BX       lr
    i.USB_ReadPMA
    USB_ReadPMA
        0x08006dea:    4410        .D      ADD      r0,r0,r2
        0x08006dec:    ea5f0c53    _.S.    LSRS     r12,r3,#1
        0x08006df0:    f5006080    ...`    ADD      r0,r0,#0x400
        0x08006df4:    d009        ..      BEQ      0x8006e0a ; USB_ReadPMA + 32
        0x08006df6:    f8302b02    0..+    LDRH     r2,[r0],#2
        0x08006dfa:    f8012b01    ...+    STRB     r2,[r1],#1
        0x08006dfe:    0a12        ..      LSRS     r2,r2,#8
        0x08006e00:    f8012b01    ...+    STRB     r2,[r1],#1
        0x08006e04:    f1bc0c01    ....    SUBS     r12,r12,#1
        0x08006e08:    d1f5        ..      BNE      0x8006df6 ; USB_ReadPMA + 12
        0x08006e0a:    f0130f01    ....    TST      r3,#1
        0x08006e0e:    bf1c        ..      ITT      NE
        0x08006e10:    8800        ..      LDRHNE   r0,[r0,#0]
        0x08006e12:    7008        .p      STRBNE   r0,[r1,#0]
        0x08006e14:    4770        pG      BX       lr
    i.USB_SetDevAddress
    USB_SetDevAddress
        0x08006e16:    2900        .)      CMP      r1,#0
        0x08006e18:    bf04        ..      ITT      EQ
        0x08006e1a:    2180        .!      MOVEQ    r1,#0x80
        0x08006e1c:    f8a0104c    ..L.    STRHEQ   r1,[r0,#0x4c]
        0x08006e20:    2000        .       MOVS     r0,#0
        0x08006e22:    4770        pG      BX       lr
    i.USB_WritePMA
    USB_WritePMA
        0x08006e24:    1c5b        [.      ADDS     r3,r3,#1
        0x08006e26:    4410        .D      ADD      r0,r0,r2
        0x08006e28:    085b        [.      LSRS     r3,r3,#1
        0x08006e2a:    f5006080    ...`    ADD      r0,r0,#0x400
        0x08006e2e:    bf08        ..      IT       EQ
        0x08006e30:    4770        pG      BXEQ     lr
        0x08006e32:    bf00        ..      NOP      
        0x08006e34:    f8112b01    ...+    LDRB     r2,[r1],#1
        0x08006e38:    f811cb01    ....    LDRB     r12,[r1],#1
        0x08006e3c:    ea42220c    B.."    ORR      r2,r2,r12,LSL #8
        0x08006e40:    f8202b02     ..+    STRH     r2,[r0],#2
        0x08006e44:    1e5b        [.      SUBS     r3,r3,#1
        0x08006e46:    d1f5        ..      BNE      0x8006e34 ; USB_WritePMA + 16
        0x08006e48:    4770        pG      BX       lr
    i.UsageFault_Handler
    UsageFault_Handler
        0x08006e4a:    e7fe        ..      B        UsageFault_Handler ; 0x8006e4a
    i._DoInit
    _DoInit
        0x08006e4c:    b510        ..      PUSH     {r4,lr}
        0x08006e4e:    4c16        .L      LDR      r4,[pc,#88] ; [0x8006ea8] = 0x200008f4
        0x08006e50:    21a8        .!      MOVS     r1,#0xa8
        0x08006e52:    4620         F      MOV      r0,r4
        0x08006e54:    f7f9fac7    ....    BL       __aeabi_memclr4 ; 0x80003e6
        0x08006e58:    2003        .       MOVS     r0,#3
        0x08006e5a:    6120         a      STR      r0,[r4,#0x10]
        0x08006e5c:    6160        `a      STR      r0,[r4,#0x14]
        0x08006e5e:    a013        ..      ADR      r0,{pc}+0x4e ; 0x8006eac
        0x08006e60:    61a0        .a      STR      r0,[r4,#0x18]
        0x08006e62:    f10400a8    ....    ADD      r0,r4,#0xa8
        0x08006e66:    61e0        .a      STR      r0,[r4,#0x1c]
        0x08006e68:    f44f6080    O..`    MOV      r0,#0x400
        0x08006e6c:    6220         b      STR      r0,[r4,#0x20]
        0x08006e6e:    2000        .       MOVS     r0,#0
        0x08006e70:    62a0        .b      STR      r0,[r4,#0x28]
        0x08006e72:    6260        `b      STR      r0,[r4,#0x24]
        0x08006e74:    62e0        .b      STR      r0,[r4,#0x2c]
        0x08006e76:    a10d        ..      ADR      r1,{pc}+0x36 ; 0x8006eac
        0x08006e78:    6621        !f      STR      r1,[r4,#0x60]
        0x08006e7a:    f5046195    ...a    ADD      r1,r4,#0x4a8
        0x08006e7e:    6661        af      STR      r1,[r4,#0x64]
        0x08006e80:    2110        .!      MOVS     r1,#0x10
        0x08006e82:    66a1        .f      STR      r1,[r4,#0x68]
        0x08006e84:    6720         g      STR      r0,[r4,#0x70]
        0x08006e86:    66e0        .f      STR      r0,[r4,#0x6c]
        0x08006e88:    6760        `g      STR      r0,[r4,#0x74]
        0x08006e8a:    490b        .I      LDR      r1,[pc,#44] ; [0x8006eb8] = 0x8008e18
        0x08006e8c:    f1c0020f    ....    RSB      r2,r0,#0xf
        0x08006e90:    5c8a        .\      LDRB     r2,[r1,r2]
        0x08006e92:    5422        "T      STRB     r2,[r4,r0]
        0x08006e94:    f1c0020e    ....    RSB      r2,r0,#0xe
        0x08006e98:    1823        #.      ADDS     r3,r4,r0
        0x08006e9a:    5c8a        .\      LDRB     r2,[r1,r2]
        0x08006e9c:    705a        Zp      STRB     r2,[r3,#1]
        0x08006e9e:    1c80        ..      ADDS     r0,r0,#2
        0x08006ea0:    2810        .(      CMP      r0,#0x10
        0x08006ea2:    d3f3        ..      BCC      0x8006e8c ; _DoInit + 64
        0x08006ea4:    bd10        ..      POP      {r4,pc}
    $d
        0x08006ea6:    0000        ..      DCW    0
        0x08006ea8:    200008f4    ...     DCD    536873204
        0x08006eac:    6d726554    Term    DCD    1836213588
        0x08006eb0:    6c616e69    inal    DCD    1818324585
        0x08006eb4:    00000000    ....    DCD    0
        0x08006eb8:    08008e18    ....    DCD    134254104
    $t
    i.atan2Rad
    atan2Rad
        0x08006ebc:    ed9f1a3f    ..?.    VLDR     s2,[pc,#252] ; [0x8006fbc] = 0
        0x08006ec0:    eeb50ac0    ....    VCMPE.F32 s0,#0.0
        0x08006ec4:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006ec8:    bf04        ..      ITT      EQ
        0x08006eca:    eef50ac0    ....    VCMPEEQ.F32 s1,#0.0
        0x08006ece:    eef1fa10    ....    VMRSEQ   APSR_nzcv,FPSCR
        0x08006ed2:    d065        e.      BEQ      0x8006fa0 ; atan2Rad + 228
        0x08006ed4:    eeb50ac0    ....    VCMPE.F32 s0,#0.0
        0x08006ed8:    2100        .!      MOVS     r1,#0
        0x08006eda:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006ede:    d264        d.      BCS      0x8006faa ; atan2Rad + 238
        0x08006ee0:    eef50ac0    ....    VCMPE.F32 s1,#0.0
        0x08006ee4:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006ee8:    bf2c        ,.      ITE      CS
        0x08006eea:    2204        ."      MOVCS    r2,#4
        0x08006eec:    2203        ."      MOVCC    r2,#3
        0x08006eee:    eef50ac0    ....    VCMPE.F32 s1,#0.0
        0x08006ef2:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006ef6:    bfd8        ..      IT       LE
        0x08006ef8:    eef10a60    ..`.    VNEGLE.F32 s1,s1
        0x08006efc:    eeb50ac0    ....    VCMPE.F32 s0,#0.0
        0x08006f00:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006f04:    bfd8        ..      IT       LE
        0x08006f06:    eeb10a40    ..@.    VNEGLE.F32 s0,s0
        0x08006f0a:    eeb40ae0    ....    VCMPE.F32 s0,s1
        0x08006f0e:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006f12:    bfd8        ..      IT       LE
        0x08006f14:    eef01a60    ..`.    VMOVLE.F32 s3,s1
        0x08006f18:    dd04        ..      BLE      0x8006f24 ; atan2Rad + 104
        0x08006f1a:    eef01a40    ..@.    VMOV.F32 s3,s0
        0x08006f1e:    eeb00a60    ..`.    VMOV.F32 s0,s1
        0x08006f22:    2101        .!      MOVS     r1,#1
        0x08006f24:    ee802a21    ..!*    VDIV.F32 s4,s0,s3
        0x08006f28:    ed9f0a26    ..&.    VLDR     s0,[pc,#152] ; [0x8006fc4] = 0x437e0000
        0x08006f2c:    eddf2a24    ..$*    VLDR     s5,[pc,#144] ; [0x8006fc0] = 0x3b810204
        0x08006f30:    eef70a00    ....    VMOV.F32 s1,#1.00000000
        0x08006f34:    ee621a00    b...    VMUL.F32 s3,s4,s0
        0x08006f38:    eef41ac0    ....    VCMPE.F32 s3,s0
        0x08006f3c:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006f40:    bf28        (.      IT       CS
        0x08006f42:    20fd        .       MOVCS    r0,#0xfd
        0x08006f44:    d20b        ..      BCS      0x8006f5e ; atan2Rad + 162
        0x08006f46:    eefc0ae1    ....    VCVT.U32.F32 s1,s3
        0x08006f4a:    ee100a90    ....    VMOV     r0,s1
        0x08006f4e:    eef80a60    ..`.    VCVT.F32.U32 s1,s1
        0x08006f52:    ee001aa2    ....    VMLA.F32 s2,s1,s5
        0x08006f56:    ee720a41    r.A.    VSUB.F32 s1,s4,s2
        0x08006f5a:    ee600a80    `...    VMUL.F32 s1,s1,s0
        0x08006f5e:    4b1a        .K      LDR      r3,[pc,#104] ; [0x8006fc8] = 0x8008a1c
        0x08006f60:    2900        .)      CMP      r1,#0
        0x08006f62:    eb030080    ....    ADD      r0,r3,r0,LSL #2
        0x08006f66:    ed901a00    ....    VLDR     s2,[r0,#0]
        0x08006f6a:    ed900a01    ....    VLDR     s0,[r0,#4]
        0x08006f6e:    ee300a41    0.A.    VSUB.F32 s0,s0,s2
        0x08006f72:    ee001a20    .. .    VMLA.F32 s2,s0,s1
        0x08006f76:    bf1c        ..      ITT      NE
        0x08006f78:    eeb50a00    ....    VMOVNE.F32 s0,#0.25000000
        0x08006f7c:    ee301a41    0.A.    VSUBNE.F32 s2,s0,s2
        0x08006f80:    eeb60a00    ....    VMOV.F32 s0,#0.50000000
        0x08006f84:    2a02        .*      CMP      r2,#2
        0x08006f86:    bf08        ..      IT       EQ
        0x08006f88:    ee301a41    0.A.    VSUBEQ.F32 s2,s0,s2
        0x08006f8c:    d008        ..      BEQ      0x8006fa0 ; atan2Rad + 228
        0x08006f8e:    2a03        .*      CMP      r2,#3
        0x08006f90:    bf08        ..      IT       EQ
        0x08006f92:    ee311a40    1.@.    VSUBEQ.F32 s2,s2,s0
        0x08006f96:    d003        ..      BEQ      0x8006fa0 ; atan2Rad + 228
        0x08006f98:    2a04        .*      CMP      r2,#4
        0x08006f9a:    bf08        ..      IT       EQ
        0x08006f9c:    eeb11a41    ..A.    VNEGEQ.F32 s2,s2
        0x08006fa0:    ed9f0a0a    ....    VLDR     s0,[pc,#40] ; [0x8006fcc] = 0x40c90fdb
        0x08006fa4:    ee210a00    !...    VMUL.F32 s0,s2,s0
        0x08006fa8:    4770        pG      BX       lr
        0x08006faa:    eef50ac0    ....    VCMPE.F32 s1,#0.0
        0x08006fae:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x08006fb2:    bf34        4.      ITE      CC
        0x08006fb4:    2202        ."      MOVCC    r2,#2
        0x08006fb6:    2201        ."      MOVCS    r2,#1
        0x08006fb8:    e799        ..      B        0x8006eee ; atan2Rad + 50
    $d
        0x08006fba:    0000        ..      DCW    0
        0x08006fbc:    00000000    ....    DCD    0
        0x08006fc0:    3b810204    ...;    DCD    998310404
        0x08006fc4:    437e0000    ..~C    DCD    1132331008
        0x08006fc8:    08008a1c    ....    DCD    134253084
        0x08006fcc:    40c90fdb    ...@    DCD    1086918619
    $t
    i.main
    main
        0x08006fd0:    b09c        ..      SUB      sp,sp,#0x70
        0x08006fd2:    f7fafbcd    ....    BL       HAL_Init ; 0x8001770
        0x08006fd6:    f7fef8ab    ....    BL       SystemClock_Config ; 0x8005130
        0x08006fda:    4dfe        .M      LDR      r5,[pc,#1016] ; [0x80073d4] = 0x40021000
        0x08006fdc:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08006fde:    f0400004    @...    ORR      r0,r0,#4
        0x08006fe2:    64a8        .d      STR      r0,[r5,#0x48]
        0x08006fe4:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08006fe6:    f0000004    ....    AND      r0,r0,#4
        0x08006fea:    9000        ..      STR      r0,[sp,#0]
        0x08006fec:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08006fee:    f0400001    @...    ORR      r0,r0,#1
        0x08006ff2:    64a8        .d      STR      r0,[r5,#0x48]
        0x08006ff4:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08006ff6:    f0000001    ....    AND      r0,r0,#1
        0x08006ffa:    9000        ..      STR      r0,[sp,#0]
        0x08006ffc:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08006ffe:    f0400002    @...    ORR      r0,r0,#2
        0x08007002:    64a8        .d      STR      r0,[r5,#0x48]
        0x08007004:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08007006:    4ef4        .N      LDR      r6,[pc,#976] ; [0x80073d8] = 0xe000ed0c
        0x08007008:    f0000002    ....    AND      r0,r0,#2
        0x0800700c:    9000        ..      STR      r0,[sp,#0]
        0x0800700e:    6830        0h      LDR      r0,[r6,#0]
        0x08007010:    f3c02002    ...     UBFX     r0,r0,#8,#3
        0x08007014:    1d01        ..      ADDS     r1,r0,#4
        0x08007016:    2907        .)      CMP      r1,#7
        0x08007018:    bf34        4.      ITE      CC
        0x0800701a:    2000        .       MOVCC    r0,#0
        0x0800701c:    1ec0        ..      SUBCS    r0,r0,#3
        0x0800701e:    2701        .'      MOVS     r7,#1
        0x08007020:    2400        .$      MOVS     r4,#0
        0x08007022:    49ee        .I      LDR      r1,[pc,#952] ; [0x80073dc] = 0xe000e00b
        0x08007024:    fa04f000    ....    LSL      r0,r4,r0
        0x08007028:    0100        ..      LSLS     r0,r0,#4
        0x0800702a:    f8810400    ....    STRB     r0,[r1,#0x400]
        0x0800702e:    f04f2ae0    O..*    MOV      r10,#0xe000e000
        0x08007032:    02f8        ..      LSLS     r0,r7,#11
        0x08007034:    f8ca0100    ....    STR      r0,[r10,#0x100]
        0x08007038:    6830        0h      LDR      r0,[r6,#0]
        0x0800703a:    f3c02002    ...     UBFX     r0,r0,#8,#3
        0x0800703e:    1d01        ..      ADDS     r1,r0,#4
        0x08007040:    2907        .)      CMP      r1,#7
        0x08007042:    bf34        4.      ITE      CC
        0x08007044:    2000        .       MOVCC    r0,#0
        0x08007046:    1ec0        ..      SUBCS    r0,r0,#3
        0x08007048:    fa04f000    ....    LSL      r0,r4,r0
        0x0800704c:    49e4        .I      LDR      r1,[pc,#912] ; [0x80073e0] = 0xe000e00c
        0x0800704e:    0100        ..      LSLS     r0,r0,#4
        0x08007050:    f8810400    ....    STRB     r0,[r1,#0x400]
        0x08007054:    f44f5080    O..P    MOV      r0,#0x1000
        0x08007058:    f8ca0100    ....    STR      r0,[r10,#0x100]
        0x0800705c:    6830        0h      LDR      r0,[r6,#0]
        0x0800705e:    f3c02002    ...     UBFX     r0,r0,#8,#3
        0x08007062:    1d01        ..      ADDS     r1,r0,#4
        0x08007064:    2907        .)      CMP      r1,#7
        0x08007066:    bf34        4.      ITE      CC
        0x08007068:    2000        .       MOVCC    r0,#0
        0x0800706a:    1ec0        ..      SUBCS    r0,r0,#3
        0x0800706c:    fa04f000    ....    LSL      r0,r4,r0
        0x08007070:    49dc        .I      LDR      r1,[pc,#880] ; [0x80073e4] = 0xe000e038
        0x08007072:    0100        ..      LSLS     r0,r0,#4
        0x08007074:    f8810400    ....    STRB     r0,[r1,#0x400]
        0x08007078:    49db        .I      LDR      r1,[pc,#876] ; [0x80073e8] = 0xe000e004
        0x0800707a:    f04f7080    O..p    MOV      r0,#0x1000000
        0x0800707e:    f04f0804    O...    MOV      r8,#4
        0x08007082:    f8c10100    ....    STR      r0,[r1,#0x100]
        0x08007086:    6830        0h      LDR      r0,[r6,#0]
        0x08007088:    f3c02002    ...     UBFX     r0,r0,#8,#3
        0x0800708c:    1d02        ..      ADDS     r2,r0,#4
        0x0800708e:    2a07        .*      CMP      r2,#7
        0x08007090:    bf34        4.      ITE      CC
        0x08007092:    2000        .       MOVCC    r0,#0
        0x08007094:    1ec0        ..      SUBCS    r0,r0,#3
        0x08007096:    fa04f000    ....    LSL      r0,r4,r0
        0x0800709a:    4ad4        .J      LDR      r2,[pc,#848] ; [0x80073ec] = 0xe000e039
        0x0800709c:    0100        ..      LSLS     r0,r0,#4
        0x0800709e:    f8820400    ....    STRB     r0,[r2,#0x400]
        0x080070a2:    f04f7000    O..p    MOV      r0,#0x2000000
        0x080070a6:    f8c10100    ....    STR      r0,[r1,#0x100]
        0x080070aa:    9407        ..      STR      r4,[sp,#0x1c]
        0x080070ac:    9408        ..      STR      r4,[sp,#0x20]
        0x080070ae:    9406        ..      STR      r4,[sp,#0x18]
        0x080070b0:    9402        ..      STR      r4,[sp,#8]
        0x080070b2:    9403        ..      STR      r4,[sp,#0xc]
        0x080070b4:    9404        ..      STR      r4,[sp,#0x10]
        0x080070b6:    9405        ..      STR      r4,[sp,#0x14]
        0x080070b8:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x080070ba:    49c6        .I      LDR      r1,[pc,#792] ; [0x80073d4] = 0x40021000
        0x080070bc:    f0400004    @...    ORR      r0,r0,#4
        0x080070c0:    64c8        .d      STR      r0,[r1,#0x4c]
        0x080070c2:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070c4:    f0000004    ....    AND      r0,r0,#4
        0x080070c8:    9009        ..      STR      r0,[sp,#0x24]
        0x080070ca:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070cc:    f0400020    @. .    ORR      r0,r0,#0x20
        0x080070d0:    64c8        .d      STR      r0,[r1,#0x4c]
        0x080070d2:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070d4:    f0000020    .. .    AND      r0,r0,#0x20
        0x080070d8:    9009        ..      STR      r0,[sp,#0x24]
        0x080070da:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070dc:    f0400001    @...    ORR      r0,r0,#1
        0x080070e0:    64c8        .d      STR      r0,[r1,#0x4c]
