ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080070e2:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070e4:    f0000001    ....    AND      r0,r0,#1
        0x080070e8:    9009        ..      STR      r0,[sp,#0x24]
        0x080070ea:    4608        .F      MOV      r0,r1
        0x080070ec:    6cc0        .l      LDR      r0,[r0,#0x4c]
        0x080070ee:    f0400002    @...    ORR      r0,r0,#2
        0x080070f2:    64c8        .d      STR      r0,[r1,#0x4c]
        0x080070f4:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070f6:    f0000002    ....    AND      r0,r0,#2
        0x080070fa:    9009        ..      STR      r0,[sp,#0x24]
        0x080070fc:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x080070fe:    f0400008    @...    ORR      r0,r0,#8
        0x08007102:    64c8        .d      STR      r0,[r1,#0x4c]
        0x08007104:    6cc8        .l      LDR      r0,[r1,#0x4c]
        0x08007106:    f8df92e8    ....    LDR      r9,[pc,#744] ; [0x80073f0] = 0x48000800
        0x0800710a:    f0000008    ....    AND      r0,r0,#8
        0x0800710e:    9009        ..      STR      r0,[sp,#0x24]
        0x08007110:    f44f5000    O..P    MOV      r0,#0x2000
        0x08007114:    f8c90028    ..(.    STR      r0,[r9,#0x28]
        0x08007118:    f8c97028    ..(p    STR      r7,[r9,#0x28]
        0x0800711c:    e9cd0700    ....    STRD     r0,r7,[sp,#0]
        0x08007120:    4669        iF      MOV      r1,sp
        0x08007122:    4648        HF      MOV      r0,r9
        0x08007124:    f7fbfe8a    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007128:    9700        ..      STR      r7,[sp,#0]
        0x0800712a:    e9cd7401    ...t    STRD     r7,r4,[sp,#4]
        0x0800712e:    9403        ..      STR      r4,[sp,#0xc]
        0x08007130:    4669        iF      MOV      r1,sp
        0x08007132:    4648        HF      MOV      r0,r9
        0x08007134:    9404        ..      STR      r4,[sp,#0x10]
        0x08007136:    f7fbfe81    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x0800713a:    2040        @       MOVS     r0,#0x40
        0x0800713c:    e9cd0400    ....    STRD     r0,r4,[sp,#0]
        0x08007140:    4669        iF      MOV      r1,sp
        0x08007142:    48ac        .H      LDR      r0,[pc,#688] ; [0x80073f4] = 0x48000400
        0x08007144:    9404        ..      STR      r4,[sp,#0x10]
        0x08007146:    f7fbfe79    ..y.    BL       LL_GPIO_Init ; 0x8002e3c
        0x0800714a:    48ab        .H      LDR      r0,[pc,#684] ; [0x80073f8] = 0x40010000
        0x0800714c:    2103        .!      MOVS     r1,#3
        0x0800714e:    6882        .h      LDR      r2,[r0,#8]
        0x08007150:    f44f6370    O.pc    MOV      r3,#0xf00
        0x08007154:    fa93f3a3    ....    RBIT     r3,r3
        0x08007158:    fab3f383    ....    CLZ      r3,r3
        0x0800715c:    f003031f    ....    AND      r3,r3,#0x1f
        0x08007160:    f4226270    ".pb    BIC      r2,r2,#0xf00
        0x08007164:    4099        .@      LSLS     r1,r1,r3
        0x08007166:    4311        .C      ORRS     r1,r1,r2
        0x08007168:    6081        .`      STR      r1,[r0,#8]
        0x0800716a:    f88d7020    .. p    STRB     r7,[sp,#0x20]
        0x0800716e:    f88d4021    ..!@    STRB     r4,[sp,#0x21]
        0x08007172:    f8cd8018    ....    STR      r8,[sp,#0x18]
        0x08007176:    f88d7022    .."p    STRB     r7,[sp,#0x22]
        0x0800717a:    a806        ..      ADD      r0,sp,#0x18
        0x0800717c:    f7fbfd84    ....    BL       LL_EXTI_Init ; 0x8002c88
        0x08007180:    499e        .I      LDR      r1,[pc,#632] ; [0x80073fc] = 0x48000c00
        0x08007182:    2202        ."      MOVS     r2,#2
        0x08007184:    68cb        .h      LDR      r3,[r1,#0xc]
        0x08007186:    fa98f0a8    ....    RBIT     r0,r8
        0x0800718a:    fab0f080    ....    CLZ      r0,r0
        0x0800718e:    ea4f0c40    O.@.    LSL      r12,r0,#1
        0x08007192:    f04f0903    O...    MOV      r9,#3
        0x08007196:    fa09fc0c    ....    LSL      r12,r9,r12
        0x0800719a:    ea23030c    #...    BIC      r3,r3,r12
        0x0800719e:    fa98fca8    ....    RBIT     r12,r8
        0x080071a2:    fabcfc8c    ....    CLZ      r12,r12
        0x080071a6:    ea4f0c4c    O.L.    LSL      r12,r12,#1
        0x080071aa:    fa02f00c    ....    LSL      r0,r2,r12
        0x080071ae:    4318        .C      ORRS     r0,r0,r3
        0x080071b0:    60c8        .`      STR      r0,[r1,#0xc]
        0x080071b2:    6808        .h      LDR      r0,[r1,#0]
        0x080071b4:    fa98f2a8    ....    RBIT     r2,r8
        0x080071b8:    fab2f282    ....    CLZ      r2,r2
        0x080071bc:    0052        R.      LSLS     r2,r2,#1
        0x080071be:    fa09f202    ....    LSL      r2,r9,r2
        0x080071c2:    4390        .C      BICS     r0,r0,r2
        0x080071c4:    fa98f2a8    ....    RBIT     r2,r8
        0x080071c8:    fab2f282    ....    CLZ      r2,r2
        0x080071cc:    0052        R.      LSLS     r2,r2,#1
        0x080071ce:    fa04f202    ....    LSL      r2,r4,r2
        0x080071d2:    4310        .C      ORRS     r0,r0,r2
        0x080071d4:    6008        .`      STR      r0,[r1,#0]
        0x080071d6:    4880        .H      LDR      r0,[pc,#512] ; [0x80073d8] = 0xe000ed0c
        0x080071d8:    6800        .h      LDR      r0,[r0,#0]
        0x080071da:    f3c02002    ...     UBFX     r0,r0,#8,#3
        0x080071de:    f1c00107    ....    RSB      r1,r0,#7
        0x080071e2:    2904        .)      CMP      r1,#4
        0x080071e4:    bf88        ..      IT       HI
        0x080071e6:    2104        .!      MOVHI    r1,#4
        0x080071e8:    1d02        ..      ADDS     r2,r0,#4
        0x080071ea:    2a07        .*      CMP      r2,#7
        0x080071ec:    bf34        4.      ITE      CC
        0x080071ee:    2000        .       MOVCC    r0,#0
        0x080071f0:    1ec0        ..      SUBCS    r0,r0,#3
        0x080071f2:    fa07f101    ....    LSL      r1,r7,r1
        0x080071f6:    1e49        I.      SUBS     r1,r1,#1
        0x080071f8:    f0010104    ....    AND      r1,r1,#4
        0x080071fc:    fa01f000    ....    LSL      r0,r1,r0
        0x08007200:    497f        .I      LDR      r1,[pc,#508] ; [0x8007400] = 0xe000e008
        0x08007202:    0100        ..      LSLS     r0,r0,#4
        0x08007204:    f8810400    ....    STRB     r0,[r1,#0x400]
        0x08007208:    2008        .       MOVS     r0,#8
        0x0800720a:    f04f21e0    O..!    MOV      r1,#0xe000e000
        0x0800720e:    0146        F.      LSLS     r6,r0,#5
        0x08007210:    f8c16100    ...a    STR      r6,[r1,#0x100]
        0x08007214:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007216:    940c        ..      STR      r4,[sp,#0x30]
        0x08007218:    940d        ..      STR      r4,[sp,#0x34]
        0x0800721a:    940a        ..      STR      r4,[sp,#0x28]
        0x0800721c:    940e        ..      STR      r4,[sp,#0x38]
        0x0800721e:    9406        ..      STR      r4,[sp,#0x18]
        0x08007220:    9407        ..      STR      r4,[sp,#0x1c]
        0x08007222:    9408        ..      STR      r4,[sp,#0x20]
        0x08007224:    6ce9        .l      LDR      r1,[r5,#0x4c]
        0x08007226:    4a6b        kJ      LDR      r2,[pc,#428] ; [0x80073d4] = 0x40021000
        0x08007228:    f0410101    A...    ORR      r1,r1,#1
        0x0800722c:    64d1        .d      STR      r1,[r2,#0x4c]
        0x0800722e:    6cd1        .l      LDR      r1,[r2,#0x4c]
        0x08007230:    f0010101    ....    AND      r1,r1,#1
        0x08007234:    9100        ..      STR      r1,[sp,#0]
        0x08007236:    6cd1        .l      LDR      r1,[r2,#0x4c]
        0x08007238:    f0410102    A...    ORR      r1,r1,#2
        0x0800723c:    64d1        .d      STR      r1,[r2,#0x4c]
        0x0800723e:    6cd1        .l      LDR      r1,[r2,#0x4c]
        0x08007240:    9009        ..      STR      r0,[sp,#0x24]
        0x08007242:    f0010102    ....    AND      r1,r1,#2
        0x08007246:    9100        ..      STR      r1,[sp,#0]
        0x08007248:    f04f0a02    O...    MOV      r10,#2
        0x0800724c:    e9cd7a04    ...z    STRD     r7,r10,[sp,#0x10]
        0x08007250:    a904        ..      ADD      r1,sp,#0x10
        0x08007252:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08007256:    f7fbfdf1    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x0800725a:    e9cda904    ....    STRD     r10,r9,[sp,#0x10]
        0x0800725e:    a904        ..      ADD      r1,sp,#0x10
        0x08007260:    4864        dH      LDR      r0,[pc,#400] ; [0x80073f4] = 0x48000400
        0x08007262:    9408        ..      STR      r4,[sp,#0x20]
        0x08007264:    f7fbfdea    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007268:    2050        P       MOVS     r0,#0x50
        0x0800726a:    e9cd600a    ...`    STRD     r6,r0,[sp,#0x28]
        0x0800726e:    f44f20e0    O..     MOV      r0,#0x70000
        0x08007272:    e9cd040c    ....    STRD     r0,r4,[sp,#0x30]
        0x08007276:    a90a        ..      ADD      r1,sp,#0x28
        0x08007278:    4862        bH      LDR      r0,[pc,#392] ; [0x8007404] = 0x40010200
        0x0800727a:    940e        ..      STR      r4,[sp,#0x38]
        0x0800727c:    f7fbfc78    ..x.    BL       LL_COMP_Init ; 0x8002b70
        0x08007280:    4861        aH      LDR      r0,[pc,#388] ; [0x8007408] = 0x20000004
        0x08007282:    4e62        bN      LDR      r6,[pc,#392] ; [0x800740c] = 0x1e8480
        0x08007284:    6800        .h      LDR      r0,[r0,#0]
        0x08007286:    fbb0f1f6    ....    UDIV     r1,r0,r6
        0x0800728a:    20c8        .       MOVS     r0,#0xc8
        0x0800728c:    4348        HC      MULS     r0,r1,r0
        0x0800728e:    9002        ..      STR      r0,[sp,#8]
        0x08007290:    9001        ..      STR      r0,[sp,#4]
        0x08007292:    d019        ..      BEQ      0x80072c8 ; main + 760
        0x08007294:    f1b04f00    ...O    CMP      r0,#0x80000000
        0x08007298:    f0818141    ..A.    BCS.W    0x800851e ; main + 5454
        0x0800729c:    2800        .(      CMP      r0,#0
        0x0800729e:    bfd8        ..      IT       LE
        0x080072a0:    2000        .       MOVLE    r0,#0
        0x080072a2:    dd05        ..      BLE      0x80072b0 ; main + 736
        0x080072a4:    f0100001    ....    ANDS     r0,r0,#1
        0x080072a8:    d002        ..      BEQ      0x80072b0 ; main + 736
        0x080072aa:    9902        ..      LDR      r1,[sp,#8]
        0x080072ac:    1e49        I.      SUBS     r1,r1,#1
        0x080072ae:    9102        ..      STR      r1,[sp,#8]
        0x080072b0:    9901        ..      LDR      r1,[sp,#4]
        0x080072b2:    1c40        @.      ADDS     r0,r0,#1
        0x080072b4:    1c49        I.      ADDS     r1,r1,#1
        0x080072b6:    4288        .B      CMP      r0,r1
        0x080072b8:    da06        ..      BGE      0x80072c8 ; main + 760
        0x080072ba:    9a02        ..      LDR      r2,[sp,#8]
        0x080072bc:    1c80        ..      ADDS     r0,r0,#2
        0x080072be:    1e52        R.      SUBS     r2,r2,#1
        0x080072c0:    1e52        R.      SUBS     r2,r2,#1
        0x080072c2:    9202        ..      STR      r2,[sp,#8]
        0x080072c4:    4288        .B      CMP      r0,r1
        0x080072c6:    dbf8        ..      BLT      0x80072ba ; main + 746
        0x080072c8:    f8dfa144    ..D.    LDR      r10,[pc,#324] ; [0x8007410] = 0x40010404
        0x080072cc:    f8da0000    ....    LDR      r0,[r10,#0]
        0x080072d0:    f4201000     ...    BIC      r0,r0,#0x200000
        0x080072d4:    f8ca0000    ....    STR      r0,[r10,#0]
        0x080072d8:    f1aa0b04    ....    SUB      r11,r10,#4
        0x080072dc:    f8db0000    ....    LDR      r0,[r11,#0]
        0x080072e0:    f4201000     ...    BIC      r0,r0,#0x200000
        0x080072e4:    f8cb0000    ....    STR      r0,[r11,#0]
        0x080072e8:    940b        ..      STR      r4,[sp,#0x2c]
        0x080072ea:    940c        ..      STR      r4,[sp,#0x30]
        0x080072ec:    940d        ..      STR      r4,[sp,#0x34]
        0x080072ee:    940e        ..      STR      r4,[sp,#0x38]
        0x080072f0:    940a        ..      STR      r4,[sp,#0x28]
        0x080072f2:    9406        ..      STR      r4,[sp,#0x18]
        0x080072f4:    9407        ..      STR      r4,[sp,#0x1c]
        0x080072f6:    9408        ..      STR      r4,[sp,#0x20]
        0x080072f8:    9409        ..      STR      r4,[sp,#0x24]
        0x080072fa:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x080072fc:    f0400001    @...    ORR      r0,r0,#1
        0x08007300:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007302:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007304:    a904        ..      ADD      r1,sp,#0x10
        0x08007306:    f0000001    ....    AND      r0,r0,#1
        0x0800730a:    9000        ..      STR      r0,[sp,#0]
        0x0800730c:    2080        .       MOVS     r0,#0x80
        0x0800730e:    e9cd0904    ....    STRD     r0,r9,[sp,#0x10]
        0x08007312:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08007316:    f7fbfd91    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x0800731a:    2040        @       MOVS     r0,#0x40
        0x0800731c:    e9cd400a    ...@    STRD     r4,r0,[sp,#0x28]
        0x08007320:    f44f20e0    O..     MOV      r0,#0x70000
        0x08007324:    e9cd040c    ....    STRD     r0,r4,[sp,#0x30]
        0x08007328:    a90a        ..      ADD      r1,sp,#0x28
        0x0800732a:    483a        :H      LDR      r0,[pc,#232] ; [0x8007414] = 0x40010204
        0x0800732c:    940e        ..      STR      r4,[sp,#0x38]
        0x0800732e:    f7fbfc1f    ....    BL       LL_COMP_Init ; 0x8002b70
        0x08007332:    4835        5H      LDR      r0,[pc,#212] ; [0x8007408] = 0x20000004
        0x08007334:    6801        .h      LDR      r1,[r0,#0]
        0x08007336:    4835        5H      LDR      r0,[pc,#212] ; [0x800740c] = 0x1e8480
        0x08007338:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x0800733c:    21c8        .!      MOVS     r1,#0xc8
        0x0800733e:    4348        HC      MULS     r0,r1,r0
        0x08007340:    9002        ..      STR      r0,[sp,#8]
        0x08007342:    9001        ..      STR      r0,[sp,#4]
        0x08007344:    d019        ..      BEQ      0x800737a ; main + 938
        0x08007346:    f1b04f00    ...O    CMP      r0,#0x80000000
        0x0800734a:    f08180ee    ....    BCS.W    0x800852a ; main + 5466
        0x0800734e:    2800        .(      CMP      r0,#0
        0x08007350:    bfd8        ..      IT       LE
        0x08007352:    2000        .       MOVLE    r0,#0
        0x08007354:    dd05        ..      BLE      0x8007362 ; main + 914
        0x08007356:    f0100001    ....    ANDS     r0,r0,#1
        0x0800735a:    d002        ..      BEQ      0x8007362 ; main + 914
        0x0800735c:    9902        ..      LDR      r1,[sp,#8]
        0x0800735e:    1e49        I.      SUBS     r1,r1,#1
        0x08007360:    9102        ..      STR      r1,[sp,#8]
        0x08007362:    9901        ..      LDR      r1,[sp,#4]
        0x08007364:    1c40        @.      ADDS     r0,r0,#1
        0x08007366:    1c49        I.      ADDS     r1,r1,#1
        0x08007368:    4288        .B      CMP      r0,r1
        0x0800736a:    da06        ..      BGE      0x800737a ; main + 938
        0x0800736c:    9a02        ..      LDR      r2,[sp,#8]
        0x0800736e:    1c80        ..      ADDS     r0,r0,#2
        0x08007370:    1e52        R.      SUBS     r2,r2,#1
        0x08007372:    1e52        R.      SUBS     r2,r2,#1
        0x08007374:    9202        ..      STR      r2,[sp,#8]
        0x08007376:    4288        .B      CMP      r0,r1
        0x08007378:    dbf8        ..      BLT      0x800736c ; main + 924
        0x0800737a:    f8da0000    ....    LDR      r0,[r10,#0]
        0x0800737e:    4924        $I      LDR      r1,[pc,#144] ; [0x8007410] = 0x40010404
        0x08007380:    f4200080     ...    BIC      r0,r0,#0x400000
        0x08007384:    6008        .`      STR      r0,[r1,#0]
        0x08007386:    f8db0000    ....    LDR      r0,[r11,#0]
        0x0800738a:    f4200080     ...    BIC      r0,r0,#0x400000
        0x0800738e:    f8cb0000    ....    STR      r0,[r11,#0]
        0x08007392:    9401        ..      STR      r4,[sp,#4]
        0x08007394:    9402        ..      STR      r4,[sp,#8]
        0x08007396:    9403        ..      STR      r4,[sp,#0xc]
        0x08007398:    9405        ..      STR      r4,[sp,#0x14]
        0x0800739a:    9404        ..      STR      r4,[sp,#0x10]
        0x0800739c:    940a        ..      STR      r4,[sp,#0x28]
        0x0800739e:    940b        ..      STR      r4,[sp,#0x2c]
        0x080073a0:    940c        ..      STR      r4,[sp,#0x30]
        0x080073a2:    940d        ..      STR      r4,[sp,#0x34]
        0x080073a4:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x080073a6:    f0400004    @...    ORR      r0,r0,#4
        0x080073aa:    64e8        .d      STR      r0,[r5,#0x4c]
        0x080073ac:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x080073ae:    2602        .&      MOVS     r6,#2
        0x080073b0:    f0000004    ....    AND      r0,r0,#4
        0x080073b4:    e9cd6908    ...i    STRD     r6,r9,[sp,#0x20]
        0x080073b8:    9000        ..      STR      r0,[sp,#0]
        0x080073ba:    a908        ..      ADD      r1,sp,#0x20
        0x080073bc:    480c        .H      LDR      r0,[pc,#48] ; [0x80073f0] = 0x48000800
        0x080073be:    f7fbfd3d    ..=.    BL       LL_GPIO_Init ; 0x8002e3c
        0x080073c2:    01f0        ..      LSLS     r0,r6,#7
        0x080073c4:    9001        ..      STR      r0,[sp,#4]
        0x080073c6:    2040        @       MOVS     r0,#0x40
        0x080073c8:    9002        ..      STR      r0,[sp,#8]
        0x080073ca:    f44f20e0    O..     MOV      r0,#0x70000
        0x080073ce:    e9cd0403    ....    STRD     r0,r4,[sp,#0xc]
        0x080073d2:    e021        !.      B        0x8007418 ; main + 1096
    $d
        0x080073d4:    40021000    ...@    DCD    1073876992
        0x080073d8:    e000ed0c    ....    DCD    3758157068
        0x080073dc:    e000e00b    ....    DCD    3758153739
        0x080073e0:    e000e00c    ....    DCD    3758153740
        0x080073e4:    e000e038    8...    DCD    3758153784
        0x080073e8:    e000e004    ....    DCD    3758153732
        0x080073ec:    e000e039    9...    DCD    3758153785
        0x080073f0:    48000800    ...H    DCD    1207961600
        0x080073f4:    48000400    ...H    DCD    1207960576
        0x080073f8:    40010000    ...@    DCD    1073807360
        0x080073fc:    48000c00    ...H    DCD    1207962624
        0x08007400:    e000e008    ....    DCD    3758153736
        0x08007404:    40010200    ...@    DCD    1073807872
        0x08007408:    20000004    ...     DCD    536870916
        0x0800740c:    001e8480    ....    DCD    2000000
        0x08007410:    40010404    ...@    DCD    1073808388
        0x08007414:    40010204    ...@    DCD    1073807876
    $t
        0x08007418:    a901        ..      ADD      r1,sp,#4
        0x0800741a:    48fe        .H      LDR      r0,[pc,#1016] ; [0x8007814] = 0x40010208
        0x0800741c:    9405        ..      STR      r4,[sp,#0x14]
        0x0800741e:    f7fbfba7    ....    BL       LL_COMP_Init ; 0x8002b70
        0x08007422:    48fd        .H      LDR      r0,[pc,#1012] ; [0x8007818] = 0x20000004
        0x08007424:    6801        .h      LDR      r1,[r0,#0]
        0x08007426:    48fd        .H      LDR      r0,[pc,#1012] ; [0x800781c] = 0x1e8480
        0x08007428:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x0800742c:    21c8        .!      MOVS     r1,#0xc8
        0x0800742e:    4348        HC      MULS     r0,r1,r0
        0x08007430:    9007        ..      STR      r0,[sp,#0x1c]
        0x08007432:    9006        ..      STR      r0,[sp,#0x18]
        0x08007434:    d019        ..      BEQ      0x800746a ; main + 1178
        0x08007436:    f1b04f00    ...O    CMP      r0,#0x80000000
        0x0800743a:    f081807c    ..|.    BCS.W    0x8008536 ; main + 5478
        0x0800743e:    2800        .(      CMP      r0,#0
        0x08007440:    bfd8        ..      IT       LE
        0x08007442:    2000        .       MOVLE    r0,#0
        0x08007444:    dd05        ..      BLE      0x8007452 ; main + 1154
        0x08007446:    f0100001    ....    ANDS     r0,r0,#1
        0x0800744a:    d002        ..      BEQ      0x8007452 ; main + 1154
        0x0800744c:    9907        ..      LDR      r1,[sp,#0x1c]
        0x0800744e:    1e49        I.      SUBS     r1,r1,#1
        0x08007450:    9107        ..      STR      r1,[sp,#0x1c]
        0x08007452:    9906        ..      LDR      r1,[sp,#0x18]
        0x08007454:    1c40        @.      ADDS     r0,r0,#1
        0x08007456:    1c4a        J.      ADDS     r2,r1,#1
        0x08007458:    4290        .B      CMP      r0,r2
        0x0800745a:    da06        ..      BGE      0x800746a ; main + 1178
        0x0800745c:    9907        ..      LDR      r1,[sp,#0x1c]
        0x0800745e:    1c80        ..      ADDS     r0,r0,#2
        0x08007460:    1e49        I.      SUBS     r1,r1,#1
        0x08007462:    1e49        I.      SUBS     r1,r1,#1
        0x08007464:    9107        ..      STR      r1,[sp,#0x1c]
        0x08007466:    4290        .B      CMP      r0,r2
        0x08007468:    dbf8        ..      BLT      0x800745c ; main + 1164
        0x0800746a:    f8da0000    ....    LDR      r0,[r10,#0]
        0x0800746e:    f0205000     ..P    BIC      r0,r0,#0x20000000
        0x08007472:    f8ca0000    ....    STR      r0,[r10,#0]
        0x08007476:    f8db0000    ....    LDR      r0,[r11,#0]
        0x0800747a:    f0205000     ..P    BIC      r0,r0,#0x20000000
        0x0800747e:    f8cb0000    ....    STR      r0,[r11,#0]
        0x08007482:    9409        ..      STR      r4,[sp,#0x24]
        0x08007484:    940a        ..      STR      r4,[sp,#0x28]
        0x08007486:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007488:    940c        ..      STR      r4,[sp,#0x30]
        0x0800748a:    9408        ..      STR      r4,[sp,#0x20]
        0x0800748c:    9404        ..      STR      r4,[sp,#0x10]
        0x0800748e:    9405        ..      STR      r4,[sp,#0x14]
        0x08007490:    9406        ..      STR      r4,[sp,#0x18]
        0x08007492:    9407        ..      STR      r4,[sp,#0x1c]
        0x08007494:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007496:    f0400002    @...    ORR      r0,r0,#2
        0x0800749a:    64e8        .d      STR      r0,[r5,#0x4c]
        0x0800749c:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800749e:    e9cd7902    ...y    STRD     r7,r9,[sp,#8]
        0x080074a2:    f0000002    ....    AND      r0,r0,#2
        0x080074a6:    9000        ..      STR      r0,[sp,#0]
        0x080074a8:    a902        ..      ADD      r1,sp,#8
        0x080074aa:    48dd        .H      LDR      r0,[pc,#884] ; [0x8007820] = 0x48000400
        0x080074ac:    f7fbfcc6    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x080074b0:    2040        @       MOVS     r0,#0x40
        0x080074b2:    e9cd4008    ...@    STRD     r4,r0,[sp,#0x20]
        0x080074b6:    f44f20e0    O..     MOV      r0,#0x70000
        0x080074ba:    e9cd040a    ....    STRD     r0,r4,[sp,#0x28]
        0x080074be:    a908        ..      ADD      r1,sp,#0x20
        0x080074c0:    48d8        .H      LDR      r0,[pc,#864] ; [0x8007824] = 0x4001020c
        0x080074c2:    940c        ..      STR      r4,[sp,#0x30]
