ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080074c4:    f7fbfb54    ..T.    BL       LL_COMP_Init ; 0x8002b70
        0x080074c8:    48d3        .H      LDR      r0,[pc,#844] ; [0x8007818] = 0x20000004
        0x080074ca:    6801        .h      LDR      r1,[r0,#0]
        0x080074cc:    48d3        .H      LDR      r0,[pc,#844] ; [0x800781c] = 0x1e8480
        0x080074ce:    fbb1f1f0    ....    UDIV     r1,r1,r0
        0x080074d2:    20c8        .       MOVS     r0,#0xc8
        0x080074d4:    4348        HC      MULS     r0,r1,r0
        0x080074d6:    900d        ..      STR      r0,[sp,#0x34]
        0x080074d8:    9001        ..      STR      r0,[sp,#4]
        0x080074da:    d019        ..      BEQ      0x8007510 ; main + 1344
        0x080074dc:    f1b04f00    ...O    CMP      r0,#0x80000000
        0x080074e0:    f081802f    ../.    BCS.W    0x8008542 ; main + 5490
        0x080074e4:    2800        .(      CMP      r0,#0
        0x080074e6:    bfd8        ..      IT       LE
        0x080074e8:    2000        .       MOVLE    r0,#0
        0x080074ea:    dd05        ..      BLE      0x80074f8 ; main + 1320
        0x080074ec:    f0100001    ....    ANDS     r0,r0,#1
        0x080074f0:    d002        ..      BEQ      0x80074f8 ; main + 1320
        0x080074f2:    990d        ..      LDR      r1,[sp,#0x34]
        0x080074f4:    1e49        I.      SUBS     r1,r1,#1
        0x080074f6:    910d        ..      STR      r1,[sp,#0x34]
        0x080074f8:    9901        ..      LDR      r1,[sp,#4]
        0x080074fa:    1c40        @.      ADDS     r0,r0,#1
        0x080074fc:    1c49        I.      ADDS     r1,r1,#1
        0x080074fe:    4288        .B      CMP      r0,r1
        0x08007500:    da06        ..      BGE      0x8007510 ; main + 1344
        0x08007502:    9a0d        ..      LDR      r2,[sp,#0x34]
        0x08007504:    1c80        ..      ADDS     r0,r0,#2
        0x08007506:    1e52        R.      SUBS     r2,r2,#1
        0x08007508:    1e52        R.      SUBS     r2,r2,#1
        0x0800750a:    920d        ..      STR      r2,[sp,#0x34]
        0x0800750c:    4288        .B      CMP      r0,r1
        0x0800750e:    dbf8        ..      BLT      0x8007502 ; main + 1330
        0x08007510:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08007514:    49c4        .I      LDR      r1,[pc,#784] ; [0x8007828] = 0x40010404
        0x08007516:    f0204080     ..@    BIC      r0,r0,#0x40000000
        0x0800751a:    6008        .`      STR      r0,[r1,#0]
        0x0800751c:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08007520:    1f09        ..      SUBS     r1,r1,#4
        0x08007522:    f0204080     ..@    BIC      r0,r0,#0x40000000
        0x08007526:    6008        .`      STR      r0,[r1,#0]
        0x08007528:    9401        ..      STR      r4,[sp,#4]
        0x0800752a:    9400        ..      STR      r4,[sp,#0]
        0x0800752c:    9402        ..      STR      r4,[sp,#8]
        0x0800752e:    9403        ..      STR      r4,[sp,#0xc]
        0x08007530:    9406        ..      STR      r4,[sp,#0x18]
        0x08007532:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007534:    f4403080    @..0    ORR      r0,r0,#0x10000
        0x08007538:    64e8        .d      STR      r0,[r5,#0x4c]
        0x0800753a:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800753c:    f8df92f0    ....    LDR      r9,[pc,#752] ; [0x8007830] = 0x50000800
        0x08007540:    f4003080    ...0    AND      r0,r0,#0x10000
        0x08007544:    9007        ..      STR      r0,[sp,#0x1c]
        0x08007546:    f8dfa2e4    ....    LDR      r10,[pc,#740] ; [0x800782c] = 0x2110001
        0x0800754a:    f8d9003c    ..<.    LDR      r0,[r9,#0x3c]
        0x0800754e:    f4207000     ..p    BIC      r0,r0,#0x200
        0x08007552:    f8c9003c    ..<.    STR      r0,[r9,#0x3c]
        0x08007556:    466a        jF      MOV      r2,sp
        0x08007558:    4651        QF      MOV      r1,r10
        0x0800755a:    4648        HF      MOV      r0,r9
        0x0800755c:    e9cd6704    ...g    STRD     r6,r7,[sp,#0x10]
        0x08007560:    f7fbfb26    ..&.    BL       LL_DAC_Init ; 0x8002bb0
        0x08007564:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08007568:    f0200002     ...    BIC      r0,r0,#2
        0x0800756c:    f8c90000    ....    STR      r0,[r9,#0]
        0x08007570:    f8d9003c    ..<.    LDR      r0,[r9,#0x3c]
        0x08007574:    f4207080     ..p    BIC      r0,r0,#0x100
        0x08007578:    f8c9003c    ..<.    STR      r0,[r9,#0x3c]
        0x0800757c:    9401        ..      STR      r4,[sp,#4]
        0x0800757e:    9400        ..      STR      r4,[sp,#0]
        0x08007580:    9402        ..      STR      r4,[sp,#8]
        0x08007582:    9403        ..      STR      r4,[sp,#0xc]
        0x08007584:    9406        ..      STR      r4,[sp,#0x18]
        0x08007586:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007588:    f4402080    @..     ORR      r0,r0,#0x40000
        0x0800758c:    64e8        .d      STR      r0,[r5,#0x4c]
        0x0800758e:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007590:    f8df92a0    ....    LDR      r9,[pc,#672] ; [0x8007834] = 0x50001000
        0x08007594:    f4002080    ...     AND      r0,r0,#0x40000
        0x08007598:    9007        ..      STR      r0,[sp,#0x1c]
        0x0800759a:    f8d9003c    ..<.    LDR      r0,[r9,#0x3c]
        0x0800759e:    f4207000     ..p    BIC      r0,r0,#0x200
        0x080075a2:    f8c9003c    ..<.    STR      r0,[r9,#0x3c]
        0x080075a6:    466a        jF      MOV      r2,sp
        0x080075a8:    4651        QF      MOV      r1,r10
        0x080075aa:    4648        HF      MOV      r0,r9
        0x080075ac:    e9cd6704    ...g    STRD     r6,r7,[sp,#0x10]
        0x080075b0:    f7fbfafe    ....    BL       LL_DAC_Init ; 0x8002bb0
        0x080075b4:    f8d90000    ....    LDR      r0,[r9,#0]
        0x080075b8:    f0200002     ...    BIC      r0,r0,#2
        0x080075bc:    f8c90000    ....    STR      r0,[r9,#0]
        0x080075c0:    f8d9003c    ..<.    LDR      r0,[r9,#0x3c]
        0x080075c4:    f4207080     ..p    BIC      r0,r0,#0x100
        0x080075c8:    f8c9003c    ..<.    STR      r0,[r9,#0x3c]
        0x080075cc:    499a        .I      LDR      r1,[pc,#616] ; [0x8007838] = 0x354200f2
        0x080075ce:    f8d9003c    ..<.    LDR      r0,[r9,#0x3c]
        0x080075d2:    f0207000     ..p    BIC      r0,r0,#0x2000000
        0x080075d6:    f8c9003c    ..<.    STR      r0,[r9,#0x3c]
        0x080075da:    466a        jF      MOV      r2,sp
        0x080075dc:    4648        HF      MOV      r0,r9
        0x080075de:    f7fbfae7    ....    BL       LL_DAC_Init ; 0x8002bb0
        0x080075e2:    f8d90000    ....    LDR      r0,[r9,#0]
        0x080075e6:    f4203000     ..0    BIC      r0,r0,#0x20000
        0x080075ea:    f8c90000    ....    STR      r0,[r9,#0]
        0x080075ee:    f8d9003c    ..<.    LDR      r0,[r9,#0x3c]
        0x080075f2:    f0207080     ..p    BIC      r0,r0,#0x1000000
        0x080075f6:    f8c9003c    ..<.    STR      r0,[r9,#0x3c]
        0x080075fa:    f7fcfa4b    ..K.    BL       MX_ADC1_Init ; 0x8003a94
        0x080075fe:    9406        ..      STR      r4,[sp,#0x18]
        0x08007600:    9407        ..      STR      r4,[sp,#0x1c]
        0x08007602:    9408        ..      STR      r4,[sp,#0x20]
        0x08007604:    9400        ..      STR      r4,[sp,#0]
        0x08007606:    9401        ..      STR      r4,[sp,#4]
        0x08007608:    9402        ..      STR      r4,[sp,#8]
        0x0800760a:    9403        ..      STR      r4,[sp,#0xc]
        0x0800760c:    9404        ..      STR      r4,[sp,#0x10]
        0x0800760e:    9405        ..      STR      r4,[sp,#0x14]
        0x08007610:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007612:    940c        ..      STR      r4,[sp,#0x30]
        0x08007614:    940d        ..      STR      r4,[sp,#0x34]
        0x08007616:    940a        ..      STR      r4,[sp,#0x28]
        0x08007618:    9410        ..      STR      r4,[sp,#0x40]
        0x0800761a:    9411        ..      STR      r4,[sp,#0x44]
        0x0800761c:    9412        ..      STR      r4,[sp,#0x48]
        0x0800761e:    9413        ..      STR      r4,[sp,#0x4c]
        0x08007620:    f8d50088    ....    LDR      r0,[r5,#0x88]
        0x08007624:    f0205040     .@P    BIC      r0,r0,#0x30000000
        0x08007628:    f0405000    @..P    ORR      r0,r0,#0x20000000
        0x0800762c:    f8c50088    ....    STR      r0,[r5,#0x88]
        0x08007630:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007632:    f4405000    @..P    ORR      r0,r0,#0x2000
        0x08007636:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007638:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800763a:    f4005000    ...P    AND      r0,r0,#0x2000
        0x0800763e:    9009        ..      STR      r0,[sp,#0x24]
        0x08007640:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007642:    f0400004    @...    ORR      r0,r0,#4
        0x08007646:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007648:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800764a:    f0000004    ....    AND      r0,r0,#4
        0x0800764e:    9009        ..      STR      r0,[sp,#0x24]
        0x08007650:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007652:    f0400001    @...    ORR      r0,r0,#1
        0x08007656:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007658:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800765a:    a90e        ..      ADD      r1,sp,#0x38
        0x0800765c:    f0000001    ....    AND      r0,r0,#1
        0x08007660:    9009        ..      STR      r0,[sp,#0x24]
        0x08007662:    2008        .       MOVS     r0,#8
        0x08007664:    900e        ..      STR      r0,[sp,#0x38]
        0x08007666:    2003        .       MOVS     r0,#3
        0x08007668:    900f        ..      STR      r0,[sp,#0x3c]
        0x0800766a:    4874        tH      LDR      r0,[pc,#464] ; [0x800783c] = 0x48000800
        0x0800766c:    f7fbfbe6    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007670:    2003        .       MOVS     r0,#3
        0x08007672:    e9cd600e    ...`    STRD     r6,r0,[sp,#0x38]
        0x08007676:    a90e        ..      ADD      r1,sp,#0x38
        0x08007678:    9412        ..      STR      r4,[sp,#0x48]
        0x0800767a:    f04f4090    O..@    MOV      r0,#0x48000000
        0x0800767e:    f7fbfbdd    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007682:    f04f0980    O...    MOV      r9,#0x80
        0x08007686:    2003        .       MOVS     r0,#3
        0x08007688:    e9cd900e    ....    STRD     r9,r0,[sp,#0x38]
        0x0800768c:    a90e        ..      ADD      r1,sp,#0x38
        0x0800768e:    9412        ..      STR      r4,[sp,#0x48]
        0x08007690:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08007694:    f7fbfbd2    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007698:    4869        iH      LDR      r0,[pc,#420] ; [0x8007840] = 0xe000ed0c
        0x0800769a:    6800        .h      LDR      r0,[r0,#0]
        0x0800769c:    f3c02102    ...!    UBFX     r1,r0,#8,#3
        0x080076a0:    f1c10007    ....    RSB      r0,r1,#7
        0x080076a4:    2804        .(      CMP      r0,#4
        0x080076a6:    bf88        ..      IT       HI
        0x080076a8:    2004        .       MOVHI    r0,#4
        0x080076aa:    1d0a        ..      ADDS     r2,r1,#4
        0x080076ac:    2a07        .*      CMP      r2,#7
        0x080076ae:    bf34        4.      ITE      CC
        0x080076b0:    2200        ."      MOVCC    r2,#0
        0x080076b2:    1eca        ..      SUBCS    r2,r1,#3
        0x080076b4:    2101        .!      MOVS     r1,#1
        0x080076b6:    fa01f000    ....    LSL      r0,r1,r0
        0x080076ba:    1e40        @.      SUBS     r0,r0,#1
        0x080076bc:    f0000005    ....    AND      r0,r0,#5
        0x080076c0:    4960        `I      LDR      r1,[pc,#384] ; [0x8007844] = 0xe000e012
        0x080076c2:    4090        .@      LSLS     r0,r0,r2
        0x080076c4:    0100        ..      LSLS     r0,r0,#4
        0x080076c6:    f8810400    ....    STRB     r0,[r1,#0x400]
        0x080076ca:    f04f21e0    O..!    MOV      r1,#0xe000e000
        0x080076ce:    f44f2080    O..     MOV      r0,#0x40000
        0x080076d2:    f8c10100    ....    STR      r0,[r1,#0x100]
        0x080076d6:    f44f4a00    O..J    MOV      r10,#0x8000
        0x080076da:    e9cd4a06    ...J    STRD     r4,r10,[sp,#0x18]
        0x080076de:    4f5a        ZO      LDR      r7,[pc,#360] ; [0x8007848] = 0x50000100
        0x080076e0:    a906        ..      ADD      r1,sp,#0x18
        0x080076e2:    4638        8F      MOV      r0,r7
        0x080076e4:    9408        ..      STR      r4,[sp,#0x20]
        0x080076e6:    f7fbf9f4    ....    BL       LL_ADC_Init ; 0x8002ad2
        0x080076ea:    9401        ..      STR      r4,[sp,#4]
        0x080076ec:    9402        ..      STR      r4,[sp,#8]
        0x080076ee:    9403        ..      STR      r4,[sp,#0xc]
        0x080076f0:    9404        ..      STR      r4,[sp,#0x10]
        0x080076f2:    4669        iF      MOV      r1,sp
        0x080076f4:    4638        8F      MOV      r0,r7
        0x080076f6:    9405        ..      STR      r4,[sp,#0x14]
        0x080076f8:    f7fbfa04    ....    BL       LL_ADC_REG_Init ; 0x8002b04
        0x080076fc:    f8d700c0    ....    LDR      r0,[r7,#0xc0]
        0x08007700:    f36f000d    o...    BFC      r0,#0,#14
        0x08007704:    f8c700c0    ....    STR      r0,[r7,#0xc0]
        0x08007708:    6938        8i      LDR      r0,[r7,#0x10]
        0x0800770a:    f4203080     ..0    BIC      r0,r0,#0x10000
        0x0800770e:    6138        8a      STR      r0,[r7,#0x10]
        0x08007710:    6938        8i      LDR      r0,[r7,#0x10]
        0x08007712:    f0200003     ...    BIC      r0,r0,#3
        0x08007716:    f4206080     ..`    BIC      r0,r0,#0x400
        0x0800771a:    6138        8a      STR      r0,[r7,#0x10]
        0x0800771c:    f8cd9028    ..(.    STR      r9,[sp,#0x28]
        0x08007720:    e9cd640b    ...d    STRD     r6,r4,[sp,#0x2c]
        0x08007724:    a90a        ..      ADD      r1,sp,#0x28
        0x08007726:    4638        8F      MOV      r0,r7
        0x08007728:    940d        ..      STR      r4,[sp,#0x34]
        0x0800772a:    f7fbf9a9    ....    BL       LL_ADC_INJ_Init ; 0x8002a80
        0x0800772e:    68f8        .h      LDR      r0,[r7,#0xc]
        0x08007730:    f4201000     ...    BIC      r0,r0,#0x200000
        0x08007734:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x08007738:    f0404000    @..@    ORR      r0,r0,#0x80000000
        0x0800773c:    60f8        .`      STR      r0,[r7,#0xc]
        0x0800773e:    6cf8        .l      LDR      r0,[r7,#0x4c]
        0x08007740:    f42070c0     ..p    BIC      r0,r0,#0x180
        0x08007744:    f0400080    @...    ORR      r0,r0,#0x80
        0x08007748:    64f8        .d      STR      r0,[r7,#0x4c]
        0x0800774a:    68b8        .h      LDR      r0,[r7,#8]
        0x0800774c:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x08007750:    f0204020     . @    BIC      r0,r0,#0xa0000000
        0x08007754:    60b8        .`      STR      r0,[r7,#8]
        0x08007756:    68b8        .h      LDR      r0,[r7,#8]
        0x08007758:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x0800775c:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x08007760:    f0405080    @..P    ORR      r0,r0,#0x10000000
        0x08007764:    60b8        .`      STR      r0,[r7,#8]
        0x08007766:    482c        ,H      LDR      r0,[pc,#176] ; [0x8007818] = 0x20000004
        0x08007768:    4938        8I      LDR      r1,[pc,#224] ; [0x800784c] = 0x30d40
        0x0800776a:    6800        .h      LDR      r0,[r0,#0]
        0x0800776c:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08007770:    eb000080    ....    ADD      r0,r0,r0,LSL #2
        0x08007774:    4936        6I      LDR      r1,[pc,#216] ; [0x8007850] = 0xcccccccd
        0x08007776:    0080        ..      LSLS     r0,r0,#2
        0x08007778:    fba11000    ....    UMULL    r1,r0,r1,r0
        0x0800777c:    08c0        ..      LSRS     r0,r0,#3
        0x0800777e:    d003        ..      BEQ      0x8007788 ; main + 1976
        0x08007780:    f1b04f00    ...O    CMP      r0,#0x80000000
        0x08007784:    f08086e3    ....    BCS.W    0x800854e ; main + 5502
        0x08007788:    482f        /H      LDR      r0,[pc,#188] ; [0x8007848] = 0x50000100
        0x0800778a:    f8501f4c    P.L.    LDR      r1,[r0,#0x4c]!
        0x0800778e:    f4215178    !.xQ    BIC      r1,r1,#0x3e00
        0x08007792:    f4416100    A..a    ORR      r1,r1,#0x800
        0x08007796:    6001        .`      STR      r1,[r0,#0]
        0x08007798:    492e        .I      LDR      r1,[pc,#184] ; [0x8007854] = 0x50000114
        0x0800779a:    680a        .h      LDR      r2,[r1,#0]
        0x0800779c:    f42242e0    "..B    BIC      r2,r2,#0x7000
        0x080077a0:    600a        .`      STR      r2,[r1,#0]
        0x080077a2:    6e42        Bn      LDR      r2,[r0,#0x64]
        0x080077a4:    f0220210    "...    BIC      r2,r2,#0x10
        0x080077a8:    6642        Bf      STR      r2,[r0,#0x64]
        0x080077aa:    6802        .h      LDR      r2,[r0,#0]
        0x080077ac:    f4222278    ".x"    BIC      r2,r2,#0xf8000
        0x080077b0:    f4422290    B.."    ORR      r2,r2,#0x48000
        0x080077b4:    6002        .`      STR      r2,[r0,#0]
        0x080077b6:    680a        .h      LDR      r2,[r1,#0]
        0x080077b8:    f0225260    ".`R    BIC      r2,r2,#0x38000000
        0x080077bc:    600a        .`      STR      r2,[r1,#0]
        0x080077be:    6e42        Bn      LDR      r2,[r0,#0x64]
        0x080077c0:    f4227200    "..r    BIC      r2,r2,#0x200
        0x080077c4:    6642        Bf      STR      r2,[r0,#0x64]
        0x080077c6:    6802        .h      LDR      r2,[r0,#0]
        0x080077c8:    f0227278    ".xr    BIC      r2,r2,#0x3e00000
        0x080077cc:    f4420280    B...    ORR      r2,r2,#0x400000
        0x080077d0:    6002        .`      STR      r2,[r0,#0]
        0x080077d2:    680a        .h      LDR      r2,[r1,#0]
        0x080077d4:    f42272e0    "..r    BIC      r2,r2,#0x1c0
        0x080077d8:    600a        .`      STR      r2,[r1,#0]
        0x080077da:    6e41        An      LDR      r1,[r0,#0x64]
        0x080077dc:    f0210104    !...    BIC      r1,r1,#4
        0x080077e0:    6641        Af      STR      r1,[r0,#0x64]
        0x080077e2:    9400        ..      STR      r4,[sp,#0]
        0x080077e4:    481c        .H      LDR      r0,[pc,#112] ; [0x8007858] = 0x40021088
        0x080077e6:    9401        ..      STR      r4,[sp,#4]
        0x080077e8:    9405        ..      STR      r4,[sp,#0x14]
        0x080077ea:    9402        ..      STR      r4,[sp,#8]
        0x080077ec:    9403        ..      STR      r4,[sp,#0xc]
        0x080077ee:    9404        ..      STR      r4,[sp,#0x10]
        0x080077f0:    9406        ..      STR      r4,[sp,#0x18]
        0x080077f2:    940a        ..      STR      r4,[sp,#0x28]
        0x080077f4:    6800        .h      LDR      r0,[r0,#0]
        0x080077f6:    4918        .I      LDR      r1,[pc,#96] ; [0x8007858] = 0x40021088
        0x080077f8:    f4205040     .@P    BIC      r0,r0,#0x3000
        0x080077fc:    6008        .`      STR      r0,[r1,#0]
        0x080077fe:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007800:    f0400001    @...    ORR      r0,r0,#1
        0x08007804:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007806:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007808:    f0000001    ....    AND      r0,r0,#1
        0x0800780c:    9007        ..      STR      r0,[sp,#0x1c]
        0x0800780e:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007810:    e024        $.      B        0x800785c ; main + 2188
    $d
        0x08007812:    0000        ..      DCW    0
        0x08007814:    40010208    ...@    DCD    1073807880
        0x08007818:    20000004    ...     DCD    536870916
        0x0800781c:    001e8480    ....    DCD    2000000
        0x08007820:    48000400    ...H    DCD    1207960576
        0x08007824:    4001020c    ...@    DCD    1073807884
        0x08007828:    40010404    ...@    DCD    1073808388
        0x0800782c:    02110001    ....    DCD    34668545
        0x08007830:    50000800    ...P    DCD    1342179328
        0x08007834:    50001000    ...P    DCD    1342181376
        0x08007838:    354200f2    ..B5    DCD    893518066
        0x0800783c:    48000800    ...H    DCD    1207961600
        0x08007840:    e000ed0c    ....    DCD    3758157068
        0x08007844:    e000e012    ....    DCD    3758153746
        0x08007848:    50000100    ...P    DCD    1342177536
        0x0800784c:    00030d40    @...    DCD    200000
        0x08007850:    cccccccd    ....    DCD    3435973837
        0x08007854:    50000114    ...P    DCD    1342177556
        0x08007858:    40021088    ...@    DCD    1073877128
    $t
        0x0800785c:    f0400002    @...    ORR      r0,r0,#2
        0x08007860:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007862:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007864:    2701        .'      MOVS     r7,#1
        0x08007866:    f0000002    ....    AND      r0,r0,#2
        0x0800786a:    970b        ..      STR      r7,[sp,#0x2c]
        0x0800786c:    9609        ..      STR      r6,[sp,#0x24]
        0x0800786e:    e9cd0a07    ....    STRD     r0,r10,[sp,#0x1c]
        0x08007872:    e9cd780c    ...x    STRD     r7,r8,[sp,#0x30]
        0x08007876:    a908        ..      ADD      r1,sp,#0x20
        0x08007878:    f04f4090    O..@    MOV      r0,#0x48000000
        0x0800787c:    f7fbfade    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007880:    e9cd9608    ....    STRD     r9,r6,[sp,#0x20]
        0x08007884:    e9cd470a    ...G    STRD     r4,r7,[sp,#0x28]
        0x08007888:    e9cd780c    ...x    STRD     r7,r8,[sp,#0x30]
        0x0800788c:    a908        ..      ADD      r1,sp,#0x20
        0x0800788e:    48fc        .H      LDR      r0,[pc,#1008] ; [0x8007c80] = 0x48000400
        0x08007890:    f7fbfad4    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007894:    6da8        .m      LDR      r0,[r5,#0x58]
        0x08007896:    f4401000    @...    ORR      r0,r0,#0x200000
        0x0800789a:    65a8        .e      STR      r0,[r5,#0x58]
        0x0800789c:    6da8        .m      LDR      r0,[r5,#0x58]
        0x0800789e:    49fa        .I      LDR      r1,[pc,#1000] ; [0x8007c88] = 0x40020024
        0x080078a0:    f4001000    ....    AND      r0,r0,#0x200000
        0x080078a4:    9007        ..      STR      r0,[sp,#0x1c]
        0x080078a6:    48f7        .H      LDR      r0,[pc,#988] ; [0x8007c84] = 0x40020400
        0x080078a8:    f8d11800    ....    LDR      r1,[r1,#0x800]
        0x080078ac:    4af6        .J      LDR      r2,[pc,#984] ; [0x8007c88] = 0x40020024
        0x080078ae:    f02101ff    !...    BIC      r1,r1,#0xff
        0x080078b2:    f0410110    A...    ORR      r1,r1,#0x10
        0x080078b6:    f8c21800    ....    STR      r1,[r2,#0x800]
        0x080078ba:    49f4        .I      LDR      r1,[pc,#976] ; [0x8007c8c] = 0x80089d6
        0x080078bc:    784a        Jx      LDRB     r2,[r1,#1]
        0x080078be:    5882        .X      LDR      r2,[r0,r2]
        0x080078c0:    784b        Kx      LDRB     r3,[r1,#1]
        0x080078c2:    f0220210    "...    BIC      r2,r2,#0x10
        0x080078c6:    f4224280    "..B    BIC      r2,r2,#0x4000
