ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080078ca:    50c2        .P      STR      r2,[r0,r3]
        0x080078cc:    784a        Jx      LDRB     r2,[r1,#1]
        0x080078ce:    5882        .X      LDR      r2,[r0,r2]
        0x080078d0:    784b        Kx      LDRB     r3,[r1,#1]
        0x080078d2:    f4225240    ".@R    BIC      r2,r2,#0x3000
        0x080078d6:    50c2        .P      STR      r2,[r0,r3]
        0x080078d8:    784a        Jx      LDRB     r2,[r1,#1]
        0x080078da:    5882        .X      LDR      r2,[r0,r2]
        0x080078dc:    784b        Kx      LDRB     r3,[r1,#1]
        0x080078de:    f0420220    B. .    ORR      r2,r2,#0x20
        0x080078e2:    50c2        .P      STR      r2,[r0,r3]
        0x080078e4:    784a        Jx      LDRB     r2,[r1,#1]
        0x080078e6:    5882        .X      LDR      r2,[r0,r2]
        0x080078e8:    784b        Kx      LDRB     r3,[r1,#1]
        0x080078ea:    f0220240    ".@.    BIC      r2,r2,#0x40
        0x080078ee:    50c2        .P      STR      r2,[r0,r3]
        0x080078f0:    784a        Jx      LDRB     r2,[r1,#1]
        0x080078f2:    5882        .X      LDR      r2,[r0,r2]
        0x080078f4:    784b        Kx      LDRB     r3,[r1,#1]
        0x080078f6:    f0420280    B...    ORR      r2,r2,#0x80
        0x080078fa:    50c2        .P      STR      r2,[r0,r3]
        0x080078fc:    784a        Jx      LDRB     r2,[r1,#1]
        0x080078fe:    5882        .X      LDR      r2,[r0,r2]
        0x08007900:    784b        Kx      LDRB     r3,[r1,#1]
        0x08007902:    f4227240    ".@r    BIC      r2,r2,#0x300
        0x08007906:    50c2        .P      STR      r2,[r0,r3]
        0x08007908:    784a        Jx      LDRB     r2,[r1,#1]
        0x0800790a:    5882        .X      LDR      r2,[r0,r2]
        0x0800790c:    7849        Ix      LDRB     r1,[r1,#1]
        0x0800790e:    f4226240    ".@b    BIC      r2,r2,#0xc00
        0x08007912:    5042        BP      STR      r2,[r0,r1]
        0x08007914:    48de        .H      LDR      r0,[pc,#888] ; [0x8007c90] = 0x30a0a7fb
        0x08007916:    4fdf        .O      LDR      r7,[pc,#892] ; [0x8007c94] = 0x40005400
        0x08007918:    e9cd4000    ...@    STRD     r4,r0,[sp,#0]
        0x0800791c:    9402        ..      STR      r4,[sp,#8]
        0x0800791e:    9403        ..      STR      r4,[sp,#0xc]
        0x08007920:    9404        ..      STR      r4,[sp,#0x10]
        0x08007922:    9405        ..      STR      r4,[sp,#0x14]
        0x08007924:    4669        iF      MOV      r1,sp
        0x08007926:    4638        8F      MOV      r0,r7
        0x08007928:    9406        ..      STR      r4,[sp,#0x18]
        0x0800792a:    f7fbfb30    ..0.    BL       LL_I2C_Init ; 0x8002f8e
        0x0800792e:    6878        xh      LDR      r0,[r7,#4]
        0x08007930:    f0407000    @..p    ORR      r0,r0,#0x2000000
        0x08007934:    6078        x`      STR      r0,[r7,#4]
        0x08007936:    68f8        .h      LDR      r0,[r7,#0xc]
        0x08007938:    f36f004a    o.J.    BFC      r0,#1,#10
        0x0800793c:    60f8        .`      STR      r0,[r7,#0xc]
        0x0800793e:    68f8        .h      LDR      r0,[r7,#0xc]
        0x08007940:    f4204000     ..@    BIC      r0,r0,#0x8000
        0x08007944:    60f8        .`      STR      r0,[r7,#0xc]
        0x08007946:    6838        8h      LDR      r0,[r7,#0]
        0x08007948:    f4202000     ..     BIC      r0,r0,#0x80000
        0x0800794c:    6038        8`      STR      r0,[r7,#0]
        0x0800794e:    6838        8h      LDR      r0,[r7,#0]
        0x08007950:    f4203000     ..0    BIC      r0,r0,#0x20000
        0x08007954:    6038        8`      STR      r0,[r7,#0]
        0x08007956:    f7fcf9f5    ....    BL       MX_TIM1_Init ; 0x8003d44
        0x0800795a:    9403        ..      STR      r4,[sp,#0xc]
        0x0800795c:    9404        ..      STR      r4,[sp,#0x10]
        0x0800795e:    9405        ..      STR      r4,[sp,#0x14]
        0x08007960:    9408        ..      STR      r4,[sp,#0x20]
        0x08007962:    9409        ..      STR      r4,[sp,#0x24]
        0x08007964:    940a        ..      STR      r4,[sp,#0x28]
        0x08007966:    9402        ..      STR      r4,[sp,#8]
        0x08007968:    9406        ..      STR      r4,[sp,#0x18]
        0x0800796a:    940d        ..      STR      r4,[sp,#0x34]
        0x0800796c:    940e        ..      STR      r4,[sp,#0x38]
        0x0800796e:    940f        ..      STR      r4,[sp,#0x3c]
        0x08007970:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007972:    940c        ..      STR      r4,[sp,#0x30]
        0x08007974:    9412        ..      STR      r4,[sp,#0x48]
        0x08007976:    9413        ..      STR      r4,[sp,#0x4c]
        0x08007978:    9414        ..      STR      r4,[sp,#0x50]
        0x0800797a:    6e28        (n      LDR      r0,[r5,#0x60]
        0x0800797c:    f4405000    @..P    ORR      r0,r0,#0x2000
        0x08007980:    6628        (f      STR      r0,[r5,#0x60]
        0x08007982:    6e28        (n      LDR      r0,[r5,#0x60]
        0x08007984:    f4005000    ...P    AND      r0,r0,#0x2000
        0x08007988:    9000        ..      STR      r0,[sp,#0]
        0x0800798a:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800798c:    f0400004    @...    ORR      r0,r0,#4
        0x08007990:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007992:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007994:    f8cd8054    ..T.    STR      r8,[sp,#0x54]
        0x08007998:    f0000004    ....    AND      r0,r0,#4
        0x0800799c:    9000        ..      STR      r0,[sp,#0]
        0x0800799e:    2040        @       MOVS     r0,#0x40
        0x080079a0:    e9cd0610    ....    STRD     r0,r6,[sp,#0x40]
        0x080079a4:    a910        ..      ADD      r1,sp,#0x40
        0x080079a6:    48bc        .H      LDR      r0,[pc,#752] ; [0x8007c98] = 0x48000800
        0x080079a8:    f7fbfa48    ..H.    BL       LL_GPIO_Init ; 0x8002e3c
        0x080079ac:    2080        .       MOVS     r0,#0x80
        0x080079ae:    9010        ..      STR      r0,[sp,#0x40]
        0x080079b0:    e9cd6411    ...d    STRD     r6,r4,[sp,#0x44]
        0x080079b4:    e9cd4814    ...H    STRD     r4,r8,[sp,#0x50]
        0x080079b8:    a910        ..      ADD      r1,sp,#0x40
        0x080079ba:    48b7        .H      LDR      r0,[pc,#732] ; [0x8007c98] = 0x48000800
        0x080079bc:    9413        ..      STR      r4,[sp,#0x4c]
        0x080079be:    f7fbfa3d    ..=.    BL       LL_GPIO_Init ; 0x8002e3c
        0x080079c2:    15b8        ..      ASRS     r0,r7,#22
        0x080079c4:    9010        ..      STR      r0,[sp,#0x40]
        0x080079c6:    e9cd6411    ...d    STRD     r6,r4,[sp,#0x44]
        0x080079ca:    e9cd4814    ...H    STRD     r4,r8,[sp,#0x50]
        0x080079ce:    a910        ..      ADD      r1,sp,#0x40
        0x080079d0:    48b1        .H      LDR      r0,[pc,#708] ; [0x8007c98] = 0x48000800
        0x080079d2:    9413        ..      STR      r4,[sp,#0x4c]
        0x080079d4:    f7fbfa32    ..2.    BL       LL_GPIO_Init ; 0x8002e3c
        0x080079d8:    f8ad4008    ...@    STRH     r4,[sp,#8]
        0x080079dc:    f64f70ff    O..p    MOV      r0,#0xffff
        0x080079e0:    e9cd4003    ...@    STRD     r4,r0,[sp,#0xc]
        0x080079e4:    f8dfa2b4    ....    LDR      r10,[pc,#692] ; [0x8007c9c] = 0x40013400
        0x080079e8:    9405        ..      STR      r4,[sp,#0x14]
        0x080079ea:    a902        ..      ADD      r1,sp,#8
        0x080079ec:    4650        PF      MOV      r0,r10
        0x080079ee:    9406        ..      STR      r4,[sp,#0x18]
        0x080079f0:    f7fbfc5c    ..\.    BL       LL_TIM_Init ; 0x80032ac
        0x080079f4:    f8da0000    ....    LDR      r0,[r10,#0]
        0x080079f8:    f0200080     ...    BIC      r0,r0,#0x80
        0x080079fc:    f8ca0000    ....    STR      r0,[r10,#0]
        0x08007a00:    f8da0020    .. .    LDR      r0,[r10,#0x20]
        0x08007a04:    f0200011     ...    BIC      r0,r0,#0x11
        0x08007a08:    f8ca0020    .. .    STR      r0,[r10,#0x20]
        0x08007a0c:    48a4        .H      LDR      r0,[pc,#656] ; [0x8007ca0] = 0x80089dc
        0x08007a0e:    49a5        .I      LDR      r1,[pc,#660] ; [0x8007ca4] = 0x40013418
        0x08007a10:    7800        .x      LDRB     r0,[r0,#0]
        0x08007a12:    4408        .D      ADD      r0,r0,r1
        0x08007a14:    6802        .h      LDR      r2,[r0,#0]
        0x08007a16:    49a4        .I      LDR      r1,[pc,#656] ; [0x8007ca8] = 0x80089f0
        0x08007a18:    f04f0c03    O...    MOV      r12,#3
        0x08007a1c:    780b        .x      LDRB     r3,[r1,#0]
        0x08007a1e:    fa0cf903    ....    LSL      r9,r12,r3
        0x08007a22:    ea220209    "...    BIC      r2,r2,r9
        0x08007a26:    ea420209    B...    ORR      r2,r2,r9
        0x08007a2a:    6002        .`      STR      r2,[r0,#0]
        0x08007a2c:    6803        .h      LDR      r3,[r0,#0]
        0x08007a2e:    780a        .x      LDRB     r2,[r1,#0]
        0x08007a30:    f04f0c0c    O...    MOV      r12,#0xc
        0x08007a34:    fa0cf202    ....    LSL      r2,r12,r2
        0x08007a38:    9218        ..      STR      r2,[sp,#0x60]
        0x08007a3a:    ea230202    #...    BIC      r2,r3,r2
        0x08007a3e:    780b        .x      LDRB     r3,[r1,#0]
        0x08007a40:    fa04f703    ....    LSL      r7,r4,r3
        0x08007a44:    433a        :C      ORRS     r2,r2,r7
        0x08007a46:    6002        .`      STR      r2,[r0,#0]
        0x08007a48:    6802        .h      LDR      r2,[r0,#0]
        0x08007a4a:    7809        .x      LDRB     r1,[r1,#0]
        0x08007a4c:    23f0        .#      MOVS     r3,#0xf0
        0x08007a4e:    fa03f101    ....    LSL      r1,r3,r1
        0x08007a52:    911b        ..      STR      r1,[sp,#0x6c]
        0x08007a54:    ea220101    "...    BIC      r1,r2,r1
        0x08007a58:    4339        9C      ORRS     r1,r1,r7
        0x08007a5a:    6001        .`      STR      r1,[r0,#0]
        0x08007a5c:    f8da1020    .. .    LDR      r1,[r10,#0x20]
        0x08007a60:    4892        .H      LDR      r0,[pc,#584] ; [0x8007cac] = 0x80089fa
        0x08007a62:    220a        ."      MOVS     r2,#0xa
        0x08007a64:    7800        .x      LDRB     r0,[r0,#0]
        0x08007a66:    fa02f000    ....    LSL      r0,r2,r0
        0x08007a6a:    901a        ..      STR      r0,[sp,#0x68]
        0x08007a6c:    ea210000    !...    BIC      r0,r1,r0
        0x08007a70:    498e        .I      LDR      r1,[pc,#568] ; [0x8007cac] = 0x80089fa
        0x08007a72:    7809        .x      LDRB     r1,[r1,#0]
        0x08007a74:    fa04fb01    ....    LSL      r11,r4,r1
        0x08007a78:    ea40000b    @...    ORR      r0,r0,r11
        0x08007a7c:    f8ca0020    .. .    STR      r0,[r10,#0x20]
        0x08007a80:    f8da0004    ....    LDR      r0,[r10,#4]
        0x08007a84:    f0400080    @...    ORR      r0,r0,#0x80
        0x08007a88:    f8ca0004    ....    STR      r0,[r10,#4]
        0x08007a8c:    f8da0008    ....    LDR      r0,[r10,#8]
        0x08007a90:    f0200070     .p.    BIC      r0,r0,#0x70
        0x08007a94:    f4201040     .@.    BIC      r0,r0,#0x300000
        0x08007a98:    f0400040    @.@.    ORR      r0,r0,#0x40
        0x08007a9c:    f8ca0008    ....    STR      r0,[r10,#8]
        0x08007aa0:    f8da0008    ....    LDR      r0,[r10,#8]
        0x08007aa4:    f0200007     ...    BIC      r0,r0,#7
        0x08007aa8:    f4203080     ..0    BIC      r0,r0,#0x10000
        0x08007aac:    f0400004    @...    ORR      r0,r0,#4
        0x08007ab0:    f8ca0008    ....    STR      r0,[r10,#8]
        0x08007ab4:    2070        p       MOVS     r0,#0x70
        0x08007ab6:    e9cd0408    ....    STRD     r0,r4,[sp,#0x20]
        0x08007aba:    940a        ..      STR      r4,[sp,#0x28]
        0x08007abc:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007abe:    940c        ..      STR      r4,[sp,#0x30]
        0x08007ac0:    940d        ..      STR      r4,[sp,#0x34]
        0x08007ac2:    940e        ..      STR      r4,[sp,#0x38]
        0x08007ac4:    aa08        ..      ADD      r2,sp,#0x20
        0x08007ac6:    2110        .!      MOVS     r1,#0x10
        0x08007ac8:    4650        PF      MOV      r0,r10
        0x08007aca:    940f        ..      STR      r4,[sp,#0x3c]
        0x08007acc:    f7fbfc46    ..F.    BL       LL_TIM_OC_Init ; 0x800335c
        0x08007ad0:    4973        sI      LDR      r1,[pc,#460] ; [0x8007ca0] = 0x80089dc
        0x08007ad2:    2002        .       MOVS     r0,#2
        0x08007ad4:    4a73        sJ      LDR      r2,[pc,#460] ; [0x8007ca4] = 0x40013418
        0x08007ad6:    5c09        .\      LDRB     r1,[r1,r0]
        0x08007ad8:    4411        .D      ADD      r1,r1,r2
        0x08007ada:    680a        .h      LDR      r2,[r1,#0]
        0x08007adc:    4b74        tK      LDR      r3,[pc,#464] ; [0x8007cb0] = 0x80089e6
        0x08007ade:    5c18        .\      LDRB     r0,[r3,r0]
        0x08007ae0:    fa08f000    ....    LSL      r0,r8,r0
        0x08007ae4:    ea220000    "...    BIC      r0,r2,r0
        0x08007ae8:    6008        .`      STR      r0,[r1,#0]
        0x08007aea:    4650        PF      MOV      r0,r10
        0x08007aec:    6841        Ah      LDR      r1,[r0,#4]
        0x08007aee:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x08007af2:    f0217100    !..q    BIC      r1,r1,#0x2000000
        0x08007af6:    f0410150    A.P.    ORR      r1,r1,#0x50
        0x08007afa:    6041        A`      STR      r1,[r0,#4]
        0x08007afc:    6841        Ah      LDR      r1,[r0,#4]
        0x08007afe:    f4210170    !.p.    BIC      r1,r1,#0xf00000
        0x08007b02:    6041        A`      STR      r1,[r0,#4]
        0x08007b04:    6881        .h      LDR      r1,[r0,#8]
        0x08007b06:    f0210180    !...    BIC      r1,r1,#0x80
        0x08007b0a:    6081        .`      STR      r1,[r0,#8]
        0x08007b0c:    9402        ..      STR      r4,[sp,#8]
        0x08007b0e:    9403        ..      STR      r4,[sp,#0xc]
        0x08007b10:    9404        ..      STR      r4,[sp,#0x10]
        0x08007b12:    9400        ..      STR      r4,[sp,#0]
        0x08007b14:    9401        ..      STR      r4,[sp,#4]
        0x08007b16:    9407        ..      STR      r4,[sp,#0x1c]
        0x08007b18:    9408        ..      STR      r4,[sp,#0x20]
        0x08007b1a:    9409        ..      STR      r4,[sp,#0x24]
        0x08007b1c:    9405        ..      STR      r4,[sp,#0x14]
        0x08007b1e:    9406        ..      STR      r4,[sp,#0x18]
        0x08007b20:    940c        ..      STR      r4,[sp,#0x30]
        0x08007b22:    940d        ..      STR      r4,[sp,#0x34]
        0x08007b24:    940e        ..      STR      r4,[sp,#0x38]
        0x08007b26:    6da8        .m      LDR      r0,[r5,#0x58]
        0x08007b28:    f4404000    @..@    ORR      r0,r0,#0x8000
        0x08007b2c:    65a8        .e      STR      r0,[r5,#0x58]
        0x08007b2e:    6da8        .m      LDR      r0,[r5,#0x58]
        0x08007b30:    f4004000    ...@    AND      r0,r0,#0x8000
        0x08007b34:    9010        ..      STR      r0,[sp,#0x40]
        0x08007b36:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007b38:    f0400001    @...    ORR      r0,r0,#1
        0x08007b3c:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007b3e:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007b40:    f0000001    ....    AND      r0,r0,#1
        0x08007b44:    9010        ..      STR      r0,[sp,#0x40]
        0x08007b46:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007b48:    f0400004    @...    ORR      r0,r0,#4
        0x08007b4c:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007b4e:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007b50:    a90a        ..      ADD      r1,sp,#0x28
        0x08007b52:    f0000004    ....    AND      r0,r0,#4
        0x08007b56:    9010        ..      STR      r0,[sp,#0x40]
        0x08007b58:    2010        .       MOVS     r0,#0x10
        0x08007b5a:    e9cd060a    ....    STRD     r0,r6,[sp,#0x28]
        0x08007b5e:    2006        .       MOVS     r0,#6
        0x08007b60:    900f        ..      STR      r0,[sp,#0x3c]
        0x08007b62:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08007b66:    f7fbf969    ..i.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007b6a:    f44f6a80    O..j    MOV      r10,#0x400
        0x08007b6e:    f8cda028    ..(.    STR      r10,[sp,#0x28]
        0x08007b72:    e9cd640b    ...d    STRD     r6,r4,[sp,#0x2c]
        0x08007b76:    2006        .       MOVS     r0,#6
        0x08007b78:    e9cd400e    ...@    STRD     r4,r0,[sp,#0x38]
        0x08007b7c:    a90a        ..      ADD      r1,sp,#0x28
        0x08007b7e:    940d        ..      STR      r4,[sp,#0x34]
        0x08007b80:    4845        EH      LDR      r0,[pc,#276] ; [0x8007c98] = 0x48000800
        0x08007b82:    f7fbf95b    ..[.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007b86:    f44f6000    O..`    MOV      r0,#0x800
        0x08007b8a:    900a        ..      STR      r0,[sp,#0x28]
        0x08007b8c:    e9cd640b    ...d    STRD     r6,r4,[sp,#0x2c]
        0x08007b90:    2006        .       MOVS     r0,#6
        0x08007b92:    e9cd400e    ...@    STRD     r4,r0,[sp,#0x38]
        0x08007b96:    a90a        ..      ADD      r1,sp,#0x28
        0x08007b98:    940d        ..      STR      r4,[sp,#0x34]
        0x08007b9a:    483f        ?H      LDR      r0,[pc,#252] ; [0x8007c98] = 0x48000800
        0x08007b9c:    f7fbf94e    ..N.    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007ba0:    4944        DI      LDR      r1,[pc,#272] ; [0x8007cb4] = 0x40020020
        0x08007ba2:    4838        8H      LDR      r0,[pc,#224] ; [0x8007c84] = 0x40020400
        0x08007ba4:    f04f0c08    O...    MOV      r12,#8
        0x08007ba8:    f8d11800    ....    LDR      r1,[r1,#0x800]
        0x08007bac:    4a41        AJ      LDR      r2,[pc,#260] ; [0x8007cb4] = 0x40020020
        0x08007bae:    f02101ff    !...    BIC      r1,r1,#0xff
        0x08007bb2:    f041010e    A...    ORR      r1,r1,#0xe
        0x08007bb6:    f8c21800    ....    STR      r1,[r2,#0x800]
        0x08007bba:    4934        4I      LDR      r1,[pc,#208] ; [0x8007c8c] = 0x80089d6
        0x08007bbc:    780a        .x      LDRB     r2,[r1,#0]
        0x08007bbe:    5882        .X      LDR      r2,[r0,r2]
        0x08007bc0:    780b        .x      LDRB     r3,[r1,#0]
        0x08007bc2:    f0220210    "...    BIC      r2,r2,#0x10
        0x08007bc6:    f4224280    "..B    BIC      r2,r2,#0x4000
        0x08007bca:    50c2        .P      STR      r2,[r0,r3]
        0x08007bcc:    780a        .x      LDRB     r2,[r1,#0]
        0x08007bce:    5882        .X      LDR      r2,[r0,r2]
        0x08007bd0:    780b        .x      LDRB     r3,[r1,#0]
        0x08007bd2:    f4225240    ".@R    BIC      r2,r2,#0x3000
        0x08007bd6:    50c2        .P      STR      r2,[r0,r3]
        0x08007bd8:    780a        .x      LDRB     r2,[r1,#0]
        0x08007bda:    5882        .X      LDR      r2,[r0,r2]
        0x08007bdc:    780b        .x      LDRB     r3,[r1,#0]
        0x08007bde:    f0420220    B. .    ORR      r2,r2,#0x20
        0x08007be2:    50c2        .P      STR      r2,[r0,r3]
        0x08007be4:    780a        .x      LDRB     r2,[r1,#0]
        0x08007be6:    5882        .X      LDR      r2,[r0,r2]
        0x08007be8:    780b        .x      LDRB     r3,[r1,#0]
        0x08007bea:    f0220240    ".@.    BIC      r2,r2,#0x40
        0x08007bee:    50c2        .P      STR      r2,[r0,r3]
        0x08007bf0:    780a        .x      LDRB     r2,[r1,#0]
        0x08007bf2:    5882        .X      LDR      r2,[r0,r2]
        0x08007bf4:    780b        .x      LDRB     r3,[r1,#0]
        0x08007bf6:    f0220280    "...    BIC      r2,r2,#0x80
        0x08007bfa:    50c2        .P      STR      r2,[r0,r3]
        0x08007bfc:    780a        .x      LDRB     r2,[r1,#0]
        0x08007bfe:    5882        .X      LDR      r2,[r0,r2]
        0x08007c00:    780b        .x      LDRB     r3,[r1,#0]
        0x08007c02:    f4227240    ".@r    BIC      r2,r2,#0x300
        0x08007c06:    f4427280    B..r    ORR      r2,r2,#0x100
        0x08007c0a:    50c2        .P      STR      r2,[r0,r3]
        0x08007c0c:    780a        .x      LDRB     r2,[r1,#0]
        0x08007c0e:    5882        .X      LDR      r2,[r0,r2]
        0x08007c10:    7809        .x      LDRB     r1,[r1,#0]
        0x08007c12:    f4226240    ".@b    BIC      r2,r2,#0xc00
        0x08007c16:    f4426280    B..b    ORR      r2,r2,#0x400
        0x08007c1a:    5042        BP      STR      r2,[r0,r1]
        0x08007c1c:    f44f7082    O..p    MOV      r0,#0x104
        0x08007c20:    e9cda000    ....    STRD     r10,r0,[sp,#0]
        0x08007c24:    f44f7040    O.@p    MOV      r0,#0x300
        0x08007c28:    e9cd0402    ....    STRD     r0,r4,[sp,#8]
        0x08007c2c:    f44f2080    O..     MOV      r0,#0x40000
        0x08007c30:    e9cd4004    ...@    STRD     r4,r0,[sp,#0x10]
        0x08007c34:    2007        .       MOVS     r0,#7
        0x08007c36:    e9cd4008    ...@    STRD     r4,r0,[sp,#0x20]
        0x08007c3a:    e9cdc406    ....    STRD     r12,r4,[sp,#0x18]
        0x08007c3e:    f8dfa078    ..x.    LDR      r10,[pc,#120] ; [0x8007cb8] = 0x40003c00
        0x08007c42:    4669        iF      MOV      r1,sp
        0x08007c44:    4650        PF      MOV      r0,r10
        0x08007c46:    f7fbfab1    ....    BL       LL_SPI_Init ; 0x80031ac
        0x08007c4a:    f8da0004    ....    LDR      r0,[r10,#4]
        0x08007c4e:    f0200010     ...    BIC      r0,r0,#0x10
        0x08007c52:    f8ca0004    ....    STR      r0,[r10,#4]
        0x08007c56:    f8da0004    ....    LDR      r0,[r10,#4]
        0x08007c5a:    f0400008    @...    ORR      r0,r0,#8
        0x08007c5e:    f8ca0004    ....    STR      r0,[r10,#4]
        0x08007c62:    9409        ..      STR      r4,[sp,#0x24]
        0x08007c64:    940a        ..      STR      r4,[sp,#0x28]
        0x08007c66:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007c68:    9408        ..      STR      r4,[sp,#0x20]
        0x08007c6a:    940c        ..      STR      r4,[sp,#0x30]
        0x08007c6c:    9404        ..      STR      r4,[sp,#0x10]
        0x08007c6e:    9405        ..      STR      r4,[sp,#0x14]
        0x08007c70:    9406        ..      STR      r4,[sp,#0x18]
        0x08007c72:    6da8        .m      LDR      r0,[r5,#0x58]
        0x08007c74:    f0400002    @...    ORR      r0,r0,#2
        0x08007c78:    65a8        .e      STR      r0,[r5,#0x58]
        0x08007c7a:    6da8        .m      LDR      r0,[r5,#0x58]
        0x08007c7c:    e01e        ..      B        0x8007cbc ; main + 3308
    $d
        0x08007c7e:    0000        ..      DCW    0
        0x08007c80:    48000400    ...H    DCD    1207960576
        0x08007c84:    40020400    ...@    DCD    1073873920
        0x08007c88:    40020024    $..@    DCD    1073872932
        0x08007c8c:    080089d6    ....    DCD    134253014
        0x08007c90:    30a0a7fb    ...0    DCD    815835131
        0x08007c94:    40005400    .T.@    DCD    1073763328
        0x08007c98:    48000800    ...H    DCD    1207961600
        0x08007c9c:    40013400    .4.@    DCD    1073820672
        0x08007ca0:    080089dc    ....    DCD    134253020
        0x08007ca4:    40013418    .4.@    DCD    1073820696
        0x08007ca8:    080089f0    ....    DCD    134253040
        0x08007cac:    080089fa    ....    DCD    134253050
        0x08007cb0:    080089e6    ....    DCD    134253030
        0x08007cb4:    40020020     ..@    DCD    1073872928
        0x08007cb8:    40003c00    .<.@    DCD    1073757184
