ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
    $t
        0x08007cbc:    f0000002    ....    AND      r0,r0,#2
        0x08007cc0:    9000        ..      STR      r0,[sp,#0]
        0x08007cc2:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007cc4:    f0400001    @...    ORR      r0,r0,#1
        0x08007cc8:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007cca:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007ccc:    f0000001    ....    AND      r0,r0,#1
        0x08007cd0:    9000        ..      STR      r0,[sp,#0]
        0x08007cd2:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007cd4:    f0400002    @...    ORR      r0,r0,#2
        0x08007cd8:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007cda:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007cdc:    a902        ..      ADD      r1,sp,#8
        0x08007cde:    f0000002    ....    AND      r0,r0,#2
        0x08007ce2:    9000        ..      STR      r0,[sp,#0]
        0x08007ce4:    2040        @       MOVS     r0,#0x40
        0x08007ce6:    e9cd0602    ....    STRD     r0,r6,[sp,#8]
        0x08007cea:    f04f4090    O..@    MOV      r0,#0x48000000
        0x08007cee:    9607        ..      STR      r6,[sp,#0x1c]
        0x08007cf0:    f7fbf8a4    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007cf4:    2020                MOVS     r0,#0x20
        0x08007cf6:    9002        ..      STR      r0,[sp,#8]
        0x08007cf8:    e9cd6403    ...d    STRD     r6,r4,[sp,#0xc]
        0x08007cfc:    e9cd4606    ...F    STRD     r4,r6,[sp,#0x18]
        0x08007d00:    a902        ..      ADD      r1,sp,#8
        0x08007d02:    48fd        .H      LDR      r0,[pc,#1012] ; [0x80080f8] = 0x48000400
        0x08007d04:    9405        ..      STR      r4,[sp,#0x14]
        0x08007d06:    f7fbf899    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007d0a:    f8ad4020    .. @    STRH     r4,[sp,#0x20]
        0x08007d0e:    f2427010    B..p    MOV      r0,#0x2710
        0x08007d12:    e9cd4009    ...@    STRD     r4,r0,[sp,#0x24]
        0x08007d16:    f8dfa3e4    ....    LDR      r10,[pc,#996] ; [0x80080fc] = 0x40000400
        0x08007d1a:    a908        ..      ADD      r1,sp,#0x20
        0x08007d1c:    4650        PF      MOV      r0,r10
        0x08007d1e:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007d20:    f7fbfac4    ....    BL       LL_TIM_Init ; 0x80032ac
        0x08007d24:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08007d28:    f0200080     ...    BIC      r0,r0,#0x80
        0x08007d2c:    f8ca0000    ....    STR      r0,[r10,#0]
        0x08007d30:    f8da0008    ....    LDR      r0,[r10,#8]
        0x08007d34:    f0200007     ...    BIC      r0,r0,#7
        0x08007d38:    f4203080     ..0    BIC      r0,r0,#0x10000
        0x08007d3c:    f0400003    @...    ORR      r0,r0,#3
        0x08007d40:    f8ca0008    ....    STR      r0,[r10,#8]
        0x08007d44:    48ee        .H      LDR      r0,[pc,#952] ; [0x8008100] = 0x80089dc
        0x08007d46:    7800        .x      LDRB     r0,[r0,#0]
        0x08007d48:    f1004080    ...@    ADD      r0,r0,#0x40000000
        0x08007d4c:    f5006083    ...`    ADD      r0,r0,#0x418
        0x08007d50:    6802        .h      LDR      r2,[r0,#0]
        0x08007d52:    49ec        .I      LDR      r1,[pc,#944] ; [0x8008104] = 0x80089f0
        0x08007d54:    ea220309    "...    BIC      r3,r2,r9
        0x08007d58:    2201        ."      MOVS     r2,#1
        0x08007d5a:    f891c000    ....    LDRB     r12,[r1,#0]
        0x08007d5e:    fa02f20c    ....    LSL      r2,r2,r12
        0x08007d62:    431a        .C      ORRS     r2,r2,r3
        0x08007d64:    6002        .`      STR      r2,[r0,#0]
        0x08007d66:    6803        .h      LDR      r3,[r0,#0]
        0x08007d68:    9a18        ..      LDR      r2,[sp,#0x60]
        0x08007d6a:    ea230202    #...    BIC      r2,r3,r2
        0x08007d6e:    433a        :C      ORRS     r2,r2,r7
        0x08007d70:    6002        .`      STR      r2,[r0,#0]
        0x08007d72:    6803        .h      LDR      r3,[r0,#0]
        0x08007d74:    9a1b        ..      LDR      r2,[sp,#0x6c]
        0x08007d76:    f891c000    ....    LDRB     r12,[r1,#0]
        0x08007d7a:    ea230202    #...    BIC      r2,r3,r2
        0x08007d7e:    2330        0#      MOVS     r3,#0x30
        0x08007d80:    fa03f30c    ....    LSL      r3,r3,r12
        0x08007d84:    431a        .C      ORRS     r2,r2,r3
        0x08007d86:    6002        .`      STR      r2,[r0,#0]
        0x08007d88:    f8da2020    ..      LDR      r2,[r10,#0x20]
        0x08007d8c:    981a        ..      LDR      r0,[sp,#0x68]
        0x08007d8e:    ea220000    "...    BIC      r0,r2,r0
        0x08007d92:    ea40000b    @...    ORR      r0,r0,r11
        0x08007d96:    f8ca0020    .. .    STR      r0,[r10,#0x20]
        0x08007d9a:    f1a10014    ....    SUB      r0,r1,#0x14
        0x08007d9e:    7880        .x      LDRB     r0,[r0,#2]
        0x08007da0:    f1004080    ...@    ADD      r0,r0,#0x40000000
        0x08007da4:    f5006083    ...`    ADD      r0,r0,#0x418
        0x08007da8:    6802        .h      LDR      r2,[r0,#0]
        0x08007daa:    788b        .x      LDRB     r3,[r1,#2]
        0x08007dac:    f04f0c03    O...    MOV      r12,#3
        0x08007db0:    fa0cf303    ....    LSL      r3,r12,r3
        0x08007db4:    ea220303    "...    BIC      r3,r2,r3
        0x08007db8:    f891c002    ....    LDRB     r12,[r1,#2]
        0x08007dbc:    2201        ."      MOVS     r2,#1
        0x08007dbe:    fa02f20c    ....    LSL      r2,r2,r12
        0x08007dc2:    431a        .C      ORRS     r2,r2,r3
        0x08007dc4:    6002        .`      STR      r2,[r0,#0]
        0x08007dc6:    6802        .h      LDR      r2,[r0,#0]
        0x08007dc8:    788b        .x      LDRB     r3,[r1,#2]
        0x08007dca:    f04f0c0c    O...    MOV      r12,#0xc
        0x08007dce:    fa0cf303    ....    LSL      r3,r12,r3
        0x08007dd2:    439a        .C      BICS     r2,r2,r3
        0x08007dd4:    788b        .x      LDRB     r3,[r1,#2]
        0x08007dd6:    fa04f303    ....    LSL      r3,r4,r3
        0x08007dda:    431a        .C      ORRS     r2,r2,r3
        0x08007ddc:    6002        .`      STR      r2,[r0,#0]
        0x08007dde:    f8d0c000    ....    LDR      r12,[r0,#0]
        0x08007de2:    788a        .x      LDRB     r2,[r1,#2]
        0x08007de4:    23f0        .#      MOVS     r3,#0xf0
        0x08007de6:    fa03f202    ....    LSL      r2,r3,r2
        0x08007dea:    ea2c0302    ,...    BIC      r3,r12,r2
        0x08007dee:    7889        .x      LDRB     r1,[r1,#2]
        0x08007df0:    2230        0"      MOVS     r2,#0x30
        0x08007df2:    fa02f101    ....    LSL      r1,r2,r1
        0x08007df6:    4319        .C      ORRS     r1,r1,r3
        0x08007df8:    6001        .`      STR      r1,[r0,#0]
        0x08007dfa:    4650        PF      MOV      r0,r10
        0x08007dfc:    2200        ."      MOVS     r2,#0
        0x08007dfe:    6a03        .j      LDR      r3,[r0,#0x20]
        0x08007e00:    f8dfc304    ....    LDR      r12,[pc,#772] ; [0x8008108] = 0x80089fa
        0x08007e04:    f89c1002    ....    LDRB     r1,[r12,#2]
        0x08007e08:    f04f0c0a    O...    MOV      r12,#0xa
        0x08007e0c:    fa0cfc01    ....    LSL      r12,r12,r1
        0x08007e10:    ea23030c    #...    BIC      r3,r3,r12
        0x08007e14:    fa02f101    ....    LSL      r1,r2,r1
        0x08007e18:    4319        .C      ORRS     r1,r1,r3
        0x08007e1a:    6201        .b      STR      r1,[r0,#0x20]
        0x08007e1c:    6841        Ah      LDR      r1,[r0,#4]
        0x08007e1e:    f0210170    !.p.    BIC      r1,r1,#0x70
        0x08007e22:    f0217100    !..q    BIC      r1,r1,#0x2000000
        0x08007e26:    6041        A`      STR      r1,[r0,#4]
        0x08007e28:    6881        .h      LDR      r1,[r0,#8]
        0x08007e2a:    f0210180    !...    BIC      r1,r1,#0x80
        0x08007e2e:    6081        .`      STR      r1,[r0,#8]
        0x08007e30:    9409        ..      STR      r4,[sp,#0x24]
        0x08007e32:    940a        ..      STR      r4,[sp,#0x28]
        0x08007e34:    9408        ..      STR      r4,[sp,#0x20]
        0x08007e36:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007e38:    940e        ..      STR      r4,[sp,#0x38]
        0x08007e3a:    940f        ..      STR      r4,[sp,#0x3c]
        0x08007e3c:    940c        ..      STR      r4,[sp,#0x30]
        0x08007e3e:    940d        ..      STR      r4,[sp,#0x34]
        0x08007e40:    9404        ..      STR      r4,[sp,#0x10]
        0x08007e42:    9405        ..      STR      r4,[sp,#0x14]
        0x08007e44:    9406        ..      STR      r4,[sp,#0x18]
        0x08007e46:    f8d50088    ....    LDR      r0,[r5,#0x88]
        0x08007e4a:    f0200003     ...    BIC      r0,r0,#3
        0x08007e4e:    f8c50088    ....    STR      r0,[r5,#0x88]
        0x08007e52:    6e28        (n      LDR      r0,[r5,#0x60]
        0x08007e54:    f4404080    @..@    ORR      r0,r0,#0x4000
        0x08007e58:    6628        (f      STR      r0,[r5,#0x60]
        0x08007e5a:    6e28        (n      LDR      r0,[r5,#0x60]
        0x08007e5c:    f4004080    ...@    AND      r0,r0,#0x4000
        0x08007e60:    9000        ..      STR      r0,[sp,#0]
        0x08007e62:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007e64:    f0400004    @...    ORR      r0,r0,#4
        0x08007e68:    64e8        .d      STR      r0,[r5,#0x4c]
        0x08007e6a:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08007e6c:    2707        .'      MOVS     r7,#7
        0x08007e6e:    f0000004    ....    AND      r0,r0,#4
        0x08007e72:    9000        ..      STR      r0,[sp,#0]
        0x08007e74:    2010        .       MOVS     r0,#0x10
        0x08007e76:    9707        ..      STR      r7,[sp,#0x1c]
        0x08007e78:    e9cd0602    ....    STRD     r0,r6,[sp,#8]
        0x08007e7c:    a902        ..      ADD      r1,sp,#8
        0x08007e7e:    48a3        .H      LDR      r0,[pc,#652] ; [0x800810c] = 0x48000800
        0x08007e80:    f7faffdc    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007e84:    2020                MOVS     r0,#0x20
        0x08007e86:    9002        ..      STR      r0,[sp,#8]
        0x08007e88:    2002        .       MOVS     r0,#2
        0x08007e8a:    e9cd0403    ....    STRD     r0,r4,[sp,#0xc]
        0x08007e8e:    2007        .       MOVS     r0,#7
        0x08007e90:    e9cd4006    ...@    STRD     r4,r0,[sp,#0x18]
        0x08007e94:    a902        ..      ADD      r1,sp,#8
        0x08007e96:    9405        ..      STR      r4,[sp,#0x14]
        0x08007e98:    489c        .H      LDR      r0,[pc,#624] ; [0x800810c] = 0x48000800
        0x08007e9a:    f7faffcf    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x08007e9e:    489c        .H      LDR      r0,[pc,#624] ; [0x8008110] = 0x40020000
        0x08007ea0:    1d01        ..      ADDS     r1,r0,#4
        0x08007ea2:    f8d11800    ....    LDR      r1,[r1,#0x800]
        0x08007ea6:    f02101ff    !...    BIC      r1,r1,#0xff
        0x08007eaa:    f0410218    A...    ORR      r2,r1,#0x18
        0x08007eae:    1d01        ..      ADDS     r1,r0,#4
        0x08007eb0:    f8c12800    ...(    STR      r2,[r1,#0x800]
        0x08007eb4:    f8df825c    ..\.    LDR      r8,[pc,#604] ; [0x8008114] = 0x80089d6
        0x08007eb8:    f8981001    ....    LDRB     r1,[r8,#1]
        0x08007ebc:    5841        AX      LDR      r1,[r0,r1]
        0x08007ebe:    4642        BF      MOV      r2,r8
        0x08007ec0:    f0210110    !...    BIC      r1,r1,#0x10
        0x08007ec4:    7852        Rx      LDRB     r2,[r2,#1]
        0x08007ec6:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x08007eca:    5081        .P      STR      r1,[r0,r2]
        0x08007ecc:    4641        AF      MOV      r1,r8
        0x08007ece:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007ed0:    5841        AX      LDR      r1,[r0,r1]
        0x08007ed2:    4642        BF      MOV      r2,r8
        0x08007ed4:    f4215140    !.@Q    BIC      r1,r1,#0x3000
        0x08007ed8:    7852        Rx      LDRB     r2,[r2,#1]
        0x08007eda:    5081        .P      STR      r1,[r0,r2]
        0x08007edc:    4641        AF      MOV      r1,r8
        0x08007ede:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007ee0:    5841        AX      LDR      r1,[r0,r1]
        0x08007ee2:    f0410220    A. .    ORR      r2,r1,#0x20
        0x08007ee6:    4641        AF      MOV      r1,r8
        0x08007ee8:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007eea:    5042        BP      STR      r2,[r0,r1]
        0x08007eec:    4641        AF      MOV      r1,r8
        0x08007eee:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007ef0:    5841        AX      LDR      r1,[r0,r1]
        0x08007ef2:    4642        BF      MOV      r2,r8
        0x08007ef4:    f0210140    !.@.    BIC      r1,r1,#0x40
        0x08007ef8:    7852        Rx      LDRB     r2,[r2,#1]
        0x08007efa:    5081        .P      STR      r1,[r0,r2]
        0x08007efc:    4641        AF      MOV      r1,r8
        0x08007efe:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007f00:    5841        AX      LDR      r1,[r0,r1]
        0x08007f02:    f0410280    A...    ORR      r2,r1,#0x80
        0x08007f06:    4641        AF      MOV      r1,r8
        0x08007f08:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007f0a:    5042        BP      STR      r2,[r0,r1]
        0x08007f0c:    4641        AF      MOV      r1,r8
        0x08007f0e:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007f10:    5841        AX      LDR      r1,[r0,r1]
        0x08007f12:    4642        BF      MOV      r2,r8
        0x08007f14:    f4217140    !.@q    BIC      r1,r1,#0x300
        0x08007f18:    7852        Rx      LDRB     r2,[r2,#1]
        0x08007f1a:    5081        .P      STR      r1,[r0,r2]
        0x08007f1c:    4641        AF      MOV      r1,r8
        0x08007f1e:    7849        Ix      LDRB     r1,[r1,#1]
        0x08007f20:    5841        AX      LDR      r1,[r0,r1]
        0x08007f22:    4642        BF      MOV      r2,r8
        0x08007f24:    f4216140    !.@a    BIC      r1,r1,#0xc00
        0x08007f28:    7852        Rx      LDRB     r2,[r2,#1]
        0x08007f2a:    5081        .P      STR      r1,[r0,r2]
        0x08007f2c:    f8d01800    ....    LDR      r1,[r0,#0x800]
        0x08007f30:    f02101ff    !...    BIC      r1,r1,#0xff
        0x08007f34:    f0410119    A...    ORR      r1,r1,#0x19
        0x08007f38:    f8c01800    ....    STR      r1,[r0,#0x800]
        0x08007f3c:    4641        AF      MOV      r1,r8
        0x08007f3e:    7809        .x      LDRB     r1,[r1,#0]
        0x08007f40:    5841        AX      LDR      r1,[r0,r1]
        0x08007f42:    4642        BF      MOV      r2,r8
        0x08007f44:    f0210110    !...    BIC      r1,r1,#0x10
        0x08007f48:    7812        .x      LDRB     r2,[r2,#0]
        0x08007f4a:    f4214180    !..A    BIC      r1,r1,#0x4000
        0x08007f4e:    f0410110    A...    ORR      r1,r1,#0x10
        0x08007f52:    5081        .P      STR      r1,[r0,r2]
        0x08007f54:    4641        AF      MOV      r1,r8
        0x08007f56:    7809        .x      LDRB     r1,[r1,#0]
        0x08007f58:    5841        AX      LDR      r1,[r0,r1]
        0x08007f5a:    4642        BF      MOV      r2,r8
        0x08007f5c:    f4215140    !.@Q    BIC      r1,r1,#0x3000
        0x08007f60:    7812        .x      LDRB     r2,[r2,#0]
        0x08007f62:    5081        .P      STR      r1,[r0,r2]
        0x08007f64:    4641        AF      MOV      r1,r8
        0x08007f66:    7809        .x      LDRB     r1,[r1,#0]
        0x08007f68:    5841        AX      LDR      r1,[r0,r1]
        0x08007f6a:    4642        BF      MOV      r2,r8
        0x08007f6c:    f0210120    !. .    BIC      r1,r1,#0x20
        0x08007f70:    7812        .x      LDRB     r2,[r2,#0]
        0x08007f72:    5081        .P      STR      r1,[r0,r2]
        0x08007f74:    4641        AF      MOV      r1,r8
        0x08007f76:    7809        .x      LDRB     r1,[r1,#0]
        0x08007f78:    5841        AX      LDR      r1,[r0,r1]
        0x08007f7a:    4642        BF      MOV      r2,r8
        0x08007f7c:    f0210140    !.@.    BIC      r1,r1,#0x40
        0x08007f80:    7812        .x      LDRB     r2,[r2,#0]
        0x08007f82:    5081        .P      STR      r1,[r0,r2]
        0x08007f84:    4641        AF      MOV      r1,r8
        0x08007f86:    7809        .x      LDRB     r1,[r1,#0]
        0x08007f88:    5841        AX      LDR      r1,[r0,r1]
        0x08007f8a:    4642        BF      MOV      r2,r8
        0x08007f8c:    f0410180    A...    ORR      r1,r1,#0x80
        0x08007f90:    7812        .x      LDRB     r2,[r2,#0]
        0x08007f92:    5081        .P      STR      r1,[r0,r2]
        0x08007f94:    4641        AF      MOV      r1,r8
        0x08007f96:    7809        .x      LDRB     r1,[r1,#0]
        0x08007f98:    5841        AX      LDR      r1,[r0,r1]
        0x08007f9a:    4642        BF      MOV      r2,r8
        0x08007f9c:    f4217140    !.@q    BIC      r1,r1,#0x300
        0x08007fa0:    7812        .x      LDRB     r2,[r2,#0]
        0x08007fa2:    5081        .P      STR      r1,[r0,r2]
        0x08007fa4:    4641        AF      MOV      r1,r8
        0x08007fa6:    7809        .x      LDRB     r1,[r1,#0]
        0x08007fa8:    5841        AX      LDR      r1,[r0,r1]
        0x08007faa:    4642        BF      MOV      r2,r8
        0x08007fac:    f4216140    !.@a    BIC      r1,r1,#0xc00
        0x08007fb0:    7812        .x      LDRB     r2,[r2,#0]
        0x08007fb2:    5081        .P      STR      r1,[r0,r2]
        0x08007fb4:    4858        XH      LDR      r0,[pc,#352] ; [0x8008118] = 0x16e360
        0x08007fb6:    f04f090c    O...    MOV      r9,#0xc
        0x08007fba:    e9cd4008    ...@    STRD     r4,r0,[sp,#0x20]
        0x08007fbe:    e9cd490c    ...I    STRD     r4,r9,[sp,#0x30]
        0x08007fc2:    f8dfa158    ..X.    LDR      r10,[pc,#344] ; [0x800811c] = 0x40013800
        0x08007fc6:    940a        ..      STR      r4,[sp,#0x28]
        0x08007fc8:    940b        ..      STR      r4,[sp,#0x2c]
        0x08007fca:    940e        ..      STR      r4,[sp,#0x38]
        0x08007fcc:    a908        ..      ADD      r1,sp,#0x20
        0x08007fce:    4650        PF      MOV      r0,r10
        0x08007fd0:    940f        ..      STR      r4,[sp,#0x3c]
        0x08007fd2:    f7fbfb6d    ..m.    BL       LL_USART_Init ; 0x80036b0
        0x08007fd6:    2200        ."      MOVS     r2,#0
        0x08007fd8:    f10a0008    ....    ADD      r0,r10,#8
        0x08007fdc:    e8501f00    P...    LDREX    r1,[r0]
        0x08007fe0:    f362715f    b._q    BFI      r1,r2,#29,#3
        0x08007fe4:    e8401300    @...    STREX    r3,r1,[r0]
        0x08007fe8:    2b00        .+      CMP      r3,#0
        0x08007fea:    d1f7        ..      BNE      0x8007fdc ; main + 4108
        0x08007fec:    2000        .       MOVS     r0,#0
        0x08007fee:    f10a0108    ....    ADD      r1,r10,#8
        0x08007ff2:    bf00        ..      NOP      
        0x08007ff4:    e8512f00    Q../    LDREX    r2,[r1]
        0x08007ff8:    f0226260    ".`b    BIC      r2,r2,#0xe000000
        0x08007ffc:    ea426240    B.@b    ORR      r2,r2,r0,LSL #25
        0x08008000:    e8412300    A..#    STREX    r3,r2,[r1]
        0x08008004:    2b00        .+      CMP      r3,#0
        0x08008006:    d1f5        ..      BNE      0x8007ff4 ; main + 4132
        0x08008008:    f8da0000    ....    LDR      r0,[r10,#0]
        0x0800800c:    f0205000     ..P    BIC      r0,r0,#0x20000000
        0x08008010:    f8ca0000    ....    STR      r0,[r10,#0]
        0x08008014:    f8da0004    ....    LDR      r0,[r10,#4]
        0x08008018:    f4204090     ..@    BIC      r0,r0,#0x4800
        0x0800801c:    f8ca0004    ....    STR      r0,[r10,#4]
        0x08008020:    f8da0008    ....    LDR      r0,[r10,#8]
        0x08008024:    f020002a     .*.    BIC      r0,r0,#0x2a
        0x08008028:    f8ca0008    ....    STR      r0,[r10,#8]
        0x0800802c:    f8da0000    ....    LDR      r0,[r10,#0]
        0x08008030:    f0400001    @...    ORR      r0,r0,#1
        0x08008034:    f8ca0000    ....    STR      r0,[r10,#0]
        0x08008038:    f8da001c    ....    LDR      r0,[r10,#0x1c]
        0x0800803c:    f3c05040    ..@P    UBFX     r0,r0,#21,#1
        0x08008040:    2800        .(      CMP      r0,#0
        0x08008042:    d0f9        ..      BEQ      0x8008038 ; main + 4200
        0x08008044:    f8da001c    ....    LDR      r0,[r10,#0x1c]
        0x08008048:    f3c05080    ...P    UBFX     r0,r0,#22,#1
        0x0800804c:    2800        .(      CMP      r0,#0
        0x0800804e:    d0f3        ..      BEQ      0x8008038 ; main + 4200
        0x08008050:    9402        ..      STR      r4,[sp,#8]
        0x08008052:    9403        ..      STR      r4,[sp,#0xc]
        0x08008054:    9404        ..      STR      r4,[sp,#0x10]
        0x08008056:    9407        ..      STR      r4,[sp,#0x1c]
        0x08008058:    9408        ..      STR      r4,[sp,#0x20]
        0x0800805a:    9409        ..      STR      r4,[sp,#0x24]
        0x0800805c:    9405        ..      STR      r4,[sp,#0x14]
        0x0800805e:    9406        ..      STR      r4,[sp,#0x18]
        0x08008060:    940c        ..      STR      r4,[sp,#0x30]
        0x08008062:    940d        ..      STR      r4,[sp,#0x34]
        0x08008064:    940e        ..      STR      r4,[sp,#0x38]
        0x08008066:    f8d50088    ....    LDR      r0,[r5,#0x88]
        0x0800806a:    f0200030     .0.    BIC      r0,r0,#0x30
        0x0800806e:    f8c50088    ....    STR      r0,[r5,#0x88]
        0x08008072:    6da8        .m      LDR      r0,[r5,#0x58]
        0x08008074:    f4402080    @..     ORR      r0,r0,#0x40000
        0x08008078:    65a8        .e      STR      r0,[r5,#0x58]
        0x0800807a:    6da8        .m      LDR      r0,[r5,#0x58]
        0x0800807c:    f4002080    ...     AND      r0,r0,#0x40000
        0x08008080:    9000        ..      STR      r0,[sp,#0]
        0x08008082:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x08008084:    f0400002    @...    ORR      r0,r0,#2
        0x08008088:    64e8        .d      STR      r0,[r5,#0x4c]
        0x0800808a:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x0800808c:    f8dfa068    ..h.    LDR      r10,[pc,#104] ; [0x80080f8] = 0x48000400
        0x08008090:    f0000002    ....    AND      r0,r0,#2
        0x08008094:    9000        ..      STR      r0,[sp,#0]
        0x08008096:    f44f6080    O..`    MOV      r0,#0x400
        0x0800809a:    970f        ..      STR      r7,[sp,#0x3c]
        0x0800809c:    e9cd060a    ....    STRD     r0,r6,[sp,#0x28]
        0x080080a0:    a90a        ..      ADD      r1,sp,#0x28
        0x080080a2:    4650        PF      MOV      r0,r10
        0x080080a4:    f7fafeca    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x080080a8:    f44f6000    O..`    MOV      r0,#0x800
        0x080080ac:    900a        ..      STR      r0,[sp,#0x28]
        0x080080ae:    e9cd640b    ...d    STRD     r6,r4,[sp,#0x2c]
        0x080080b2:    e9cd470e    ...G    STRD     r4,r7,[sp,#0x38]
        0x080080b6:    a90a        ..      ADD      r1,sp,#0x28
        0x080080b8:    4650        PF      MOV      r0,r10
        0x080080ba:    940d        ..      STR      r4,[sp,#0x34]
        0x080080bc:    f7fafebe    ....    BL       LL_GPIO_Init ; 0x8002e3c
        0x080080c0:    f44f3ae1    O..:    MOV      r10,#0x1c200
        0x080080c4:    e9cd4a02    ...J    STRD     r4,r10,[sp,#8]
