ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080080c8:    e9cd4906    ...I    STRD     r4,r9,[sp,#0x18]
        0x080080cc:    f8dfb050    ..P.    LDR      r11,[pc,#80] ; [0x8008120] = 0x40004800
        0x080080d0:    9404        ..      STR      r4,[sp,#0x10]
        0x080080d2:    9405        ..      STR      r4,[sp,#0x14]
        0x080080d4:    9408        ..      STR      r4,[sp,#0x20]
        0x080080d6:    a902        ..      ADD      r1,sp,#8
        0x080080d8:    4658        XF      MOV      r0,r11
        0x080080da:    9409        ..      STR      r4,[sp,#0x24]
        0x080080dc:    f7fbfae8    ....    BL       LL_USART_Init ; 0x80036b0
        0x080080e0:    2200        ."      MOVS     r2,#0
        0x080080e2:    f10b0008    ....    ADD      r0,r11,#8
        0x080080e6:    bf00        ..      NOP      
        0x080080e8:    e8501f00    P...    LDREX    r1,[r0]
        0x080080ec:    f362715f    b._q    BFI      r1,r2,#29,#3
        0x080080f0:    e8401300    @...    STREX    r3,r1,[r0]
        0x080080f4:    2b00        .+      CMP      r3,#0
        0x080080f6:    e015        ..      B        0x8008124 ; main + 4436
    $d
        0x080080f8:    48000400    ...H    DCD    1207960576
        0x080080fc:    40000400    ...@    DCD    1073742848
        0x08008100:    080089dc    ....    DCD    134253020
        0x08008104:    080089f0    ....    DCD    134253040
        0x08008108:    080089fa    ....    DCD    134253050
        0x0800810c:    48000800    ...H    DCD    1207961600
        0x08008110:    40020000    ...@    DCD    1073872896
        0x08008114:    080089d6    ....    DCD    134253014
        0x08008118:    0016e360    `...    DCD    1500000
        0x0800811c:    40013800    .8.@    DCD    1073821696
        0x08008120:    40004800    .H.@    DCD    1073760256
    $t
        0x08008124:    d1e0        ..      BNE      0x80080e8 ; main + 4376
        0x08008126:    2100        .!      MOVS     r1,#0
        0x08008128:    f10b0008    ....    ADD      r0,r11,#8
        0x0800812c:    e8502f00    P../    LDREX    r2,[r0]
        0x08008130:    f0226260    ".`b    BIC      r2,r2,#0xe000000
        0x08008134:    ea426241    B.Ab    ORR      r2,r2,r1,LSL #25
        0x08008138:    e8402300    @..#    STREX    r3,r2,[r0]
        0x0800813c:    2b00        .+      CMP      r3,#0
        0x0800813e:    d1f5        ..      BNE      0x800812c ; main + 4444
        0x08008140:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08008144:    f0205000     ..P    BIC      r0,r0,#0x20000000
        0x08008148:    f8cb0000    ....    STR      r0,[r11,#0]
        0x0800814c:    f8db0004    ....    LDR      r0,[r11,#4]
        0x08008150:    f4204090     ..@    BIC      r0,r0,#0x4800
        0x08008154:    f8cb0004    ....    STR      r0,[r11,#4]
        0x08008158:    f8db0008    ....    LDR      r0,[r11,#8]
        0x0800815c:    f020002a     .*.    BIC      r0,r0,#0x2a
        0x08008160:    f8cb0008    ....    STR      r0,[r11,#8]
        0x08008164:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08008168:    f0400001    @...    ORR      r0,r0,#1
        0x0800816c:    f8cb0000    ....    STR      r0,[r11,#0]
        0x08008170:    f8db001c    ....    LDR      r0,[r11,#0x1c]
        0x08008174:    f3c05040    ..@P    UBFX     r0,r0,#21,#1
        0x08008178:    2800        .(      CMP      r0,#0
        0x0800817a:    d0f9        ..      BEQ      0x8008170 ; main + 4512
        0x0800817c:    f8db001c    ....    LDR      r0,[r11,#0x1c]
        0x08008180:    f3c05080    ...P    UBFX     r0,r0,#22,#1
        0x08008184:    2800        .(      CMP      r0,#0
        0x08008186:    d0f3        ..      BEQ      0x8008170 ; main + 4512
        0x08008188:    9409        ..      STR      r4,[sp,#0x24]
        0x0800818a:    940a        ..      STR      r4,[sp,#0x28]
        0x0800818c:    9408        ..      STR      r4,[sp,#0x20]
        0x0800818e:    940b        ..      STR      r4,[sp,#0x2c]
        0x08008190:    940e        ..      STR      r4,[sp,#0x38]
        0x08008192:    940f        ..      STR      r4,[sp,#0x3c]
        0x08008194:    940c        ..      STR      r4,[sp,#0x30]
        0x08008196:    940d        ..      STR      r4,[sp,#0x34]
        0x08008198:    9404        ..      STR      r4,[sp,#0x10]
        0x0800819a:    9405        ..      STR      r4,[sp,#0x14]
        0x0800819c:    9406        ..      STR      r4,[sp,#0x18]
        0x0800819e:    f8d50088    ....    LDR      r0,[r5,#0x88]
        0x080081a2:    f020000c     ...    BIC      r0,r0,#0xc
        0x080081a6:    f8c50088    ....    STR      r0,[r5,#0x88]
        0x080081aa:    6da8        .m      LDR      r0,[r5,#0x58]
        0x080081ac:    f4403000    @..0    ORR      r0,r0,#0x20000
        0x080081b0:    65a8        .e      STR      r0,[r5,#0x58]
        0x080081b2:    6da8        .m      LDR      r0,[r5,#0x58]
        0x080081b4:    f4003000    ...0    AND      r0,r0,#0x20000
        0x080081b8:    9000        ..      STR      r0,[sp,#0]
        0x080081ba:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x080081bc:    f0400001    @...    ORR      r0,r0,#1
        0x080081c0:    64e8        .d      STR      r0,[r5,#0x4c]
        0x080081c2:    6ce8        .l      LDR      r0,[r5,#0x4c]
        0x080081c4:    9707        ..      STR      r7,[sp,#0x1c]
        0x080081c6:    f0000001    ....    AND      r0,r0,#1
        0x080081ca:    9000        ..      STR      r0,[sp,#0]
        0x080081cc:    2004        .       MOVS     r0,#4
        0x080081ce:    e9cd0602    ....    STRD     r0,r6,[sp,#8]
        0x080081d2:    a902        ..      ADD      r1,sp,#8
        0x080081d4:    f04f4090    O..@    MOV      r0,#0x48000000
        0x080081d8:    f7fafe30    ..0.    BL       LL_GPIO_Init ; 0x8002e3c
        0x080081dc:    2008        .       MOVS     r0,#8
        0x080081de:    9002        ..      STR      r0,[sp,#8]
        0x080081e0:    e9cd6403    ...d    STRD     r6,r4,[sp,#0xc]
        0x080081e4:    e9cd4706    ...G    STRD     r4,r7,[sp,#0x18]
        0x080081e8:    a902        ..      ADD      r1,sp,#8
        0x080081ea:    f04f4090    O..@    MOV      r0,#0x48000000
        0x080081ee:    9405        ..      STR      r4,[sp,#0x14]
        0x080081f0:    f7fafe24    ..$.    BL       LL_GPIO_Init ; 0x8002e3c
        0x080081f4:    e9cd4a08    ...J    STRD     r4,r10,[sp,#0x20]
        0x080081f8:    e9cd490c    ...I    STRD     r4,r9,[sp,#0x30]
        0x080081fc:    4ed6        .N      LDR      r6,[pc,#856] ; [0x8008558] = 0x40004400
        0x080081fe:    940a        ..      STR      r4,[sp,#0x28]
        0x08008200:    940b        ..      STR      r4,[sp,#0x2c]
        0x08008202:    940e        ..      STR      r4,[sp,#0x38]
        0x08008204:    a908        ..      ADD      r1,sp,#0x20
        0x08008206:    4630        0F      MOV      r0,r6
        0x08008208:    940f        ..      STR      r4,[sp,#0x3c]
        0x0800820a:    f7fbfa51    ..Q.    BL       LL_USART_Init ; 0x80036b0
        0x0800820e:    2200        ."      MOVS     r2,#0
        0x08008210:    f1060108    ....    ADD      r1,r6,#8
        0x08008214:    e8510f00    Q...    LDREX    r0,[r1]
        0x08008218:    f362705f    b._p    BFI      r0,r2,#29,#3
        0x0800821c:    e8410300    A...    STREX    r3,r0,[r1]
        0x08008220:    2b00        .+      CMP      r3,#0
        0x08008222:    d1f7        ..      BNE      0x8008214 ; main + 4676
        0x08008224:    2100        .!      MOVS     r1,#0
        0x08008226:    f1060008    ....    ADD      r0,r6,#8
        0x0800822a:    bf00        ..      NOP      
        0x0800822c:    e8502f00    P../    LDREX    r2,[r0]
        0x08008230:    f0226260    ".`b    BIC      r2,r2,#0xe000000
        0x08008234:    ea426241    B.Ab    ORR      r2,r2,r1,LSL #25
        0x08008238:    e8402300    @..#    STREX    r3,r2,[r0]
        0x0800823c:    2b00        .+      CMP      r3,#0
        0x0800823e:    d1f5        ..      BNE      0x800822c ; main + 4700
        0x08008240:    6830        0h      LDR      r0,[r6,#0]
        0x08008242:    f0205000     ..P    BIC      r0,r0,#0x20000000
        0x08008246:    6030        0`      STR      r0,[r6,#0]
        0x08008248:    6870        ph      LDR      r0,[r6,#4]
        0x0800824a:    f4204090     ..@    BIC      r0,r0,#0x4800
        0x0800824e:    6070        p`      STR      r0,[r6,#4]
        0x08008250:    68b0        .h      LDR      r0,[r6,#8]
        0x08008252:    f020002a     .*.    BIC      r0,r0,#0x2a
        0x08008256:    60b0        .`      STR      r0,[r6,#8]
        0x08008258:    6830        0h      LDR      r0,[r6,#0]
        0x0800825a:    f0400001    @...    ORR      r0,r0,#1
        0x0800825e:    6030        0`      STR      r0,[r6,#0]
        0x08008260:    69f0        .i      LDR      r0,[r6,#0x1c]
        0x08008262:    f3c05040    ..@P    UBFX     r0,r0,#21,#1
        0x08008266:    2800        .(      CMP      r0,#0
        0x08008268:    d0fa        ..      BEQ      0x8008260 ; main + 4752
        0x0800826a:    69f0        .i      LDR      r0,[r6,#0x1c]
        0x0800826c:    f3c05080    ...P    UBFX     r0,r0,#22,#1
        0x08008270:    2800        .(      CMP      r0,#0
        0x08008272:    d0f5        ..      BEQ      0x8008260 ; main + 4752
        0x08008274:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x08008276:    f0400008    @...    ORR      r0,r0,#8
        0x0800827a:    64a8        .d      STR      r0,[r5,#0x48]
        0x0800827c:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x0800827e:    9400        ..      STR      r4,[sp,#0]
        0x08008280:    f0000008    ....    AND      r0,r0,#8
        0x08008284:    9401        ..      STR      r4,[sp,#4]
        0x08008286:    9403        ..      STR      r4,[sp,#0xc]
        0x08008288:    9404        ..      STR      r4,[sp,#0x10]
        0x0800828a:    6e28        (n      LDR      r0,[r5,#0x60]
        0x0800828c:    f4403000    @..0    ORR      r0,r0,#0x20000
        0x08008290:    6628        (f      STR      r0,[r5,#0x60]
        0x08008292:    6e28        (n      LDR      r0,[r5,#0x60]
        0x08008294:    4669        iF      MOV      r1,sp
        0x08008296:    f4003000    ...0    AND      r0,r0,#0x20000
        0x0800829a:    9005        ..      STR      r0,[sp,#0x14]
        0x0800829c:    f8ad4000    ...@    STRH     r4,[sp,#0]
        0x080082a0:    f64f70ff    O..p    MOV      r0,#0xffff
        0x080082a4:    4cad        .L      LDR      r4,[pc,#692] ; [0x800855c] = 0x40014400
        0x080082a6:    9002        ..      STR      r0,[sp,#8]
        0x080082a8:    4620         F      MOV      r0,r4
        0x080082aa:    f7faffff    ....    BL       LL_TIM_Init ; 0x80032ac
        0x080082ae:    6820         h      LDR      r0,[r4,#0]
        0x080082b0:    f0200080     ...    BIC      r0,r0,#0x80
        0x080082b4:    6020         `      STR      r0,[r4,#0]
        0x080082b6:    f7fbfebb    ....    BL       MX_USB_Device_Init ; 0x8004030
        0x080082ba:    49a9        .I      LDR      r1,[pc,#676] ; [0x8008560] = 0x40022000
        0x080082bc:    6f08        .o      LDR      r0,[r1,#0x70]
        0x080082be:    f4103f80    ...?    TST      r0,#0x10000
        0x080082c2:    d11b        ..      BNE      0x80082fc ; main + 4908
        0x080082c4:    48a7        .H      LDR      r0,[pc,#668] ; [0x8008564] = 0x45670123
        0x080082c6:    6088        .`      STR      r0,[r1,#8]
        0x080082c8:    48a7        .H      LDR      r0,[pc,#668] ; [0x8008568] = 0xcdef89ab
        0x080082ca:    6088        .`      STR      r0,[r1,#8]
        0x080082cc:    48a7        .H      LDR      r0,[pc,#668] ; [0x800856c] = 0x8192a3b
        0x080082ce:    60c8        .`      STR      r0,[r1,#0xc]
        0x080082d0:    48a7        .H      LDR      r0,[pc,#668] ; [0x8008570] = 0x4c5d6e7f
        0x080082d2:    60c8        .`      STR      r0,[r1,#0xc]
        0x080082d4:    6908        .i      LDR      r0,[r1,#0x10]
        0x080082d6:    f4103f80    ...?    TST      r0,#0x10000
        0x080082da:    d1fb        ..      BNE      0x80082d4 ; main + 4868
        0x080082dc:    6948        Hi      LDR      r0,[r1,#0x14]
        0x080082de:    f0204080     ..@    BIC      r0,r0,#0x40000000
        0x080082e2:    6148        Ha      STR      r0,[r1,#0x14]
        0x080082e4:    6f08        .o      LDR      r0,[r1,#0x70]
        0x080082e6:    f4403080    @..0    ORR      r0,r0,#0x10000
        0x080082ea:    6708        .g      STR      r0,[r1,#0x70]
        0x080082ec:    6948        Hi      LDR      r0,[r1,#0x14]
        0x080082ee:    f4403000    @..0    ORR      r0,r0,#0x20000
        0x080082f2:    6148        Ha      STR      r0,[r1,#0x14]
        0x080082f4:    6908        .i      LDR      r0,[r1,#0x10]
        0x080082f6:    f4103f80    ...?    TST      r0,#0x10000
        0x080082fa:    d1fb        ..      BNE      0x80082f4 ; main + 4900
        0x080082fc:    f7fcfcb4    ....    BL       SEGGER_RTT_Init ; 0x8004c68
        0x08008300:    489c        .H      LDR      r0,[pc,#624] ; [0x8008574] = 0x40020c00
        0x08008302:    6801        .h      LDR      r1,[r0,#0]
        0x08008304:    4a9c        .J      LDR      r2,[pc,#624] ; [0x8008578] = 0xff87f800
        0x08008306:    4011        .@      ANDS     r1,r1,r2
        0x08008308:    ea4121e0    A..!    ORR      r1,r1,r0,ASR #11
        0x0800830c:    6001        .`      STR      r1,[r0,#0]
        0x0800830e:    489b        .H      LDR      r0,[pc,#620] ; [0x800857c] = 0x20000140
        0x08008310:    6800        .h      LDR      r0,[r0,#0]
        0x08008312:    4780        .G      BLX      r0
        0x08008314:    499a        .I      LDR      r1,[pc,#616] ; [0x8008580] = 0x50001000
        0x08008316:    6808        .h      LDR      r0,[r1,#0]
        0x08008318:    f0400001    @...    ORR      r0,r0,#1
        0x0800831c:    6008        .`      STR      r0,[r1,#0]
        0x0800831e:    6808        .h      LDR      r0,[r1,#0]
        0x08008320:    f4403080    @..0    ORR      r0,r0,#0x10000
        0x08008324:    6008        .`      STR      r0,[r1,#0]
        0x08008326:    4897        .H      LDR      r0,[pc,#604] ; [0x8008584] = 0x50001008
        0x08008328:    6802        .h      LDR      r2,[r0,#0]
        0x0800832a:    f36f020b    o...    BFC      r2,#0,#12
        0x0800832e:    f442627a    B.zb    ORR      r2,r2,#0xfa0
        0x08008332:    6002        .`      STR      r2,[r0,#0]
        0x08008334:    4894        .H      LDR      r0,[pc,#592] ; [0x8008588] = 0x50001014
        0x08008336:    6802        .h      LDR      r2,[r0,#0]
        0x08008338:    f36f020b    o...    BFC      r2,#0,#12
        0x0800833c:    f442627a    B.zb    ORR      r2,r2,#0xfa0
        0x08008340:    6002        .`      STR      r2,[r0,#0]
        0x08008342:    6848        Hh      LDR      r0,[r1,#4]
        0x08008344:    f0400001    @...    ORR      r0,r0,#1
        0x08008348:    6048        H`      STR      r0,[r1,#4]
        0x0800834a:    6848        Hh      LDR      r0,[r1,#4]
        0x0800834c:    f0100f01    ....    TST      r0,#1
        0x08008350:    d1fb        ..      BNE      0x800834a ; main + 4986
        0x08008352:    6848        Hh      LDR      r0,[r1,#4]
        0x08008354:    f0400002    @...    ORR      r0,r0,#2
        0x08008358:    6048        H`      STR      r0,[r1,#4]
        0x0800835a:    6848        Hh      LDR      r0,[r1,#4]
        0x0800835c:    f0100f02    ....    TST      r0,#2
        0x08008360:    d1fb        ..      BNE      0x800835a ; main + 5002
        0x08008362:    488a        .H      LDR      r0,[pc,#552] ; [0x800858c] = 0x40010204
        0x08008364:    6801        .h      LDR      r1,[r0,#0]
        0x08008366:    f0410101    A...    ORR      r1,r1,#1
        0x0800836a:    6001        .`      STR      r1,[r0,#0]
        0x0800836c:    1d00        ..      ADDS     r0,r0,#4
        0x0800836e:    6801        .h      LDR      r1,[r0,#0]
        0x08008370:    f0410101    A...    ORR      r1,r1,#1
        0x08008374:    6001        .`      STR      r1,[r0,#0]
        0x08008376:    1d00        ..      ADDS     r0,r0,#4
        0x08008378:    6801        .h      LDR      r1,[r0,#0]
        0x0800837a:    f0410101    A...    ORR      r1,r1,#1
        0x0800837e:    6001        .`      STR      r1,[r0,#0]
        0x08008380:    4983        .I      LDR      r1,[pc,#524] ; [0x8008590] = 0x50000800
        0x08008382:    6808        .h      LDR      r0,[r1,#0]
        0x08008384:    f0400001    @...    ORR      r0,r0,#1
        0x08008388:    6008        .`      STR      r0,[r1,#0]
        0x0800838a:    4882        .H      LDR      r0,[pc,#520] ; [0x8008594] = 0x50000808
        0x0800838c:    f64012c4    @...    MOV      r2,#0x9c4
        0x08008390:    6803        .h      LDR      r3,[r0,#0]
        0x08008392:    f36f030b    o...    BFC      r3,#0,#12
        0x08008396:    431a        .C      ORRS     r2,r2,r3
        0x08008398:    6002        .`      STR      r2,[r0,#0]
        0x0800839a:    6848        Hh      LDR      r0,[r1,#4]
        0x0800839c:    f0400001    @...    ORR      r0,r0,#1
        0x080083a0:    6048        H`      STR      r0,[r1,#4]
        0x080083a2:    1d09        ..      ADDS     r1,r1,#4
        0x080083a4:    6808        .h      LDR      r0,[r1,#0]
        0x080083a6:    f0100f01    ....    TST      r0,#1
        0x080083aa:    d1fb        ..      BNE      0x80083a4 ; main + 5076
        0x080083ac:    487a        zH      LDR      r0,[pc,#488] ; [0x8008598] = 0x40010200
        0x080083ae:    6801        .h      LDR      r1,[r0,#0]
        0x080083b0:    f0410101    A...    ORR      r1,r1,#1
        0x080083b4:    6001        .`      STR      r1,[r0,#0]
        0x080083b6:    f04f42a0    O..B    MOV      r2,#0x50000000
        0x080083ba:    6890        .h      LDR      r0,[r2,#8]
        0x080083bc:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x080083c0:    f0204040     .@@    BIC      r0,r0,#0xc0000000
        0x080083c4:    f0404000    @..@    ORR      r0,r0,#0x80000000
        0x080083c8:    6090        .`      STR      r0,[r2,#8]
        0x080083ca:    6890        .h      LDR      r0,[r2,#8]
        0x080083cc:    0fc0        ..      LSRS     r0,r0,#31
        0x080083ce:    d1fc        ..      BNE      0x80083ca ; main + 5114
        0x080083d0:    4972        rI      LDR      r1,[pc,#456] ; [0x800859c] = 0x50000100
        0x080083d2:    6888        .h      LDR      r0,[r1,#8]
        0x080083d4:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x080083d8:    f0204040     .@@    BIC      r0,r0,#0xc0000000
        0x080083dc:    f0404000    @..@    ORR      r0,r0,#0x80000000
        0x080083e0:    6088        .`      STR      r0,[r1,#8]
        0x080083e2:    6888        .h      LDR      r0,[r1,#8]
        0x080083e4:    0fc0        ..      LSRS     r0,r0,#31
        0x080083e6:    d1fc        ..      BNE      0x80083e2 ; main + 5138
        0x080083e8:    6890        .h      LDR      r0,[r2,#8]
        0x080083ea:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x080083ee:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x080083f2:    f0400008    @...    ORR      r0,r0,#8
        0x080083f6:    6090        .`      STR      r0,[r2,#8]
        0x080083f8:    6850        Ph      LDR      r0,[r2,#4]
        0x080083fa:    f0400040    @.@.    ORR      r0,r0,#0x40
        0x080083fe:    6050        P`      STR      r0,[r2,#4]
        0x08008400:    6890        .h      LDR      r0,[r2,#8]
        0x08008402:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x08008406:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x0800840a:    f0400001    @...    ORR      r0,r0,#1
        0x0800840e:    6090        .`      STR      r0,[r2,#8]
        0x08008410:    6888        .h      LDR      r0,[r1,#8]
        0x08008412:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x08008416:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x0800841a:    f0400008    @...    ORR      r0,r0,#8
        0x0800841e:    6088        .`      STR      r0,[r1,#8]
        0x08008420:    6848        Hh      LDR      r0,[r1,#4]
        0x08008422:    f0400040    @.@.    ORR      r0,r0,#0x40
        0x08008426:    6048        H`      STR      r0,[r1,#4]
        0x08008428:    6888        .h      LDR      r0,[r1,#8]
        0x0800842a:    f020003f     .?.    BIC      r0,r0,#0x3f
        0x0800842e:    f0204000     ..@    BIC      r0,r0,#0x80000000
        0x08008432:    f0400001    @...    ORR      r0,r0,#1
        0x08008436:    6088        .`      STR      r0,[r1,#8]
        0x08008438:    4959        YI      LDR      r1,[pc,#356] ; [0x80085a0] = 0x40012c00
        0x0800843a:    2000        .       MOVS     r0,#0
        0x0800843c:    6348        Hc      STR      r0,[r1,#0x34]
        0x0800843e:    6388        .c      STR      r0,[r1,#0x38]
        0x08008440:    63c8        .c      STR      r0,[r1,#0x3c]
        0x08008442:    6c48        Hl      LDR      r0,[r1,#0x44]
        0x08008444:    f4405080    @..P    ORR      r0,r0,#0x1000
        0x08008448:    6448        Hd      STR      r0,[r1,#0x44]
        0x0800844a:    6c48        Hl      LDR      r0,[r1,#0x44]
        0x0800844c:    f4204000     ..@    BIC      r0,r0,#0x8000
        0x08008450:    6448        Hd      STR      r0,[r1,#0x44]
        0x08008452:    6a08        .j      LDR      r0,[r1,#0x20]
        0x08008454:    f0200001     ...    BIC      r0,r0,#1
        0x08008458:    6208        .b      STR      r0,[r1,#0x20]
        0x0800845a:    6a08        .j      LDR      r0,[r1,#0x20]
        0x0800845c:    f0200004     ...    BIC      r0,r0,#4
        0x08008460:    6208        .b      STR      r0,[r1,#0x20]
        0x08008462:    6a08        .j      LDR      r0,[r1,#0x20]
        0x08008464:    f0200010     ...    BIC      r0,r0,#0x10
        0x08008468:    6208        .b      STR      r0,[r1,#0x20]
        0x0800846a:    6a08        .j      LDR      r0,[r1,#0x20]
        0x0800846c:    f0200040     .@.    BIC      r0,r0,#0x40
        0x08008470:    6208        .b      STR      r0,[r1,#0x20]
        0x08008472:    6a08        .j      LDR      r0,[r1,#0x20]
        0x08008474:    f4207080     ..p    BIC      r0,r0,#0x100
        0x08008478:    6208        .b      STR      r0,[r1,#0x20]
        0x0800847a:    6a08        .j      LDR      r0,[r1,#0x20]
        0x0800847c:    f4206080     ..`    BIC      r0,r0,#0x400
        0x08008480:    6208        .b      STR      r0,[r1,#0x20]
        0x08008482:    6808        .h      LDR      r0,[r1,#0]
        0x08008484:    f0400001    @...    ORR      r0,r0,#1
        0x08008488:    6008        .`      STR      r0,[r1,#0]
        0x0800848a:    4846        FH      LDR      r0,[pc,#280] ; [0x80085a4] = 0x40000400
        0x0800848c:    6801        .h      LDR      r1,[r0,#0]
        0x0800848e:    f0410101    A...    ORR      r1,r1,#1
        0x08008492:    6001        .`      STR      r1,[r0,#0]
        0x08008494:    4844        DH      LDR      r0,[pc,#272] ; [0x80085a8] = 0x40005400
        0x08008496:    6841        Ah      LDR      r1,[r0,#4]
        0x08008498:    f4416180    A..a    ORR      r1,r1,#0x400
        0x0800849c:    6041        A`      STR      r1,[r0,#4]
        0x0800849e:    6841        Ah      LDR      r1,[r0,#4]
        0x080084a0:    f36f0109    o...    BFC      r1,#0,#10
        0x080084a4:    f0410190    A...    ORR      r1,r1,#0x90
        0x080084a8:    6041        A`      STR      r1,[r0,#4]
        0x080084aa:    6841        Ah      LDR      r1,[r0,#4]
        0x080084ac:    f421017f    !...    BIC      r1,r1,#0xff0000
        0x080084b0:    f4413100    A..1    ORR      r1,r1,#0x20000
        0x080084b4:    6041        A`      STR      r1,[r0,#4]
        0x080084b6:    6801        .h      LDR      r1,[r0,#0]
        0x080084b8:    f4414100    A..A    ORR      r1,r1,#0x8000
