ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x080084bc:    6001        .`      STR      r1,[r0,#0]
        0x080084be:    6801        .h      LDR      r1,[r0,#0]
        0x080084c0:    f0410101    A...    ORR      r1,r1,#1
        0x080084c4:    6001        .`      STR      r1,[r0,#0]
        0x080084c6:    f8983001    ...0    LDRB     r3,[r8,#1]
        0x080084ca:    f8dfc0ec    ....    LDR      r12,[pc,#236] ; [0x80085b8] = 0x40020408
        0x080084ce:    4937        7I      LDR      r1,[pc,#220] ; [0x80085ac] = 0x40020400
        0x080084d0:    4a37        7J      LDR      r2,[pc,#220] ; [0x80085b0] = 0x40005424
        0x080084d2:    4838        8H      LDR      r0,[pc,#224] ; [0x80085b4] = 0x20000000
        0x080084d4:    f843200c    C..     STR      r2,[r3,r12]
        0x080084d8:    f8982001    ...     LDRB     r2,[r8,#1]
        0x080084dc:    f10c0304    ....    ADD      r3,r12,#4
        0x080084e0:    50d0        .P      STR      r0,[r2,r3]
        0x080084e2:    f8982001    ...     LDRB     r2,[r8,#1]
        0x080084e6:    1d08        ..      ADDS     r0,r1,#4
        0x080084e8:    5812        .X      LDR      r2,[r2,r0]
        0x080084ea:    f8983001    ...0    LDRB     r3,[r8,#1]
        0x080084ee:    f36f020f    o...    BFC      r2,#0,#16
        0x080084f2:    f0420202    B...    ORR      r2,r2,#2
        0x080084f6:    501a        .P      STR      r2,[r3,r0]
        0x080084f8:    f8980001    ....    LDRB     r0,[r8,#1]
        0x080084fc:    5808        .X      LDR      r0,[r1,r0]
        0x080084fe:    f8982001    ...     LDRB     r2,[r8,#1]
        0x08008502:    f0400001    @...    ORR      r0,r0,#1
        0x08008506:    5088        .P      STR      r0,[r1,r2]
        0x08008508:    6820         h      LDR      r0,[r4,#0]
        0x0800850a:    f0400001    @...    ORR      r0,r0,#1
        0x0800850e:    6020         `      STR      r0,[r4,#0]
        0x08008510:    f04f20e0    O..     MOV      r0,#0xe000e000
        0x08008514:    6901        .i      LDR      r1,[r0,#0x10]
        0x08008516:    f0410102    A...    ORR      r1,r1,#2
        0x0800851a:    6101        .a      STR      r1,[r0,#0x10]
        0x0800851c:    e7fe        ..      B        0x800851c ; main + 5452
        0x0800851e:    9802        ..      LDR      r0,[sp,#8]
        0x08008520:    1e40        @.      SUBS     r0,r0,#1
        0x08008522:    9002        ..      STR      r0,[sp,#8]
        0x08008524:    d1fc        ..      BNE      0x8008520 ; main + 5456
        0x08008526:    f7febecf    ....    B        0x80072c8 ; main + 760
        0x0800852a:    9802        ..      LDR      r0,[sp,#8]
        0x0800852c:    1e40        @.      SUBS     r0,r0,#1
        0x0800852e:    9002        ..      STR      r0,[sp,#8]
        0x08008530:    d1fc        ..      BNE      0x800852c ; main + 5468
        0x08008532:    f7febf22    ..".    B        0x800737a ; main + 938
        0x08008536:    9807        ..      LDR      r0,[sp,#0x1c]
        0x08008538:    1e40        @.      SUBS     r0,r0,#1
        0x0800853a:    9007        ..      STR      r0,[sp,#0x1c]
        0x0800853c:    d1fc        ..      BNE      0x8008538 ; main + 5480
        0x0800853e:    f7febf94    ....    B        0x800746a ; main + 1178
        0x08008542:    980d        ..      LDR      r0,[sp,#0x34]
        0x08008544:    1e40        @.      SUBS     r0,r0,#1
        0x08008546:    900d        ..      STR      r0,[sp,#0x34]
        0x08008548:    d1fc        ..      BNE      0x8008544 ; main + 5492
        0x0800854a:    f7febfe1    ....    B        0x8007510 ; main + 1344
        0x0800854e:    1e40        @.      SUBS     r0,r0,#1
        0x08008550:    d1fd        ..      BNE      0x800854e ; main + 5502
        0x08008552:    f7ffb919    ....    B        0x8007788 ; main + 1976
    $d
        0x08008556:    0000        ..      DCW    0
        0x08008558:    40004400    .D.@    DCD    1073759232
        0x0800855c:    40014400    .D.@    DCD    1073824768
        0x08008560:    40022000    . .@    DCD    1073881088
        0x08008564:    45670123    #.gE    DCD    1164378403
        0x08008568:    cdef89ab    ....    DCD    3455027627
        0x0800856c:    08192a3b    ;*..    DCD    135866939
        0x08008570:    4c5d6e7f    .n]L    DCD    1281191551
        0x08008574:    40020c00    ...@    DCD    1073875968
        0x08008578:    ff87f800    ....    DCD    4287100928
        0x0800857c:    20000140    @..     DCD    536871232
        0x08008580:    50001000    ...P    DCD    1342181376
        0x08008584:    50001008    ...P    DCD    1342181384
        0x08008588:    50001014    ...P    DCD    1342181396
        0x0800858c:    40010204    ...@    DCD    1073807876
        0x08008590:    50000800    ...P    DCD    1342179328
        0x08008594:    50000808    ...P    DCD    1342179336
        0x08008598:    40010200    ...@    DCD    1073807872
        0x0800859c:    50000100    ...P    DCD    1342177536
        0x080085a0:    40012c00    .,.@    DCD    1073818624
        0x080085a4:    40000400    ...@    DCD    1073742848
        0x080085a8:    40005400    .T.@    DCD    1073763328
        0x080085ac:    40020400    ...@    DCD    1073873920
        0x080085b0:    40005424    $T.@    DCD    1073763364
        0x080085b4:    20000000    ...     DCD    536870912
        0x080085b8:    40020408    ...@    DCD    1073873928
    $t
    i.reset_All
    reset_All
        0x080085bc:    48ba        .H      LDR      r0,[pc,#744] ; [0x80088a8] = 0x20000068
        0x080085be:    b500        ..      PUSH     {lr}
        0x080085c0:    2200        ."      MOVS     r2,#0
        0x080085c2:    f8802020    ..      STRB     r2,[r0,#0x20]
        0x080085c6:    7242        Br      STRB     r2,[r0,#9]
        0x080085c8:    21ff        .!      MOVS     r1,#0xff
        0x080085ca:    7201        .r      STRB     r1,[r0,#8]
        0x080085cc:    60c2        .`      STR      r2,[r0,#0xc]
        0x080085ce:    6002        .`      STR      r2,[r0,#0]
        0x080085d0:    6042        B`      STR      r2,[r0,#4]
        0x080085d2:    7402        .t      STRB     r2,[r0,#0x10]
        0x080085d4:    7442        Bt      STRB     r2,[r0,#0x11]
        0x080085d6:    ed9f0ab5    ....    VLDR     s0,[pc,#724] ; [0x80088ac] = 0x3a83126f
        0x080085da:    ed800a05    ....    VSTR     s0,[r0,#0x14]
        0x080085de:    eddf0ab4    ....    VLDR     s1,[pc,#720] ; [0x80088b0] = 0x38d1b717
        0x080085e2:    edc00a06    ....    VSTR     s1,[r0,#0x18]
        0x080085e6:    eddf0ab3    ....    VLDR     s1,[pc,#716] ; [0x80088b4] = 0x31ca1db9
        0x080085ea:    edc00a07    ....    VSTR     s1,[r0,#0x1c]
        0x080085ee:    eddf0ab2    ....    VLDR     s1,[pc,#712] ; [0x80088b8] = 0x4d221fe8
        0x080085f2:    48b2        .H      LDR      r0,[pc,#712] ; [0x80088bc] = 0x2000063c
        0x080085f4:    f2421133    B.3.    MOV      r1,#0x2133
        0x080085f8:    edc00a06    ....    VSTR     s1,[r0,#0x18]
        0x080085fc:    eddf0ab0    ....    VLDR     s1,[pc,#704] ; [0x80088c0] = 0x42100000
        0x08008600:    61c1        .a      STR      r1,[r0,#0x1c]
        0x08008602:    edc00a00    ....    VSTR     s1,[r0,#0]
        0x08008606:    eddf0aaf    ....    VLDR     s1,[pc,#700] ; [0x80088c4] = 0x41a646e2
        0x0800860a:    edc00a01    ....    VSTR     s1,[r0,#4]
        0x0800860e:    eddf1aae    ....    VLDR     s3,[pc,#696] ; [0x80088c8] = 0
        0x08008612:    edc01a04    ....    VSTR     s3,[r0,#0x10]
        0x08008616:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x0800861a:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x0800861e:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x08008622:    8402        ..      STRH     r2,[r0,#0x20]
        0x08008624:    8442        B.      STRH     r2,[r0,#0x22]
        0x08008626:    8482        ..      STRH     r2,[r0,#0x24]
        0x08008628:    f8802026    ..&     STRB     r2,[r0,#0x26]
        0x0800862c:    eddf0aa7    ....    VLDR     s1,[pc,#668] ; [0x80088cc] = 0x3c426c69
        0x08008630:    3028        (0      ADDS     r0,r0,#0x28
        0x08008632:    edc00a06    ....    VSTR     s1,[r0,#0x18]
        0x08008636:    eddf0aa6    ....    VLDR     s1,[pc,#664] ; [0x80088d0] = 0x358637bd
        0x0800863a:    2104        .!      MOVS     r1,#4
        0x0800863c:    edc00a05    ....    VSTR     s1,[r0,#0x14]
        0x08008640:    ed800a01    ....    VSTR     s0,[r0,#4]
        0x08008644:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x08008648:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x0800864c:    7001        .p      STRB     r1,[r0,#0]
        0x0800864e:    eeb50a08    ....    VMOV.F32 s0,#0.37500000
        0x08008652:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08008656:    3048        H0      ADDS     r0,r0,#0x48
        0x08008658:    edc01a08    ....    VSTR     s3,[r0,#0x20]
        0x0800865c:    edc01a07    ....    VSTR     s3,[r0,#0x1c]
        0x08008660:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x08008664:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08008668:    edc01a01    ....    VSTR     s3,[r0,#4]
        0x0800866c:    edc01a06    ....    VSTR     s3,[r0,#0x18]
        0x08008670:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x08008674:    edc01a04    ....    VSTR     s3,[r0,#0x10]
        0x08008678:    edc01a09    ....    VSTR     s3,[r0,#0x24]
        0x0800867c:    edc01a0a    ....    VSTR     s3,[r0,#0x28]
        0x08008680:    edc01a0b    ....    VSTR     s3,[r0,#0x2c]
        0x08008684:    edc01a0c    ....    VSTR     s3,[r0,#0x30]
        0x08008688:    edc01a0d    ....    VSTR     s3,[r0,#0x34]
        0x0800868c:    edc01a0e    ....    VSTR     s3,[r0,#0x38]
        0x08008690:    edc01a0f    ....    VSTR     s3,[r0,#0x3c]
        0x08008694:    edc01a10    ....    VSTR     s3,[r0,#0x40]
        0x08008698:    edc01a12    ....    VSTR     s3,[r0,#0x48]
        0x0800869c:    edc01a11    ....    VSTR     s3,[r0,#0x44]
        0x080086a0:    edc01a14    ....    VSTR     s3,[r0,#0x50]
        0x080086a4:    edc01a13    ....    VSTR     s3,[r0,#0x4c]
        0x080086a8:    ed9f0a8a    ....    VLDR     s0,[pc,#552] ; [0x80088d4] = 0x3e4ccccd
        0x080086ac:    3054        T0      ADDS     r0,r0,#0x54
        0x080086ae:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x080086b2:    edc01a0c    ....    VSTR     s3,[r0,#0x30]
        0x080086b6:    edc01a0d    ....    VSTR     s3,[r0,#0x34]
        0x080086ba:    edc01a0b    ....    VSTR     s3,[r0,#0x2c]
        0x080086be:    edc01a01    ....    VSTR     s3,[r0,#4]
        0x080086c2:    eeb70a00    ....    VMOV.F32 s0,#1.00000000
        0x080086c6:    ed800a02    ....    VSTR     s0,[r0,#8]
        0x080086ca:    edc01a08    ....    VSTR     s3,[r0,#0x20]
        0x080086ce:    edc01a07    ....    VSTR     s3,[r0,#0x1c]
        0x080086d2:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x080086d6:    edc01a04    ....    VSTR     s3,[r0,#0x10]
        0x080086da:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x080086de:    edc01a06    ....    VSTR     s3,[r0,#0x18]
        0x080086e2:    edc01a0e    ....    VSTR     s3,[r0,#0x38]
        0x080086e6:    eddf0a7c    ..|.    VLDR     s1,[pc,#496] ; [0x80088d8] = 0x447a0000
        0x080086ea:    edc00a0f    ....    VSTR     s1,[r0,#0x3c]
        0x080086ee:    edc01a11    ....    VSTR     s3,[r0,#0x44]
        0x080086f2:    edc01a10    ....    VSTR     s3,[r0,#0x40]
        0x080086f6:    edc01a0a    ....    VSTR     s3,[r0,#0x28]
        0x080086fa:    edc01a09    ....    VSTR     s3,[r0,#0x24]
        0x080086fe:    eddf0a77    ..w.    VLDR     s1,[pc,#476] ; [0x80088dc] = 0x43c80000
        0x08008702:    edc00a12    ....    VSTR     s1,[r0,#0x48]
        0x08008706:    eddf0a76    ..v.    VLDR     s1,[pc,#472] ; [0x80088e0] = 0x3dcccccd
        0x0800870a:    edc00a13    ....    VSTR     s1,[r0,#0x4c]
        0x0800870e:    ed800a14    ....    VSTR     s0,[r0,#0x50]
        0x08008712:    3054        T0      ADDS     r0,r0,#0x54
        0x08008714:    edc01a13    ....    VSTR     s3,[r0,#0x4c]
        0x08008718:    edc01a14    ....    VSTR     s3,[r0,#0x50]
        0x0800871c:    eddf0a70    ..p.    VLDR     s1,[pc,#448] ; [0x80088e0] = 0x3dcccccd
        0x08008720:    4970        pI      LDR      r1,[pc,#448] ; [0x80088e4] = 0x20000754
        0x08008722:    edc00a0e    ....    VSTR     s1,[r0,#0x38]
        0x08008726:    2001        .       MOVS     r0,#1
        0x08008728:    f8810058    ..X.    STRB     r0,[r1,#0x58]
        0x0800872c:    4608        .F      MOV      r0,r1
        0x0800872e:    edc01a0a    ....    VSTR     s3,[r0,#0x28]
        0x08008732:    edc01a0b    ....    VSTR     s3,[r0,#0x2c]
        0x08008736:    edc01a08    ....    VSTR     s3,[r0,#0x20]
        0x0800873a:    edc01a09    ....    VSTR     s3,[r0,#0x24]
        0x0800873e:    edc01a04    ....    VSTR     s3,[r0,#0x10]
        0x08008742:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x08008746:    edc01a0c    ....    VSTR     s3,[r0,#0x30]
        0x0800874a:    edc01a0d    ....    VSTR     s3,[r0,#0x34]
        0x0800874e:    edc01a15    ....    VSTR     s3,[r0,#0x54]
        0x08008752:    edc01a0f    ....    VSTR     s3,[r0,#0x3c]
        0x08008756:    edc01a10    ....    VSTR     s3,[r0,#0x40]
        0x0800875a:    edc01a07    ....    VSTR     s3,[r0,#0x1c]
        0x0800875e:    edc01a06    ....    VSTR     s3,[r0,#0x18]
        0x08008762:    eddf0a5f    .._.    VLDR     s1,[pc,#380] ; [0x80088e0] = 0x3dcccccd
        0x08008766:    eeb12a00    ...*    VMOV.F32 s4,#4.00000000
        0x0800876a:    edc00a11    ....    VSTR     s1,[r0,#0x44]
        0x0800876e:    ed800a12    ....    VSTR     s0,[r0,#0x48]
        0x08008772:    edc01a01    ....    VSTR     s3,[r0,#4]
        0x08008776:    edc01a00    ....    VSTR     s3,[r0,#0]
        0x0800877a:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x0800877e:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08008782:    305c        \0      ADDS     r0,r0,#0x5c
        0x08008784:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x08008788:    3014        .0      ADDS     r0,r0,#0x14
        0x0800878a:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x0800878e:    3014        .0      ADDS     r0,r0,#0x14
        0x08008790:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x08008794:    edc01a00    ....    VSTR     s3,[r0,#0]
        0x08008798:    3014        .0      ADDS     r0,r0,#0x14
        0x0800879a:    ed802a00    ...*    VSTR     s4,[r0,#0]
        0x0800879e:    ed802a01    ...*    VSTR     s4,[r0,#4]
        0x080087a2:    eddf0a51    ..Q.    VLDR     s1,[pc,#324] ; [0x80088e8] = 0x3cf5c28f
        0x080087a6:    edc00a03    ....    VSTR     s1,[r0,#0xc]
        0x080087aa:    eddf0a50    ..P.    VLDR     s1,[pc,#320] ; [0x80088ec] = 0xbcf5c28f
        0x080087ae:    2105        .!      MOVS     r1,#5
        0x080087b0:    edc00a04    ....    VSTR     s1,[r0,#0x10]
        0x080087b4:    6281        .b      STR      r1,[r0,#0x28]
        0x080087b6:    f8802030    ..0     STRB     r2,[r0,#0x30]
        0x080087ba:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x080087be:    edc01a06    ....    VSTR     s3,[r0,#0x18]
        0x080087c2:    edc01a0b    ....    VSTR     s3,[r0,#0x2c]
        0x080087c6:    6242        Bb      STR      r2,[r0,#0x24]
        0x080087c8:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080087cc:    2114        .!      MOVS     r1,#0x14
        0x080087ce:    e9c02107    ...!    STRD     r2,r1,[r0,#0x1c]
        0x080087d2:    eddf0a47    ..G.    VLDR     s1,[pc,#284] ; [0x80088f0] = 0x3e99999a
        0x080087d6:    3034        40      ADDS     r0,r0,#0x34
        0x080087d8:    edc00a01    ....    VSTR     s1,[r0,#4]
        0x080087dc:    eddf0a45    ..E.    VLDR     s1,[pc,#276] ; [0x80088f4] = 0x43480000
        0x080087e0:    edc00a00    ....    VSTR     s1,[r0,#0]
        0x080087e4:    edc01a10    ....    VSTR     s3,[r0,#0x40]
        0x080087e8:    edc01a0f    ....    VSTR     s3,[r0,#0x3c]
        0x080087ec:    eddf0a42    ..B.    VLDR     s1,[pc,#264] ; [0x80088f8] = 0xbed0ecfa
        0x080087f0:    edc00a04    ....    VSTR     s1,[r0,#0x10]
        0x080087f4:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x080087f8:    3044        D0      ADDS     r0,r0,#0x44
        0x080087fa:    edc01a07    ....    VSTR     s3,[r0,#0x1c]
        0x080087fe:    edc01a0c    ....    VSTR     s3,[r0,#0x30]
        0x08008802:    edc01a0b    ....    VSTR     s3,[r0,#0x2c]
        0x08008806:    ed9f0a3d    ..=.    VLDR     s0,[pc,#244] ; [0x80088fc] = 0x40666666
        0x0800880a:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x0800880e:    ed9f0a3c    ..<.    VLDR     s0,[pc,#240] ; [0x8008900] = 0xc0666666
        0x08008812:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x08008816:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x0800881a:    edc01a06    ....    VSTR     s3,[r0,#0x18]
        0x0800881e:    f8802034    ..4     STRB     r2,[r0,#0x34]
        0x08008822:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x08008826:    edc01a01    ....    VSTR     s3,[r0,#4]
        0x0800882a:    e9c01208    ....    STRD     r1,r2,[r0,#0x20]
        0x0800882e:    7002        .p      STRB     r2,[r0,#0]
        0x08008830:    6282        .b      STR      r2,[r0,#0x28]
        0x08008832:    3038        80      ADDS     r0,r0,#0x38
        0x08008834:    ed9f0a33    ..3.    VLDR     s0,[pc,#204] ; [0x8008904] = 0x481c4000
        0x08008838:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x0800883c:    edc01a01    ....    VSTR     s3,[r0,#4]
        0x08008840:    edc01a04    ....    VSTR     s3,[r0,#0x10]
        0x08008844:    edc01a03    ....    VSTR     s3,[r0,#0xc]
        0x08008848:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x0800884c:    ed9f0a2e    ....    VLDR     s0,[pc,#184] ; [0x8008908] = 0x44fa0000
        0x08008850:    ed800a08    ....    VSTR     s0,[r0,#0x20]
        0x08008854:    ed9f0a2d    ..-.    VLDR     s0,[pc,#180] ; [0x800890c] = 0x459c4000
        0x08008858:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x0800885c:    edc01a0b    ....    VSTR     s3,[r0,#0x2c]
        0x08008860:    edc01a0a    ....    VSTR     s3,[r0,#0x28]
        0x08008864:    edc01a0c    ....    VSTR     s3,[r0,#0x30]
        0x08008868:    edc01a0d    ....    VSTR     s3,[r0,#0x34]
        0x0800886c:    edc01a05    ....    VSTR     s3,[r0,#0x14]
        0x08008870:    edc01a06    ....    VSTR     s3,[r0,#0x18]
        0x08008874:    f000f862    ..b.    BL       reset_IncABZHandler ; 0x800893c
        0x08008878:    4826        &H      LDR      r0,[pc,#152] ; [0x8008914] = 0x200008d4
        0x0800887a:    ed9f0a25    ..%.    VLDR     s0,[pc,#148] ; [0x8008910] = 0x451d1463
        0x0800887e:    f44f717a    O.zq    MOV      r1,#0x3e8
        0x08008882:    ed800a00    ....    VSTR     s0,[r0,#0]
        0x08008886:    6101        .a      STR      r1,[r0,#0x10]
        0x08008888:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x0800888c:    edc01a01    ....    VSTR     s3,[r0,#4]
        0x08008890:    ed802a03    ...*    VSTR     s4,[r0,#0xc]
        0x08008894:    4821        !H      LDR      r0,[pc,#132] ; [0x800891c] = 0x20000060
        0x08008896:    ed9f0a20    .. .    VLDR     s0,[pc,#128] ; [0x8008918] = 0xc04f4c78
        0x0800889a:    6840        @h      LDR      r0,[r0,#4]
        0x0800889c:    ed800a01    ....    VSTR     s0,[r0,#4]
        0x080088a0:    8002        ..      STRH     r2,[r0,#0]
        0x080088a2:    edc01a02    ....    VSTR     s3,[r0,#8]
        0x080088a6:    bd00        ..      POP      {pc}
    $d
        0x080088a8:    20000068    h..     DCD    536871016
        0x080088ac:    3a83126f    o..:    DCD    981668463
        0x080088b0:    38d1b717    ...8    DCD    953267991
        0x080088b4:    31ca1db9    ...1    DCD    835329465
        0x080088b8:    4d221fe8    .."M    DCD    1294082024
        0x080088bc:    2000063c    <..     DCD    536872508
        0x080088c0:    42100000    ...B    DCD    1108344832
        0x080088c4:    41a646e2    .F.A    DCD    1101416162
        0x080088c8:    00000000    ....    DCD    0
        0x080088cc:    3c426c69    ilB<    DCD    1010986089
        0x080088d0:    358637bd    .7.5    DCD    897988541
        0x080088d4:    3e4ccccd    ..L>    DCD    1045220557
        0x080088d8:    447a0000    ..zD    DCD    1148846080
        0x080088dc:    43c80000    ...C    DCD    1137180672
        0x080088e0:    3dcccccd    ...=    DCD    1036831949
        0x080088e4:    20000754    T..     DCD    536872788
        0x080088e8:    3cf5c28f    ...<    DCD    1022739087
        0x080088ec:    bcf5c28f    ....    DCD    3170222735
        0x080088f0:    3e99999a    ...>    DCD    1050253722
        0x080088f4:    43480000    ..HC    DCD    1128792064
        0x080088f8:    bed0ecfa    ....    DCD    3201363194
        0x080088fc:    40666666    fff@    DCD    1080452710
        0x08008900:    c0666666    fff.    DCD    3227936358
        0x08008904:    481c4000    .@.H    DCD    1209810944
        0x08008908:    44fa0000    ...D    DCD    1157234688
        0x0800890c:    459c4000    .@.E    DCD    1167867904
        0x08008910:    451d1463    c..E    DCD    1159533667
        0x08008914:    200008d4    ...     DCD    536873172
        0x08008918:    c04f4c78    xLO.    DCD    3226422392
        0x0800891c:    20000060    `..     DCD    536871008
    $t
    i.reset_CurrentPICHandler
    reset_CurrentPICHandler
        0x08008920:    4805        .H      LDR      r0,[pc,#20] ; [0x8008938] = 0x200007b0
        0x08008922:    ed9f0a04    ....    VLDR     s0,[pc,#16] ; [0x8008934] = 0
        0x08008926:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x0800892a:    3014        .0      ADDS     r0,r0,#0x14
        0x0800892c:    ed800a03    ....    VSTR     s0,[r0,#0xc]
        0x08008930:    4770        pG      BX       lr
    $d
        0x08008932:    0000        ..      DCW    0
        0x08008934:    00000000    ....    DCD    0
        0x08008938:    200007b0    ...     DCD    536872880
    $t
    i.reset_IncABZHandler
    reset_IncABZHandler
        0x0800893c:    481a        .H      LDR      r0,[pc,#104] ; [0x80089a8] = 0x20000680
        0x0800893e:    2100        .!      MOVS     r1,#0
        0x08008940:    ed9f0a1a    ....    VLDR     s0,[pc,#104] ; [0x80089ac] = 0x461c4000
        0x08008944:    7001        .p      STRB     r1,[r0,#0]
        0x08008946:    7041        Ap      STRB     r1,[r0,#1]
        0x08008948:    7081        .p      STRB     r1,[r0,#2]
        0x0800894a:    6141        Aa      STR      r1,[r0,#0x14]
        0x0800894c:    6181        .a      STR      r1,[r0,#0x18]
        0x0800894e:    2104        .!      MOVS     r1,#4
        0x08008950:    70c1        .p      STRB     r1,[r0,#3]
        0x08008952:    f64011c4    @...    MOV      r1,#0x9c4
        0x08008956:    6081        .`      STR      r1,[r0,#8]
        0x08008958:    0089        ..      LSLS     r1,r1,#2
        0x0800895a:    6041        A`      STR      r1,[r0,#4]
        0x0800895c:    4914        .I      LDR      r1,[pc,#80] ; [0x80089b0] = 0x20000060
        0x0800895e:    6809        .h      LDR      r1,[r1,#0]
        0x08008960:    edd10a05    ....    VLDR     s1,[r1,#0x14]
        0x08008964:    ee200a20     . .    VMUL.F32 s0,s0,s1
        0x08008968:    eddf0a12    ....    VLDR     s1,[pc,#72] ; [0x80089b4] = 0x41c90fdb
        0x0800896c:    ee801a80    ....    VDIV.F32 s2,s1,s0
        0x08008970:    ed9f0a11    ....    VLDR     s0,[pc,#68] ; [0x80089b8] = 0x449c4000
        0x08008974:    eddf0a13    ....    VLDR     s1,[pc,#76] ; [0x80089c4] = 0x433c7edd
        0x08008978:    ed801a03    ....    VSTR     s2,[r0,#0xc]
