ToTheBestHeLuo/FOC/MDK-ARM/stm32g431rbt6_advanced/stm32g431rbt6_advanced.asm
        0x0800897c:    ed800a04    ....    VSTR     s0,[r0,#0x10]
        0x08008980:    ed9f0a0e    ....    VLDR     s0,[pc,#56] ; [0x80089bc] = 0
        0x08008984:    ed800a07    ....    VSTR     s0,[r0,#0x1c]
        0x08008988:    ed9f0a0d    ....    VLDR     s0,[pc,#52] ; [0x80089c0] = 0x42fb53d2
        0x0800898c:    ed800a09    ....    VSTR     s0,[r0,#0x24]
        0x08008990:    eeb50ac0    ....    VCMPE.F32 s0,#0.0
        0x08008994:    edc00a0a    ....    VSTR     s1,[r0,#0x28]
        0x08008998:    eef1fa10    ....    VMRS     APSR_nzcv,FPSCR
        0x0800899c:    bf3c        <.      ITT      CC
        0x0800899e:    ed9f0a0a    ....    VLDRCC   s0,[pc,#40] ; [0x80089c8] = 0xc2fb53d2
        0x080089a2:    ed800a09    ....    VSTRCC   s0,[r0,#0x24]
        0x080089a6:    4770        pG      BX       lr
    $d
        0x080089a8:    20000680    ...     DCD    536872576
        0x080089ac:    461c4000    .@.F    DCD    1176256512
        0x080089b0:    20000060    `..     DCD    536871008
        0x080089b4:    41c90fdb    ...A    DCD    1103695835
        0x080089b8:    449c4000    .@.D    DCD    1151090688
        0x080089bc:    00000000    ....    DCD    0
        0x080089c0:    42fb53d2    .S.B    DCD    1123767250
        0x080089c4:    433c7edd    .~<C    DCD    1128038109
        0x080089c8:    c2fb53d2    .S..    DCD    3271250898
    $t
    x$fpl$fpinit
    $v0
    _fp_init
        0x080089cc:    f04f7040    O.@p    MOV      r0,#0x3000000
        0x080089d0:    eee10a10    ....    VMSR     FPSCR,r0
    __fplib_config_fpu_vfp
    __fplib_config_pureend_doubles
        0x080089d4:    4770        pG      BX       lr
    $d.realdata
    .constdata
    CHANNEL_OFFSET_TAB
        0x080089d6:    1c08        ..      DCW    7176
        0x080089d8:    6c584430    0DXl    DCD    1817723952
    OFFSET_TAB_CCMRx
        0x080089dc:    00000000    ....    DCD    0
        0x080089e0:    04040404    ....    DCD    67372036
        0x080089e4:    3838        88      DCW    14392
    SHIFT_TAB_OCxx
        0x080089e6:    0000        ..      DCW    0
        0x080089e8:    00000008    ....    DCD    8
        0x080089ec:    08000008    ....    DCD    134217736
    SHIFT_TAB_ICxx
        0x080089f0:    00080000    ....    DCD    524288
        0x080089f4:    00080000    ....    DCD    524288
        0x080089f8:    0000        ..      DCW    0
    SHIFT_TAB_CCxP
        0x080089fa:    0200        ..      DCW    512
        0x080089fc:    0a080604    ....    DCD    168297988
        0x08008a00:    14100e0c    ....    DCD    336596492
    .constdata
    AHBPrescTable
        0x08008a04:    00000000    ....    DCD    0
        0x08008a08:    00000000    ....    DCD    0
        0x08008a0c:    04030201    ....    DCD    67305985
        0x08008a10:    09080706    ....    DCD    151521030
    .constdata
    APBPrescTable
        0x08008a14:    00000000    ....    DCD    0
        0x08008a18:    04030201    ....    DCD    67305985
    .constdata
    tableData_c
        0x08008a1c:    00000000    ....    DCD    0
        0x08008a20:    3a2441d0    .A$:    DCD    975454672
        0x08008a24:    3aa44129    )A.:    DCD    983843113
        0x08008a28:    3af6601c    .`.:    DCD    989224988
        0x08008a2c:    3b243e8e    .>$;    DCD    992231054
        0x08008a30:    3b4d4bc0    .KM;    DCD    994921408
        0x08008a34:    3b765751    QWv;    DCD    997611345
        0x08008a38:    3b8fb077    w..;    DCD    999272567
        0x08008a3c:    3ba43422    "4.;    DCD    1000616994
        0x08008a40:    3bb8b680    ...;    DCD    1001961088
        0x08008a44:    3bcd3768    h7.;    DCD    1003304808
        0x08008a48:    3be1b6af    ...;    DCD    1004648111
        0x08008a4c:    3bf6342e    .4.;    DCD    1005990958
        0x08008a50:    3c0557dd    .W.<    DCD    1006983133
        0x08008a54:    3c0f9495    ...<    DCD    1007654037
        0x08008a58:    3c19d02c    ,..<    DCD    1008324652
        0x08008a5c:    3c240a8b    ..$<    DCD    1008994955
        0x08008a60:    3c2e439f    .C.<    DCD    1009664927
        0x08008a64:    3c387b54    T{8<    DCD    1010334548
        0x08008a68:    3c42b196    ..B<    DCD    1011003798
        0x08008a6c:    3c4ce64f    O.L<    DCD    1011672655
        0x08008a70:    3c57196d    m.W<    DCD    1012341101
        0x08008a74:    3c614ada    .Ja<    DCD    1013009114
        0x08008a78:    3c6b7a83    .zk<    DCD    1013676675
        0x08008a7c:    3c75a855    U.u<    DCD    1014343765
        0x08008a80:    3c7fd43b    ;..<    DCD    1015010363
        0x08008a84:    3c84ff10    ...<    DCD    1015349008
        0x08008a88:    3c8a12fa    ...<    DCD    1015681786
        0x08008a8c:    3c8f25d0    .%.<    DCD    1016014288
        0x08008a90:    3c943789    .7.<    DCD    1016346505
        0x08008a94:    3c99481c    .H.<    DCD    1016678428
        0x08008a98:    3c9e577e    ~W.<    DCD    1017010046
        0x08008a9c:    3ca365a7    .e.<    DCD    1017341351
        0x08008aa0:    3ca8728c    .r.<    DCD    1017672332
        0x08008aa4:    3cad7e24    $~.<    DCD    1018002980
        0x08008aa8:    3cb28866    f..<    DCD    1018333286
        0x08008aac:    3cb79149    I..<    DCD    1018663241
        0x08008ab0:    3cbc98c2    ...<    DCD    1018992834
        0x08008ab4:    3cc19eca    ...<    DCD    1019322058
        0x08008ab8:    3cc6a357    W..<    DCD    1019650903
        0x08008abc:    3ccba65f    _..<    DCD    1019979359
        0x08008ac0:    3cd0a7db    ...<    DCD    1020307419
        0x08008ac4:    3cd5a7c0    ...<    DCD    1020635072
        0x08008ac8:    3cdaa606    ...<    DCD    1020962310
        0x08008acc:    3cdfa2a4    ...<    DCD    1021289124
        0x08008ad0:    3ce49d92    ...<    DCD    1021615506
        0x08008ad4:    3ce996c7    ...<    DCD    1021941447
        0x08008ad8:    3cee8e3a    :..<    DCD    1022266938
        0x08008adc:    3cf383e3    ...<    DCD    1022591971
        0x08008ae0:    3cf877b9    .w.<    DCD    1022916537
        0x08008ae4:    3cfd69b4    .i.<    DCD    1023240628
        0x08008ae8:    3d012ce6    .,.=    DCD    1023487206
        0x08008aec:    3d03a3fc    ...=    DCD    1023648764
        0x08008af0:    3d061a19    ...=    DCD    1023810073
        0x08008af4:    3d088f38    8..=    DCD    1023971128
        0x08008af8:    3d0b0355    U..=    DCD    1024131925
        0x08008afc:    3d0d766c    lv.=    DCD    1024292460
        0x08008b00:    3d0fe87a    z..=    DCD    1024452730
        0x08008b04:    3d12597a    zY.=    DCD    1024612730
        0x08008b08:    3d14c96a    j..=    DCD    1024772458
        0x08008b0c:    3d173844    D8.=    DCD    1024931908
        0x08008b10:    3d19a605    ...=    DCD    1025091077
        0x08008b14:    3d1c12ab    ...=    DCD    1025249963
        0x08008b18:    3d1e7e30    0~.=    DCD    1025408560
        0x08008b1c:    3d20e892    .. =    DCD    1025566866
        0x08008b20:    3d2351cd    .Q#=    DCD    1025724877
        0x08008b24:    3d25b9dd    ..%=    DCD    1025882589
        0x08008b28:    3d2820bf    . (=    DCD    1026039999
        0x08008b2c:    3d2a8670    p.*=    DCD    1026197104
        0x08008b30:    3d2ceaec    ..,=    DCD    1026353900
        0x08008b34:    3d2f4e31    1N/=    DCD    1026510385
        0x08008b38:    3d31b039    9.1=    DCD    1026666553
        0x08008b3c:    3d341104    ..4=    DCD    1026822404
        0x08008b40:    3d36708d    .p6=    DCD    1026977933
        0x08008b44:    3d38ced0    ..8=    DCD    1027133136
        0x08008b48:    3d3b2bcd    .+;=    DCD    1027288013
        0x08008b4c:    3d3d877e    ~.==    DCD    1027442558
        0x08008b50:    3d3fe1e1    ..?=    DCD    1027596769
        0x08008b54:    3d423af4    .:B=    DCD    1027750644
        0x08008b58:    3d4492b3    ..D=    DCD    1027904179
        0x08008b5c:    3d46e91c    ..F=    DCD    1028057372
        0x08008b60:    3d493e2b    +>I=    DCD    1028210219
        0x08008b64:    3d4b91df    ..K=    DCD    1028362719
        0x08008b68:    3d4de433    3.M=    DCD    1028514867
        0x08008b6c:    3d503527    '5P=    DCD    1028666663
        0x08008b70:    3d5284b6    ..R=    DCD    1028818102
        0x08008b74:    3d54d2df    ..T=    DCD    1028969183
        0x08008b78:    3d571fa0    ..W=    DCD    1029119904
        0x08008b7c:    3d596af4    .jY=    DCD    1029270260
        0x08008b80:    3d5bb4dc    ..[=    DCD    1029420252
        0x08008b84:    3d5dfd53    S.]=    DCD    1029569875
        0x08008b88:    3d604457    WD`=    DCD    1029719127
        0x08008b8c:    3d6289e7    ..b=    DCD    1029868007
        0x08008b90:    3d64ce00    ..d=    DCD    1030016512
        0x08008b94:    3d6710a0    ..g=    DCD    1030164640
        0x08008b98:    3d6951c5    .Qi=    DCD    1030312389
        0x08008b9c:    3d6b916c    l.k=    DCD    1030459756
        0x08008ba0:    3d6dcf94    ..m=    DCD    1030606740
        0x08008ba4:    3d700c3b    ;.p=    DCD    1030753339
        0x08008ba8:    3d72475f    _Gr=    DCD    1030899551
        0x08008bac:    3d7480fe    ..t=    DCD    1031045374
        0x08008bb0:    3d76b916    ..v=    DCD    1031190806
        0x08008bb4:    3d78efa6    ..x=    DCD    1031335846
        0x08008bb8:    3d7b24ab    .${=    DCD    1031480491
        0x08008bbc:    3d7d5824    $X}=    DCD    1031624740
        0x08008bc0:    3d7f8a0f    ...=    DCD    1031768591
        0x08008bc4:    3d80dd35    5..=    DCD    1031855413
        0x08008bc8:    3d81f49b    ...=    DCD    1031926939
        0x08008bcc:    3d830b37    7..=    DCD    1031998263
        0x08008bd0:    3d842109    .!.=    DCD    1032069385
        0x08008bd4:    3d853611    .6.=    DCD    1032140305
        0x08008bd8:    3d864a4d    MJ.=    DCD    1032211021
        0x08008bdc:    3d875dbe    .].=    DCD    1032281534
        0x08008be0:    3d887061    ap.=    DCD    1032351841
        0x08008be4:    3d898238    8..=    DCD    1032421944
        0x08008be8:    3d8a9340    @..=    DCD    1032491840
        0x08008bec:    3d8ba37a    z..=    DCD    1032561530
        0x08008bf0:    3d8cb2e5    ...=    DCD    1032631013
        0x08008bf4:    3d8dc180    ...=    DCD    1032700288
        0x08008bf8:    3d8ecf4b    K..=    DCD    1032769355
        0x08008bfc:    3d8fdc46    F..=    DCD    1032838214
        0x08008c00:    3d90e86f    o..=    DCD    1032906863
        0x08008c04:    3d91f3c7    ...=    DCD    1032975303
        0x08008c08:    3d92fe4d    M..=    DCD    1033043533
        0x08008c0c:    3d940801    ...=    DCD    1033111553
        0x08008c10:    3d9510e1    ...=    DCD    1033179361
        0x08008c14:    3d9618ef    ...=    DCD    1033246959
        0x08008c18:    3d972029    ) .=    DCD    1033314345
        0x08008c1c:    3d98268f    .&.=    DCD    1033381519
        0x08008c20:    3d992c21    !,.=    DCD    1033448481
        0x08008c24:    3d9a30de    .0.=    DCD    1033515230
        0x08008c28:    3d9b34c7    .4.=    DCD    1033581767
        0x08008c2c:    3d9c37da    .7.=    DCD    1033648090
        0x08008c30:    3d9d3a18    .:.=    DCD    1033714200
        0x08008c34:    3d9e3b80    .;.=    DCD    1033780096
        0x08008c38:    3d9f3c13    .<.=    DCD    1033845779
        0x08008c3c:    3da03bd0    .;.=    DCD    1033911248
        0x08008c40:    3da13ab6    .:.=    DCD    1033976502
        0x08008c44:    3da238c6    .8.=    DCD    1034041542
        0x08008c48:    3da33600    .6.=    DCD    1034106368
        0x08008c4c:    3da43263    c2.=    DCD    1034170979
        0x08008c50:    3da52df0    .-.=    DCD    1034235376
        0x08008c54:    3da628a5    .(.=    DCD    1034299557
        0x08008c58:    3da72284    .".=    DCD    1034363524
        0x08008c5c:    3da81b8c    ...=    DCD    1034427276
        0x08008c60:    3da913bc    ...=    DCD    1034490812
        0x08008c64:    3daa0b16    ...=    DCD    1034554134
        0x08008c68:    3dab0199    ...=    DCD    1034617241
        0x08008c6c:    3dabf744    D..=    DCD    1034680132
        0x08008c70:    3dacec19    ...=    DCD    1034742809
        0x08008c74:    3dade016    ...=    DCD    1034805270
        0x08008c78:    3daed33d    =..=    DCD    1034867517
        0x08008c7c:    3dafc58d    ...=    DCD    1034929549
        0x08008c80:    3db0b705    ...=    DCD    1034991365
        0x08008c84:    3db1a7a7    ...=    DCD    1035052967
        0x08008c88:    3db29773    s..=    DCD    1035114355
        0x08008c8c:    3db38668    h..=    DCD    1035175528
        0x08008c90:    3db47486    .t.=    DCD    1035236486
        0x08008c94:    3db561ce    .a.=    DCD    1035297230
        0x08008c98:    3db64e40    @N.=    DCD    1035357760
        0x08008c9c:    3db739dc    .9.=    DCD    1035418076
        0x08008ca0:    3db824a2    .$.=    DCD    1035478178
        0x08008ca4:    3db90e93    ...=    DCD    1035538067
        0x08008ca8:    3db9f7ae    ...=    DCD    1035597742
        0x08008cac:    3dbadff4    ...=    DCD    1035657204
        0x08008cb0:    3dbbc765    e..=    DCD    1035716453
        0x08008cb4:    3dbcae01    ...=    DCD    1035775489
        0x08008cb8:    3dbd93c9    ...=    DCD    1035834313
        0x08008cbc:    3dbe78bd    .x.=    DCD    1035892925
        0x08008cc0:    3dbf5cdc    .\.=    DCD    1035951324
        0x08008cc4:    3dc04028    (@.=    DCD    1036009512
        0x08008cc8:    3dc122a0    .".=    DCD    1036067488
        0x08008ccc:    3dc20446    F..=    DCD    1036125254
        0x08008cd0:    3dc2e518    ...=    DCD    1036182808
        0x08008cd4:    3dc3c519    ...=    DCD    1036240153
        0x08008cd8:    3dc4a447    G..=    DCD    1036297287
        0x08008cdc:    3dc582a3    ...=    DCD    1036354211
        0x08008ce0:    3dc6602d    -`.=    DCD    1036410925
        0x08008ce4:    3dc73ce7    .<.=    DCD    1036467431
        0x08008ce8:    3dc818d0    ...=    DCD    1036523728
        0x08008cec:    3dc8f3e9    ...=    DCD    1036579817
        0x08008cf0:    3dc9ce31    1..=    DCD    1036635697
        0x08008cf4:    3dcaa7aa    ...=    DCD    1036691370
        0x08008cf8:    3dcb8054    T..=    DCD    1036746836
        0x08008cfc:    3dcc582f    /X.=    DCD    1036802095
        0x08008d00:    3dcd2f3c    </.=    DCD    1036857148
        0x08008d04:    3dce057b    {..=    DCD    1036911995
        0x08008d08:    3dcedaed    ...=    DCD    1036966637
        0x08008d0c:    3dcfaf91    ...=    DCD    1037021073
        0x08008d10:    3dd08369    i..=    DCD    1037075305
        0x08008d14:    3dd15675    uV.=    DCD    1037129333
        0x08008d18:    3dd228b5    .(.=    DCD    1037183157
        0x08008d1c:    3dd2fa2a    *..=    DCD    1037236778
        0x08008d20:    3dd3cad4    ...=    DCD    1037290196
        0x08008d24:    3dd49ab4    ...=    DCD    1037343412
        0x08008d28:    3dd569ca    .i.=    DCD    1037396426
        0x08008d2c:    3dd63817    .8.=    DCD    1037449239
        0x08008d30:    3dd7059b    ...=    DCD    1037501851
        0x08008d34:    3dd7d257    W..=    DCD    1037554263
        0x08008d38:    3dd89e4b    K..=    DCD    1037606475
        0x08008d3c:    3dd96978    xi.=    DCD    1037658488
        0x08008d40:    3dda33de    .3.=    DCD    1037710302
        0x08008d44:    3ddafd7f    ...=    DCD    1037761919
        0x08008d48:    3ddbc659    Y..=    DCD    1037813337
        0x08008d4c:    3ddc8e6f    o..=    DCD    1037864559
        0x08008d50:    3ddd55c0    .U.=    DCD    1037915584
        0x08008d54:    3dde1c4d    M..=    DCD    1037966413
        0x08008d58:    3ddee216    ...=    DCD    1038017046
        0x08008d5c:    3ddfa71d    ...=    DCD    1038067485
        0x08008d60:    3de06b61    ak.=    DCD    1038117729
        0x08008d64:    3de12ee4    ...=    DCD    1038167780
        0x08008d68:    3de1f1a5    ...=    DCD    1038217637
        0x08008d6c:    3de2b3a6    ...=    DCD    1038267302
        0x08008d70:    3de374e7    .t.=    DCD    1038316775
        0x08008d74:    3de43568    h5.=    DCD    1038366056
        0x08008d78:    3de4f52b    +..=    DCD    1038415147
        0x08008d7c:    3de5b42f    /..=    DCD    1038464047
        0x08008d80:    3de67276    vr.=    DCD    1038512758
        0x08008d84:    3de73000    .0.=    DCD    1038561280
        0x08008d88:    3de7eccd    ...=    DCD    1038609613
        0x08008d8c:    3de8a8de    ...=    DCD    1038657758
        0x08008d90:    3de96435    5d.=    DCD    1038705717
        0x08008d94:    3dea1ed0    ...=    DCD    1038753488
        0x08008d98:    3dead8b2    ...=    DCD    1038801074
        0x08008d9c:    3deb91da    ...=    DCD    1038848474
        0x08008da0:    3dec4a49    IJ.=    DCD    1038895689
        0x08008da4:    3ded0200    ...=    DCD    1038942720
        0x08008da8:    3dedb900    ...=    DCD    1038989568
        0x08008dac:    3dee6f48    Ho.=    DCD    1039036232
        0x08008db0:    3def24db    .$.=    DCD    1039082715
        0x08008db4:    3defd9b7    ...=    DCD    1039129015
        0x08008db8:    3df08ddf    ...=    DCD    1039175135
        0x08008dbc:    3df14152    RA.=    DCD    1039221074
        0x08008dc0:    3df1f412    ...=    DCD    1039266834
        0x08008dc4:    3df2a61e    ...=    DCD    1039312414
        0x08008dc8:    3df35778    xW.=    DCD    1039357816
        0x08008dcc:    3df40820     ..=    DCD    1039403040
        0x08008dd0:    3df4b816    ...=    DCD    1039448086
        0x08008dd4:    3df5675d    ]g.=    DCD    1039492957
        0x08008dd8:    3df615f3    ...=    DCD    1039537651
        0x08008ddc:    3df6c3da    ...=    DCD    1039582170
        0x08008de0:    3df77112    .q.=    DCD    1039626514
        0x08008de4:    3df81d9c    ...=    DCD    1039670684
        0x08008de8:    3df8c979    y..=    DCD    1039714681
        0x08008dec:    3df974aa    .t.=    DCD    1039758506
        0x08008df0:    3dfa1f2e    ...=    DCD    1039802158
        0x08008df4:    3dfac907    ...=    DCD    1039845639
        0x08008df8:    3dfb7235    5r.=    DCD    1039888949
        0x08008dfc:    3dfc1ab8    ...=    DCD    1039932088
        0x08008e00:    3dfcc293    ...=    DCD    1039975059
        0x08008e04:    3dfd69c5    .i.=    DCD    1040017861
        0x08008e08:    3dfe104e    N..=    DCD    1040060494
        0x08008e0c:    3dfeb630    0..=    DCD    1040102960
        0x08008e10:    3dff5b6b    k[.=    DCD    1040145259
        0x08008e14:    3e000000    ...>    DCD    1040187392
    .constdata
    _aInitStr
        0x08008e18:    00000000    ....    DCD    0
        0x08008e1c:    54540000    ..TT    DCD    1414791168
        0x08008e20:    45522052    R RE    DCD    1163010130
        0x08008e24:    53454747    GGES    DCD    1397049159
        0x08008e28:    00000000    ....    DCD    0
    .constdata
    USART_PRESCALER_TAB
        0x08008e2c:    00000001    ....    DCD    1
        0x08008e30:    00000002    ....    DCD    2
        0x08008e34:    00000004    ....    DCD    4
        0x08008e38:    00000006    ....    DCD    6
        0x08008e3c:    00000008    ....    DCD    8
        0x08008e40:    0000000a    ....    DCD    10
        0x08008e44:    0000000c    ....    DCD    12
        0x08008e48:    00000010    ....    DCD    16
        0x08008e4c:    00000020     ...    DCD    32
        0x08008e50:    00000040    @...    DCD    64
        0x08008e54:    00000080    ....    DCD    128
        0x08008e58:    00000100    ....    DCD    256
    Region$$Table$$Base
        0x08008e5c:    08008e7c    |...    DCD    134254204
        0x08008e60:    20000000    ...     DCD    536870912
        0x08008e64:    00000268    h...    DCD    616
        0x08008e68:    08000214    ....    DCD    134218260
        0x08008e6c:    08008f80    ....    DCD    134254464
        0x08008e70:    20000268    h..     DCD    536871528
        0x08008e74:    00001f68    h...    DCD    8040
        0x08008e78:    08000270    p...    DCD    134218352
    Region$$Table$$Limit

** Section #2 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 260 bytes (alignment 8)
    Address: 0x20000000


** Section #3 'RW_IRAM1' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 8040 bytes (alignment 8)
    Address: 0x20000268


** Section #4 '.debug_abbrev' (SHT_PROGBITS)
    Size   : 1476 bytes


** Section #5 '.debug_frame' (SHT_PROGBITS)
    Size   : 8172 bytes


** Section #6 '.debug_info' (SHT_PROGBITS)
    Size   : 403436 bytes


** Section #7 '.debug_line' (SHT_PROGBITS)
    Size   : 61816 bytes


** Section #8 '.debug_loc' (SHT_PROGBITS)
    Size   : 23784 bytes


** Section #9 '.debug_macinfo' (SHT_PROGBITS)
    Size   : 1379884 bytes


** Section #10 '.debug_pubnames' (SHT_PROGBITS)
    Size   : 10422 bytes


** Section #11 '.symtab' (SHT_SYMTAB)
    Size   : 18528 bytes (alignment 4)
    String table #12 '.strtab'
    Last local symbol no. 769


** Section #12 '.strtab' (SHT_STRTAB)
    Size   : 19920 bytes


** Section #13 '.note' (SHT_NOTE)
    Size   : 28 bytes (alignment 4)


** Section #14 '.comment' (SHT_PROGBITS)
    Size   : 86552 bytes


** Section #15 '.shstrtab' (SHT_STRTAB)
    Size   : 156 bytes


